<template><div><h1 id="описание-функции" tabindex="-1"><a class="header-anchor" href="#описание-функции"><span>Описание функций</span></a></h1>
<div class="custom-container danger"><p class="custom-container-title">DANGER</p>
<p>Раздел в разработке</p>
</div>
<p>На этой странице дано подробное описание всех функций системы. Страница большая, функций много, крепитесь 😃</p>
<div class="custom-container tip"><p class="custom-container-title">Подсказка</p>
<p>В <RouteLink to="/real-life-scenarios/">разделе</RouteLink> приведеные реальные сценарии использования системы, возможно начать оттуда будет лучшей идей.</p>
</div>
<nav class="table-of-contents"><ul><li><router-link to="#редактор-bpmn">Редактор BPMN</router-link><ul><li><router-link to="#левое-меню">Левое меню</router-link></li><li><router-link to="#меню-сохранения">Меню сохранения</router-link></li><li><router-link to="#верхнее-меню">Верхнее меню</router-link></li><li><router-link to="#контекстное-меню">Контекстное меню</router-link></li><li><router-link to="#меню-оверлеев">Меню оверлеев</router-link></li><li><router-link to="#меню-представлении">Меню представлений</router-link></li><li><router-link to="#правое-меню">Правое меню</router-link></li><li><router-link to="#обеспечение-удобства-работы">Обеспечение удобства работы</router-link></li></ul></li><li><router-link to="#редактор-групп-процессов">Редактор групп процессов</router-link><ul><li><router-link to="#создание-группы-процессов">Создание группы процессов</router-link></li><li><router-link to="#как-работать-с-группами">Как работать с группами</router-link></li><li><router-link to="#горячие-клавиши">Горячие клавиши</router-link></li></ul></li><li><router-link to="#описание-задач">Описание задач</router-link></li><li><router-link to="#домашняя-страница">Домашняя страница</router-link></li><li><router-link to="#оргструктура">Оргструктура</router-link><ul><li><router-link to="#загрузка-из-csv">Загрузка из CSV</router-link></li></ul></li><li><router-link to="#группы-процессов">Группы процессов</router-link></li><li><router-link to="#регламенты">Регламенты</router-link></li><li><router-link to="#версионирование">Версионирование</router-link></li><li><router-link to="#комментирование">Комментирование</router-link></li><li><router-link to="#графы">Графы</router-link></li><li><router-link to="#согласование">Согласование</router-link></li><li><router-link to="#импорт-процессов">Импорт процессов</router-link></li><li><router-link to="#экспорт-процессов">Экспорт процессов</router-link></li><li><router-link to="#поиск-процессов">Поиск процессов</router-link></li><li><router-link to="#элементы-архитектуры-1">Элементы архитектуры</router-link><ul><li><router-link to="#загрузка-из-csv-1">Загрузка из CSV</router-link></li></ul></li><li><router-link to="#связь-процессов">Связь процессов</router-link></li><li><router-link to="#сравнение-as-is-и-to-be">Сравнение AS-IS и TO-BE</router-link></li><li><router-link to="#обеспечение-качества">Обеспечение качества</router-link><ul><li><router-link to="#оценка-качества">Оценка качества</router-link></li><li><router-link to="#проверка-токена">Проверка токена</router-link></li></ul></li><li><router-link to="#папки">Папки</router-link></li><li><router-link to="#теги">Теги</router-link></li><li><router-link to="#роли">Роли</router-link><ul><li><router-link to="#создание-ролеи">Создание ролей</router-link></li><li><router-link to="#редактирование-ролеи">Редактирование ролей</router-link></li><li><router-link to="#удаление-ролеи">Удаление ролей</router-link></li></ul></li></ul></nav>
<h2 id="редактор-bpmn" tabindex="-1"><a class="header-anchor" href="#редактор-bpmn"><span>Редактор BPMN</span></a></h2>
<p>Наш редактор имеет множество функций и все они направлены на обеспечение удобства работы с BPMN диаграммами.<br>
Рассмотрим подробнее все возможности:
<img src="@source/features/bpmn-modeler.png" alt="image"></p>
<h3 id="левое-меню" tabindex="-1"><a class="header-anchor" href="#левое-меню"><span>Левое меню</span></a></h3>
<p>Левое меню предназначено для выбора и использования элементов BPMN и обеспечения удобства использования редактора.</p>
<div class="custom-container warning"><p class="custom-container-title">Не все элементы</p>
<p>В левом меню не все элементы BPMN, но это не значит их нет в системе 😃 Типы элементов меняются в контекстном меню.</p>
</div>
<p>Советуем обратить внимание на кнопки, обеспечивающие удобство работы:</p>
<p><img src="@source/features/left-menu.gif" alt="image"></p>
<p>Для понимания того, в какие элементы можно превратить элементы, нужно понимать <RouteLink to="//bpmn/">BPMN</RouteLink> - сервис старается защитить вас от ошибок и не дать использовать элементы, которые невозможны по нотации.</p>
<h3 id="меню-сохранения" tabindex="-1"><a class="header-anchor" href="#меню-сохранения"><span>Меню сохранения</span></a></h3>
<h4 id="сохранение-диаграммы" tabindex="-1"><a class="header-anchor" href="#сохранение-диаграммы"><span>Сохранение диаграммы</span></a></h4>
<p>В этом меню вы можете:</p>
<ul>
<li>Указать название диаграммы</li>
<li>Указать <a href="#%D0%BF%D0%B0%D0%BF%D0%BA%D0%B8">папку</a></li>
<li>Добавить <a href="#%D1%82%D0%B5%D0%B3%D0%B8">теги</a></li>
<li>Указать тип-процесса (AS-IS / TO-BE) и связать со вторым процессом для <a href="#%D1%81%D1%80%D0%B0%D0%B2%D0%BD%D0%B5%D0%BD%D0%B8%D0%B5-as-is-%D0%B8-to-be">сравнения</a></li>
<li>Указать комментарий к текущей версии</li>
<li>Оценить [качество] вашей диаграммы</li>
</ul>
<div class="custom-container tip"><p class="custom-container-title">TIP</p>
<p>При сохранении создается <a href="#%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D0%BE%D0%BD%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">версия</a>, к которой можно откатиться или выполнить сравнение</p>
</div>
<p>В этом же меню сохранить <strong>чужую диаграмму</strong>, к которой вы не имеете доступа на редактирование, в свои диаграммы.</p>
<p><img src="@source/features/save-menu.png" alt="image"></p>
<h4 id="скачать" tabindex="-1"><a class="header-anchor" href="#скачать"><span>Скачать</span></a></h4>
<p>В этом меню можно скачать диаграмму в нужном формате, включая <a href="#%D1%80%D0%B5%D0%B3%D0%BB%D0%B0%D0%BC%D0%B5%D0%BD%D1%82%D1%8B">.docx</a>
<img src="@source/features/download-menu.png" alt="image"></p>
<div class="custom-container tip"><p class="custom-container-title">TIP</p>
<p>Скачивание картинки с <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%BE%D0%B2%D0%B5%D1%80%D0%BB%D0%B5%D0%B5%D0%B2">оверлеями</a> доступно по другой кнопке</p>
</div>
<h4 id="поделиться-диаграммои" tabindex="-1"><a class="header-anchor" href="#поделиться-диаграммои"><span>Поделиться диаграммой</span></a></h4>
<p>В этом меню можно предоставить/отзовать доступ на диаграмму:</p>
<ul>
<li>Анонимно (не требует учетной записи в системе)</li>
<li>Конкретному человеку по e-mail с указанием прав (просматривать/редактировать)</li>
<li>Получить код для встраивания диаграммы, она будет выглядеть вот так:</li>
</ul>
<iframe src="https://stormbpmn.com/app/diagram/0855ae10-6ef8-4a23-9df0-f7d6cef12722?embedded=true" style="border:1px #f2f2f2 none;" name="extAdmin" scrolling="yes" frameborder="1"  height="500" width="100%" allowfullscreen></iframe>
<p><img src="@source/features/share-diagram.png" alt="image"></p>
<p>Больше о <RouteLink to="/team-work/">совместной работе</RouteLink></p>
<h4 id="сменить-статус" tabindex="-1"><a class="header-anchor" href="#сменить-статус"><span>Сменить статус</span></a></h4>
<p>Для информирования коллег о состоянии работы над процессом можно использовать статусы.</p>
<ul>
<li><strong>Новый</strong> - процесс еще не трогали, просто создали.</li>
<li><strong>В работе</strong> - над процессом активно идет работа.</li>
<li><strong>На согласовании</strong> - процесс согласуется с кем-то, менять схему <strong>нельзя</strong>. Подробнее в <a href="#%D1%81%D0%BE%D0%B3%D0%BB%D0%B0%D1%81%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">согласованиях</a></li>
<li><strong>Готов</strong> - процесс готов к работе. Меня схему нельзя.
<img src="@source/features/change-status.png" alt="image"></li>
</ul>
<div class="custom-container warning"><p class="custom-container-title">WARNING</p>
<p>Сейчас менять или добавлять статусы нельзя.</p>
</div>
<h4 id="as-is-и-to-be" tabindex="-1"><a class="header-anchor" href="#as-is-и-to-be"><span>AS-IS и TO-BE</span></a></h4>
<p>Если в <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D1%81%D0%BE%D1%85%D1%80%D0%B0%D0%BD%D0%B5%D0%BD%D0%B8%D1%8F">меню сохранения</a> вы указали тип процесса и связанный процесс, то появится возможность быстро перемещаться между версиями AS-IS и TO-BE, а так же визуально сравнить их.
<img src="@source/features/as-is-to-be.png" alt="image"></p>
<h3 id="верхнее-меню" tabindex="-1"><a class="header-anchor" href="#верхнее-меню"><span>Верхнее меню</span></a></h3>
<p>Верхнее меню предназначено для работы с конкретной диаграммой и предоставляет возможности:<br>
<img src="@source/features/up-menu.png" alt="image"></p>
<ol>
<li>Развернуть диаграмму на полный экран</li>
<li>Открыть панель свойств BPMN/свойств Camunda.</li>
<li>Включить <a href="#%D0%BE%D1%86%D0%B5%D0%BD%D0%BA%D0%B0-%D0%BA%D0%B0%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%B0">проверку ошибок</a>.</li>
<li>Отключить проверку ошибок.</li>
<li>Отменить последнее дейсвтие.</li>
<li>Повторить последнее действие.</li>
<li>Распределить выделенные элементы по горизонтали.</li>
<li>Выровнять выделенные элементы по центру.</li>
<li>Приблизить.</li>
<li>Отдалить.</li>
<li>Включить отображение всех <a href="#%D1%80%D0%BE%D0%BB%D0%B8">ролей</a>.</li>
<li>Включить отображение деталей задачи по клику. При клике на задачу будет открываться контекстное <a href="#%D0%BF%D1%80%D0%B0%D0%B2%D0%BE%D0%B5-%D0%BC%D0%B5%D0%BD%D1%8E">правое меню</a>.</li>
<li>Включить отображение всех элементов архитектуры. При клике на задачу будет открываться контекстное <a href="#%D0%BF%D1%80%D0%B0%D0%B2%D0%BE%D0%B5-%D0%BC%D0%B5%D0%BD%D1%8E">правое меню</a>.</li>
<li>Включить отображение связей процесса. При клике на задачу будет открываться контекстное <a href="#%D0%BF%D1%80%D0%B0%D0%B2%D0%BE%D0%B5-%D0%BC%D0%B5%D0%BD%D1%8E">правое меню</a>.</li>
<li>Включить или выключить миникарту.</li>
<li>Сменить цвет выбранным элементам.</li>
<li>Сравнить текущую <a href="#%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D0%BE%D0%BD%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">версию</a> с предидущими. При клике на задачу будет открываться контекстное <a href="#%D0%BF%D1%80%D0%B0%D0%B2%D0%BE%D0%B5-%D0%BC%D0%B5%D0%BD%D1%8E">правое меню</a>.</li>
<li>Отключить отображение сравнения версий.</li>
<li>Включить комментарии. При клике на задачу будет открываться контекстное <a href="#%D0%BF%D1%80%D0%B0%D0%B2%D0%BE%D0%B5-%D0%BC%D0%B5%D0%BD%D1%8E">правое меню</a>.</li>
<li>Скопировать выделенные элементы для вставки между вкладками.</li>
<li>Вставить выделенные элементы из другой вкладки.</li>
<li>Включить автонумерацию элементов.</li>
<li>Отключить автонумерацию элементов.</li>
<li>Открыть встроенную справку по <RouteLink to="/bpmn/">BPMN</RouteLink> и горячим клавишам.</li>
</ol>
<h3 id="контекстное-меню" tabindex="-1"><a class="header-anchor" href="#контекстное-меню"><span>Контекстное меню</span></a></h3>
<h3 id="меню-оверлеев" tabindex="-1"><a class="header-anchor" href="#меню-оверлеев"><span>Меню оверлеев</span></a></h3>
<h3 id="меню-представлении" tabindex="-1"><a class="header-anchor" href="#меню-представлении"><span>Меню представлений</span></a></h3>
<h3 id="правое-меню" tabindex="-1"><a class="header-anchor" href="#правое-меню"><span>Правое меню</span></a></h3>
<p>Правое меню отображает контекстую информацию к диаграмме в зависимости от выбранных настроек в <a href="#%D0%B2%D0%B5%D1%80%D1%85%D0%BD%D0%B5%D0%B5-%D0%BC%D0%B5%D0%BD%D1%8E">верхнем меню</a>.</p>
<h4 id="детали-по-клику" tabindex="-1"><a class="header-anchor" href="#детали-по-клику"><span>Детали по клику</span></a></h4>
<p>После включения соответсвующей настройки в правом меню появляется возможность:</p>
<ul>
<li>Поделиться ссылкой на конкретный элемент</li>
<li>Найти выбранный элемент на схеме</li>
<li>Установить <a href="#%D1%81%D0%B2%D1%8F%D0%B7%D1%8C-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%BE%D0%B2">связь</a> с Call Activity</li>
<li>Установить роль</li>
<li>Установить элементы архитектуры</li>
<li>Прочитать описание выбранной задачи</li>
<li>Просмотреть и написать комментарий к выбранной задачи</li>
</ul>
<p><img src="@source/features/click-details.png" alt="image"></p>
<div class="custom-container tip"><p class="custom-container-title">TIP</p>
<p>В этом представлении отображается схема выбранного Call Activity! Это удобный способ просматривать их содержимое с той же диаграммы, на которой оно используется.</p>
</div>
<h3 id="обеспечение-удобства-работы" tabindex="-1"><a class="header-anchor" href="#обеспечение-удобства-работы"><span>Обеспечение удобства работы</span></a></h3>
<h2 id="редактор-групп-процессов" tabindex="-1"><a class="header-anchor" href="#редактор-групп-процессов"><span>Редактор групп процессов</span></a></h2>
<div class="custom-container warning"><p class="custom-container-title">WARNING</p>
<p>Группы процессов работают только на тарифах TEAM и выше.</p>
</div>
<div class="custom-container danger"><p class="custom-container-title">DANGER</p>
<p>Функционал недавно выпущен и может содержать ошибки. Сообщайте о любых ошибках в чат в приложении, мы оперативно их устраним.</p>
</div>
<p>Группы процессов это отличная возможность моделировать процессы сверху-вниз. Вы можете смотреть на группы процессов как на простую иерархию, бизнес-возможности(Business Capability) или бизнес-функции.</p>
<p><img src="@source/features/diagram-group.png" alt="image"></p>
<div class="custom-container tip"><p class="custom-container-title">TIP</p>
<p>Вложенность групп неограничена, но по практике лучше не использовать больше 3-4 уровней, а сложные структуры проектировать через вложенность диаграммы групп в диаграммы групп.</p>
</div>
<h3 id="создание-группы-процессов" tabindex="-1"><a class="header-anchor" href="#создание-группы-процессов"><span>Создание группы процессов</span></a></h3>
<p>Создать группу процессов можно так:
<img src="@source/features/create-group.png" alt="image"></p>
<div class="custom-container tip"><p class="custom-container-title">TIP</p>
<p>Групп процессов может быть сколько угодно! Это значит что вы можете формировать разные иерархии для разных целей. И этими группами можно так же <a href="#%D0%BF%D0%BE%D0%B4%D0%B5%D0%BB%D0%B8%D1%82%D1%8C%D1%81%D1%8F-%D0%B4%D0%B8%D0%B0%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%BE%D0%B8">делиться по ссылке</a>. А еще работаю <a href="#%D0%BA%D0%BE%D0%BC%D0%BC%D0%B5%D0%BD%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">комментарии</a>.</p>
</div>
<h3 id="как-работать-с-группами" tabindex="-1"><a class="header-anchor" href="#как-работать-с-группами"><span>Как работать с группами</span></a></h3>
<ol>
<li>Добавьте группу нужного размера:<br>
<img src="@source/features/create-group-1.png" alt="image"></li>
<li>Двойным кликом на группу откройте меню редактирования группы:
<img src="@source/features/create-group-2.png" alt="image"></li>
<li>Укажите информацию о группе:
<ul>
<li>Название</li>
<li>Цвет</li>
<li>Описание</li>
<li>Приоритет (возможно использовать для фильтрации)</li>
<li>Уровень (возможно использовать для фильтрации)</li>
</ul>
</li>
<li>Укажите связь группы с реализацией. Тут 2 возможности:
<ul>
<li><strong>Создать новую</strong> - создастся &quot;заглушка&quot; процесса (если выбрать BPMN) или группы процессов (если выбрать BCM). Отличная возможность приступить к реализации позднее или раздать задачи бизнес-аналиткам для моделирования.</li>
<li><strong>Существующая схема</strong> - позволяет выбрать уже существующую реализацию процесса или группы процессов. Отлично подойдет, если вы из существующих процессов формируете иерархию. <strong>Существующая схема может быть привязана к любому количеству групп</strong>.</li>
</ul>
</li>
</ol>
<div class="custom-container tip"><p class="custom-container-title">TIP</p>
<p>Привязка реализации позволяет отслеживать статус работы над реализацией и визуализировать ваш процесс по моделированию всей иерархии!
<img src="@source/features/create-group-3.png" alt="image"></p>
</div>
<ol start="5">
<li>
<p>Формируйте группы и перемещайте их друг в друга, чтобы отобразить иерархию. Чтобы вытащить группы другой группы, зажмите <strong>CTRL</strong> и перемещайте ее за границу родителя.</p>
</li>
<li>
<p>Используйте правое меню для навигации или просмотра фильтра групп. В фильтре работают: - Фильтр по названию группы - Фильтр по названию родительской группы - Фильтр по статусу привязанного процесса (new, progress, approve, done ) - Фильтр по типу (BPMN, BCM) - Фильтр по названию связанного процесса 7. Используйте фильтр и навигируйтесь по иерархии кликом на симол лупы с картой.<br>
<img src="@source/features/create-group-4.png" alt="image"></p>
</li>
</ol>
<h3 id="горячие-клавиши" tabindex="-1"><a class="header-anchor" href="#горячие-клавиши"><span>Горячие клавиши</span></a></h3>
<p>Редактор групп поддерживает горячие клавиши:</p>
<ul>
<li><strong>CTRL+Z</strong> - отменить последнее действие.</li>
<li><strong>CTRL+Y</strong> - повторить последнее действие.</li>
<li><strong>CTRL+C</strong> - скопировать группу (без дочерних).</li>
<li><strong>CTRL+V</strong> - вставить группу.</li>
<li><strong>DEL</strong> - удалить группу с дочерними.</li>
</ul>
<h4 id="элементы-архитектуры" tabindex="-1"><a class="header-anchor" href="#элементы-архитектуры"><span>Элементы архитектуры</span></a></h4>
<h4 id="связи-процесса" tabindex="-1"><a class="header-anchor" href="#связи-процесса"><span>Связи процесса</span></a></h4>
<h4 id="сравнение-версии" tabindex="-1"><a class="header-anchor" href="#сравнение-версии"><span>Сравнение версий</span></a></h4>
<h4 id="комментарии" tabindex="-1"><a class="header-anchor" href="#комментарии"><span>Комментарии</span></a></h4>
<h4 id="горячие-клавиши-1" tabindex="-1"><a class="header-anchor" href="#горячие-клавиши-1"><span>Горячие клавиши</span></a></h4>
<h4 id="копирование-между-разными-диаграммами" tabindex="-1"><a class="header-anchor" href="#копирование-между-разными-диаграммами"><span>Копирование между разными диаграммами</span></a></h4>
<h4 id="смена-цветов" tabindex="-1"><a class="header-anchor" href="#смена-цветов"><span>Смена цветов</span></a></h4>
<h4 id="горячие-клавиши-2" tabindex="-1"><a class="header-anchor" href="#горячие-клавиши-2"><span>Горячие клавиши</span></a></h4>
<h2 id="описание-задач" tabindex="-1"><a class="header-anchor" href="#описание-задач"><span>Описание задач</span></a></h2>
<h2 id="домашняя-страница" tabindex="-1"><a class="header-anchor" href="#домашняя-страница"><span>Домашняя страница</span></a></h2>
<h2 id="оргструктура" tabindex="-1"><a class="header-anchor" href="#оргструктура"><span>Оргструктура</span></a></h2>
<h3 id="загрузка-из-csv" tabindex="-1"><a class="header-anchor" href="#загрузка-из-csv"><span>Загрузка из CSV</span></a></h3>
<h2 id="группы-процессов" tabindex="-1"><a class="header-anchor" href="#группы-процессов"><span>Группы процессов</span></a></h2>
<h2 id="регламенты" tabindex="-1"><a class="header-anchor" href="#регламенты"><span>Регламенты</span></a></h2>
<h2 id="версионирование" tabindex="-1"><a class="header-anchor" href="#версионирование"><span>Версионирование</span></a></h2>
<h2 id="комментирование" tabindex="-1"><a class="header-anchor" href="#комментирование"><span>Комментирование</span></a></h2>
<h2 id="графы" tabindex="-1"><a class="header-anchor" href="#графы"><span>Графы</span></a></h2>
<h2 id="согласование" tabindex="-1"><a class="header-anchor" href="#согласование"><span>Согласование</span></a></h2>
<h2 id="импорт-процессов" tabindex="-1"><a class="header-anchor" href="#импорт-процессов"><span>Импорт процессов</span></a></h2>
<h2 id="экспорт-процессов" tabindex="-1"><a class="header-anchor" href="#экспорт-процессов"><span>Экспорт процессов</span></a></h2>
<h2 id="поиск-процессов" tabindex="-1"><a class="header-anchor" href="#поиск-процессов"><span>Поиск процессов</span></a></h2>
<h2 id="элементы-архитектуры-1" tabindex="-1"><a class="header-anchor" href="#элементы-архитектуры-1"><span>Элементы архитектуры</span></a></h2>
<h3 id="загрузка-из-csv-1" tabindex="-1"><a class="header-anchor" href="#загрузка-из-csv-1"><span>Загрузка из CSV</span></a></h3>
<h2 id="связь-процессов" tabindex="-1"><a class="header-anchor" href="#связь-процессов"><span>Связь процессов</span></a></h2>
<h2 id="сравнение-as-is-и-to-be" tabindex="-1"><a class="header-anchor" href="#сравнение-as-is-и-to-be"><span>Сравнение AS-IS и TO-BE</span></a></h2>
<h2 id="обеспечение-качества" tabindex="-1"><a class="header-anchor" href="#обеспечение-качества"><span>Обеспечение качества</span></a></h2>
<h3 id="оценка-качества" tabindex="-1"><a class="header-anchor" href="#оценка-качества"><span>Оценка качества</span></a></h3>
<h3 id="проверка-токена" tabindex="-1"><a class="header-anchor" href="#проверка-токена"><span>Проверка токена</span></a></h3>
<h2 id="папки" tabindex="-1"><a class="header-anchor" href="#папки"><span>Папки</span></a></h2>
<h2 id="теги" tabindex="-1"><a class="header-anchor" href="#теги"><span>Теги</span></a></h2>
<h2 id="роли" tabindex="-1"><a class="header-anchor" href="#роли"><span>Роли</span></a></h2>
<p>Роли это отличный инструмент для указания исполнителей задач. Под ролью понимается исполнитель конкретной задачи в процессе или процессах (т.к. Роли - это справочник, который можно переиспользовать). Роли это правильная и хорошая альтернатива дорожкам.</p>
<iframe width="560" height="315" src="https://www.youtube.com/embed/_2W10c0YzcI?si=Br3u2STg2zdWwIQ8" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>
<h3 id="создание-ролеи" tabindex="-1"><a class="header-anchor" href="#создание-ролеи"><span>Создание ролей</span></a></h3>
<div class="custom-container warning"><p class="custom-container-title">WARNING</p>
<p>Создавать роли может только <strong>администратор команды</strong>. Роли - это часть платной подписки TEAM или Enterprise. Без подписки использовать их не получится.</p>
</div>
<h4 id="с-интефеиса-процесса-в-контекстом-меню" tabindex="-1"><a class="header-anchor" href="#с-интефеиса-процесса-в-контекстом-меню"><span>С интефейса процесса в <a href="#%D0%BA%D0%BE%D0%BD%D1%82%D0%B5%D0%BA%D1%81%D1%82%D0%BD%D0%BE%D0%B5-%D0%BC%D0%B5%D0%BD%D1%8E">контекстом меню</a></span></a></h4>
<p><img src="@source/features/create-assignee.png" alt="image"></p>
<h4 id="с-интефеиса-процесса-в-описании-задач" tabindex="-1"><a class="header-anchor" href="#с-интефеиса-процесса-в-описании-задач"><span>С интефейса процесса в <a href="#%D0%BE%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D0%B8%D0%B5-%D0%B7%D0%B0%D0%B4%D0%B0%D1%87">описании задач</a></span></a></h4>
<p><img src="@source/features/create-assignee-2.png" alt="image"></p>
<h4 id="c-отдельного-представления" tabindex="-1"><a class="header-anchor" href="#c-отдельного-представления"><span>C отдельного представления</span></a></h4>
<p>По <a href="https://stormbpmn.com/app/team/assignees/" target="_blank" rel="noopener noreferrer">ссылке<ExternalLinkIcon/></a>:<br>
<img src="@source/features/create-assignee-3.png" alt="image"></p>
<h4 id="c-помощью-загрузки-из-csv" tabindex="-1"><a class="header-anchor" href="#c-помощью-загрузки-из-csv"><span>C помощью загрузки из .csv</span></a></h4>
<p>По <a href="https://stormbpmn.com/app/team" target="_blank" rel="noopener noreferrer">ссылке<ExternalLinkIcon/></a>:<br>
<img src="@source/features/create-assignee-4.png" alt="image"></p>
<h3 id="редактирование-ролеи" tabindex="-1"><a class="header-anchor" href="#редактирование-ролеи"><span>Редактирование ролей</span></a></h3>
<p>Редактирование ролей так же доступно в контекстом меню или с отдельного представления по <a href="https://stormbpmn.com/app/team/assignees/" target="_blank" rel="noopener noreferrer">ссылке<ExternalLinkIcon/></a>.</p>
<h3 id="удаление-ролеи" tabindex="-1"><a class="header-anchor" href="#удаление-ролеи"><span>Удаление ролей</span></a></h3>
<p>Удалять роли можно только с отдельного представления по <a href="https://stormbpmn.com/app/team/assignees/" target="_blank" rel="noopener noreferrer">ссылке<ExternalLinkIcon/></a>.</p>
<div class="custom-container warning"><p class="custom-container-title">WARNING</p>
<p>Удалить роли не получится, пока они привязаны к задачам на процессах. Отвяжите их перед удалением.</p>
</div>
</div></template>


