<template><div><h1 id="описание-функции" tabindex="-1"><a class="header-anchor" href="#описание-функции"><span>Описание функций</span></a></h1>
<div class="custom-container danger"><p class="custom-container-title">DANGER</p>
<p>Раздел в разработке</p>
</div>
<p>На этой странице дано подробное описание всех функций системы. Страница большая, функций много, крепитесь 😃</p>
<div class="custom-container tip"><p class="custom-container-title">Подсказка</p>
<p>В <RouteLink to="/real-life-scenarios/">разделе</RouteLink> приведеные реальные сценарии использования системы, возможно начать оттуда будет лучшей идей.</p>
</div>
<nav class="table-of-contents"><ul><li><router-link to="#редактор-bpmn">Редактор BPMN</router-link><ul><li><router-link to="#левое-меню">Левое меню</router-link></li><li><router-link to="#меню-сохранения">Меню сохранения</router-link></li><li><router-link to="#верхнее-меню">Верхнее меню</router-link></li><li><router-link to="#контекстное-меню">Контекстное меню</router-link></li><li><router-link to="#меню-оверлеев">Меню оверлеев</router-link></li><li><router-link to="#меню-представлении">Меню представлений</router-link></li><li><router-link to="#правое-меню">Правое меню</router-link></li><li><router-link to="#обеспечение-удобства-работы">Обеспечение удобства работы</router-link></li></ul></li><li><router-link to="#описание-задач">Описание задач</router-link></li><li><router-link to="#домашняя-страница">Домашняя страница</router-link></li><li><router-link to="#оргструктура">Оргструктура</router-link><ul><li><router-link to="#загрузка-из-csv">Загрузка из CSV</router-link></li></ul></li><li><router-link to="#группы-процессов">Группы процессов</router-link></li><li><router-link to="#регламенты">Регламенты</router-link></li><li><router-link to="#версионирование">Версионирование</router-link></li><li><router-link to="#комментирование">Комментирование</router-link></li><li><router-link to="#графы">Графы</router-link></li><li><router-link to="#согласование">Согласование</router-link></li><li><router-link to="#импорт-процессов">Импорт процессов</router-link></li><li><router-link to="#экспорт-процессов">Экспорт процессов</router-link></li><li><router-link to="#поиск-процессов">Поиск процессов</router-link></li><li><router-link to="#элементы-архитектуры">Элементы архитектуры</router-link><ul><li><router-link to="#загрузка-из-csv-1">Загрузка из CSV</router-link></li></ul></li><li><router-link to="#связь-процессов">Связь процессов</router-link></li><li><router-link to="#сравнение-as-is-и-to-be">Сравнение AS-IS и TO-BE</router-link></li><li><router-link to="#обеспечение-качества">Обеспечение качества</router-link><ul><li><router-link to="#оценка-качества">Оценка качества</router-link></li><li><router-link to="#проверка-токена">Проверка токена</router-link></li></ul></li><li><router-link to="#папки">Папки</router-link></li><li><router-link to="#роли">Роли</router-link></li><li><router-link to="#теги">Теги</router-link></li></ul></nav>
<h2 id="редактор-bpmn" tabindex="-1"><a class="header-anchor" href="#редактор-bpmn"><span>Редактор BPMN</span></a></h2>
<p>Наш редактор имеет множество функций и все они направлены на обеспечение удобства работы с BPMN диаграммами.<br>
Рассмотрим подробнее все возможности:
<img src="@source/features/bpmn-modeler.png" alt="image"></p>
<h3 id="левое-меню" tabindex="-1"><a class="header-anchor" href="#левое-меню"><span>Левое меню</span></a></h3>
<p>Левое меню предназначено для выбора и использования элементов BPMN и обеспечения удобства использования редактора.</p>
<div class="custom-container warning"><p class="custom-container-title">Не все элементы</p>
<p>В левом меню не все элементы BPMN, но это не значит их нет в системе 😃 Типы элементов меняются в контекстном меню.</p>
</div>
<p>Советуем обратить внимание на кнопки, обеспечивающие удобство работы:</p>
<p><img src="@source/features/left-menu.gif" alt="image"></p>
<p>Для понимания того, в какие элементы можно превратить элементы, нужно понимать <RouteLink to="//bpmn/">BPMN</RouteLink> - сервис старается защитить вас от ошибок и не дать использовать элементы, которые невозможны по нотации.</p>
<h3 id="меню-сохранения" tabindex="-1"><a class="header-anchor" href="#меню-сохранения"><span>Меню сохранения</span></a></h3>
<h4 id="сохранение-диаграммы" tabindex="-1"><a class="header-anchor" href="#сохранение-диаграммы"><span>Сохранение диаграммы</span></a></h4>
<p>В этом меню вы можете:</p>
<ul>
<li>Указать название диаграммы</li>
<li>Указать <a href="#%D0%BF%D0%B0%D0%BF%D0%BA%D0%B8">папку</a></li>
<li>Добавить <a href="#%D1%82%D0%B5%D0%B3%D0%B8">теги</a></li>
<li>Указать тип-процесса (AS-IS / TO-BE) и связать со вторым процессом для <a href="#%D1%81%D1%80%D0%B0%D0%B2%D0%BD%D0%B5%D0%BD%D0%B8%D0%B5-as-is-%D0%B8-to-be">сравнения</a></li>
<li>Указать комментарий к текущей версии</li>
<li>Оценить [качество] вашей диаграммы</li>
</ul>
<div class="custom-container tip"><p class="custom-container-title">TIP</p>
<p>При сохранении создается <a href="#%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D0%BE%D0%BD%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">версия</a>, к которой можно откатиться или выполнить сравнение</p>
</div>
<p>В этом же меню сохранить <strong>чужую диаграмму</strong>, к которой вы не имеете доступа на редактирование, в свои диаграммы.</p>
<p><img src="@source/features/save-menu.png" alt="image"></p>
<h4 id="скачать" tabindex="-1"><a class="header-anchor" href="#скачать"><span>Скачать</span></a></h4>
<p>В этом меню можно скачать диаграмму в нужном формате, включая <a href="#%D1%80%D0%B5%D0%B3%D0%BB%D0%B0%D0%BC%D0%B5%D0%BD%D1%82%D1%8B">.docx</a>
<img src="@source/features/download-menu.png" alt="image"></p>
<div class="custom-container tip"><p class="custom-container-title">TIP</p>
<p>Скачивание картинки с <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%BE%D0%B2%D0%B5%D1%80%D0%BB%D0%B5%D0%B5%D0%B2">оверлеями</a> доступно по другой кнопке</p>
</div>
<h4 id="поделиться-диаграммои" tabindex="-1"><a class="header-anchor" href="#поделиться-диаграммои"><span>Поделиться диаграммой</span></a></h4>
<p>В этом меню можно предоставить/отзовать доступ на диаграмму:</p>
<ul>
<li>Анонимно (не требует учетной записи в системе)</li>
<li>Конкретному человеку по e-mail с указанием прав (просматривать/редактировать)</li>
<li>Получить код для встраивания диаграммы, она будет выглядеть вот так:</li>
</ul>
 <iframe src="https://stormbpmn.com/app/diagram/0855ae10-6ef8-4a23-9df0-f7d6cef12722?embedded=true" style="border:1px #f2f2f2 none;" name="extAdmin" scrolling="yes" frameborder="1"  height="500" width="100%" allowfullscreen></iframe>
<p><img src="@source/features/share-diagram.png" alt="image"></p>
<p>Больше о <RouteLink to="/team-work/">совместной работе</RouteLink></p>
<h4 id="сменить-статус" tabindex="-1"><a class="header-anchor" href="#сменить-статус"><span>Сменить статус</span></a></h4>
<p>Для информирования коллег о состоянии работы над процессом можно использовать статусы.</p>
<ul>
<li><strong>Новый</strong> - процесс еще не трогали, просто создали.</li>
<li><strong>В работе</strong> - над процессом активно идет работа.</li>
<li><strong>На согласовании</strong> - процесс согласуется с кем-то, менять схему <strong>нельзя</strong>. Подробнее в <a href="#%D1%81%D0%BE%D0%B3%D0%BB%D0%B0%D1%81%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">согласованиях</a></li>
<li><strong>Готов</strong> - процесс готов к работе. Меня схему нельзя.
<img src="@source/features/change-status.png" alt="image"></li>
</ul>
<div class="custom-container warning"><p class="custom-container-title">WARNING</p>
<p>Сейчас менять или добавлять статусы нельзя.</p>
</div>
<h4 id="as-is-и-to-be" tabindex="-1"><a class="header-anchor" href="#as-is-и-to-be"><span>AS-IS и TO-BE</span></a></h4>
<p>Если в <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D1%81%D0%BE%D1%85%D1%80%D0%B0%D0%BD%D0%B5%D0%BD%D0%B8%D1%8F">меню сохранения</a> вы указали тип процесса и связанный процесс, то появится возможность быстро перемещаться между версиями AS-IS и TO-BE, а так же визуально сравнить их.
<img src="@source/features/as-is-to-be.png" alt="image"></p>
<p><img src="@source/features/as-is-to-be-2.gif" alt="image"></p>
<h3 id="верхнее-меню" tabindex="-1"><a class="header-anchor" href="#верхнее-меню"><span>Верхнее меню</span></a></h3>
<h3 id="контекстное-меню" tabindex="-1"><a class="header-anchor" href="#контекстное-меню"><span>Контекстное меню</span></a></h3>
<h3 id="меню-оверлеев" tabindex="-1"><a class="header-anchor" href="#меню-оверлеев"><span>Меню оверлеев</span></a></h3>
<h3 id="меню-представлении" tabindex="-1"><a class="header-anchor" href="#меню-представлении"><span>Меню представлений</span></a></h3>
<h3 id="правое-меню" tabindex="-1"><a class="header-anchor" href="#правое-меню"><span>Правое меню</span></a></h3>
<h3 id="обеспечение-удобства-работы" tabindex="-1"><a class="header-anchor" href="#обеспечение-удобства-работы"><span>Обеспечение удобства работы</span></a></h3>
<h4 id="горячие-клавиши" tabindex="-1"><a class="header-anchor" href="#горячие-клавиши"><span>Горячие клавиши</span></a></h4>
<h4 id="копирование-между-разными-диаграммами" tabindex="-1"><a class="header-anchor" href="#копирование-между-разными-диаграммами"><span>Копирование между разными диаграммами</span></a></h4>
<h4 id="смена-цветов" tabindex="-1"><a class="header-anchor" href="#смена-цветов"><span>Смена цветов</span></a></h4>
<h4 id="горячие-клавиши-1" tabindex="-1"><a class="header-anchor" href="#горячие-клавиши-1"><span>Горячие клавиши</span></a></h4>
<h2 id="описание-задач" tabindex="-1"><a class="header-anchor" href="#описание-задач"><span>Описание задач</span></a></h2>
<h2 id="домашняя-страница" tabindex="-1"><a class="header-anchor" href="#домашняя-страница"><span>Домашняя страница</span></a></h2>
<h2 id="оргструктура" tabindex="-1"><a class="header-anchor" href="#оргструктура"><span>Оргструктура</span></a></h2>
<h3 id="загрузка-из-csv" tabindex="-1"><a class="header-anchor" href="#загрузка-из-csv"><span>Загрузка из CSV</span></a></h3>
<h2 id="группы-процессов" tabindex="-1"><a class="header-anchor" href="#группы-процессов"><span>Группы процессов</span></a></h2>
<h2 id="регламенты" tabindex="-1"><a class="header-anchor" href="#регламенты"><span>Регламенты</span></a></h2>
<h2 id="версионирование" tabindex="-1"><a class="header-anchor" href="#версионирование"><span>Версионирование</span></a></h2>
<h2 id="комментирование" tabindex="-1"><a class="header-anchor" href="#комментирование"><span>Комментирование</span></a></h2>
<h2 id="графы" tabindex="-1"><a class="header-anchor" href="#графы"><span>Графы</span></a></h2>
<h2 id="согласование" tabindex="-1"><a class="header-anchor" href="#согласование"><span>Согласование</span></a></h2>
<h2 id="импорт-процессов" tabindex="-1"><a class="header-anchor" href="#импорт-процессов"><span>Импорт процессов</span></a></h2>
<h2 id="экспорт-процессов" tabindex="-1"><a class="header-anchor" href="#экспорт-процессов"><span>Экспорт процессов</span></a></h2>
<h2 id="поиск-процессов" tabindex="-1"><a class="header-anchor" href="#поиск-процессов"><span>Поиск процессов</span></a></h2>
<h2 id="элементы-архитектуры" tabindex="-1"><a class="header-anchor" href="#элементы-архитектуры"><span>Элементы архитектуры</span></a></h2>
<h3 id="загрузка-из-csv-1" tabindex="-1"><a class="header-anchor" href="#загрузка-из-csv-1"><span>Загрузка из CSV</span></a></h3>
<h2 id="связь-процессов" tabindex="-1"><a class="header-anchor" href="#связь-процессов"><span>Связь процессов</span></a></h2>
<h2 id="сравнение-as-is-и-to-be" tabindex="-1"><a class="header-anchor" href="#сравнение-as-is-и-to-be"><span>Сравнение AS-IS и TO-BE</span></a></h2>
<h2 id="обеспечение-качества" tabindex="-1"><a class="header-anchor" href="#обеспечение-качества"><span>Обеспечение качества</span></a></h2>
<h3 id="оценка-качества" tabindex="-1"><a class="header-anchor" href="#оценка-качества"><span>Оценка качества</span></a></h3>
<h3 id="проверка-токена" tabindex="-1"><a class="header-anchor" href="#проверка-токена"><span>Проверка токена</span></a></h3>
<h2 id="папки" tabindex="-1"><a class="header-anchor" href="#папки"><span>Папки</span></a></h2>
<h2 id="роли" tabindex="-1"><a class="header-anchor" href="#роли"><span>Роли</span></a></h2>
<h2 id="теги" tabindex="-1"><a class="header-anchor" href="#теги"><span>Теги</span></a></h2>
</div></template>


