<template><div><div class="hint-container caution">
<p class="hint-container-title">Предупреждение</p>
<p>Раздел в разработке</p>
</div>
<h1 id="обеспечение-информационнои-безопасности" tabindex="-1"><a class="header-anchor" href="#обеспечение-информационнои-безопасности"><span>Обеспечение информационной безопасности</span></a></h1>
<p>Мы серьезно относимся к обеспечению информационной безопасности при использовании нашего решения. Помимо регулярного обновления зависимостей, сканирования приложения сканерами уязвимости и устранение найденных уязвимостей, мы предоставляем важные настройки, которые позволяют существенно органичить возможности системы для неавторизованных пользователей.</p>
<h1 id="возможные-настроики" tabindex="-1"><a class="header-anchor" href="#возможные-настроики"><span>Возможные настройки</span></a></h1>
<p>В данном разделе перечислены общие настройки, которые могут быть связаны с обеспечением безопасности и удобства использования системы:</p>
<h2 id="переменные-окружения" tabindex="-1"><a class="header-anchor" href="#переменные-окружения"><span>Переменные окружения</span></a></h2>
<p>Настройки задаются с помощью ENV-переменных, переданных в контейнер:</p>
<ul>
<li><strong>STORM_ALLOWED_ORIGINS</strong> - определяет источник запросов из браузера (CORS). Значение по-умолчанию - *.</li>
<li><strong>STORM_DISABLE_SIMPLE_AUTH</strong> - запрещает авторизацию в системе по внутреннему механизму. Значение по-умолчанию - false.</li>
<li><strong>STORM_DISABLE_ENV_IN_UI</strong> - запрещает просмотр ENV-переменных в интерфейсе администратора системы. Значение по-умолчанию - false.</li>
<li><strong>STORM_DISABLE_ANON_SHARING</strong> - запрещает возможность поделиться диаграммой для анонимных пользователей. Значение по-умолчанию - false.</li>
<li><strong>JWT_SECRET</strong> - соль для паролей в базе.</li>
</ul>
<h2 id="административная-панель" tabindex="-1"><a class="header-anchor" href="#административная-панель"><span>Административная панель</span></a></h2>
<p>Переменные в административной панели:</p>
<ul>
<li><strong>showRegistraton</strong> - отображать или нет возможность регистрации в системы. По-умолчанию - true.</li>
<li><strong>showBasicLogin</strong> - отображать поля для входа с логином и паролем. По-умолчанию - true.</li>
<li><strong>showCustomLoginButtonName</strong> - отображать уникальный текст на кнопке входа. По-умолчанию - false.</li>
<li><strong>CustomLoginButtonName</strong>- текст на кнопке входа. По-умолчанию -&quot;Войти&quot;.</li>
<li><strong>enableAnonSearchPage</strong> - разрешить отображение страницы поиска для неавторизированных пользователей. По-умолчанию - false.</li>
<li><strong>enableCommonAssets</strong> - сделать элементы архитектуры общими для всего сервера. По-умолчанию - false.</li>
<li><strong>enableCommonRoles</strong> - сделать роли общими для всего сервера. По-умолчанию - false.</li>
<li><strong>enableCommonUsers</strong> - сделать всех сотрудников и оргструктуру общей для всего сервера. По-умолчанию - false.</li>
<li><strong>allDiagramsAnonAccess</strong> - разрешить анонимный доступ ко всех диаграммам. По-умолчанию - false..</li>
</ul>
</div></template>


