<template><div><h1 id="таблица-списка-диаграмм" tabindex="-1"><a class="header-anchor" href="#таблица-списка-диаграмм"><span>Таблица списка диаграмм</span></a></h1>
<h2 id="базовые-таблицы-вкладки" tabindex="-1"><a class="header-anchor" href="#базовые-таблицы-вкладки"><span>Базовые таблицы (вкладки)</span></a></h2>
<p>В меню со списками диаграмм есть три базовых вкладки:</p>
<ul>
<li>Все процессы:
<ul>
<li><em>в меню &quot;Личное&quot; отображаются диаграммы, которые создали Вы</em>;</li>
<li><em>в меню &quot;Команда&quot; - диаграммы, созданные всеми участниками команды (кроме скрытых автором)</em>;</li>
</ul>
</li>
<li>Поделился я  - <em>диаграммы к которым я предоставил доступ другим людям</em>;</li>
<li>Поделились со мной - <em>диаграммы к которым мне дали доступ</em>.
<img src="@source/features_new_storm/0_home-page/main_personal-menu.png" alt="image"></li>
</ul>
<h2 id="возможности-таблиц-вкладок" tabindex="-1"><a class="header-anchor" href="#возможности-таблиц-вкладок"><span>Возможности таблиц, вкладок</span></a></h2>
<p><strong>В каждой вкладке у пользователя есть возможности:</strong></p>
<h3 id="поиск-по-названию-диаграммы" tabindex="-1"><a class="header-anchor" href="#поиск-по-названию-диаграммы"><span>- Поиск по названию диаграммы</span></a></h3>
<p><img src="@source/features_new_storm/0_home-page/table_search.png" alt="image"></p>
<h3 id="фильтр" tabindex="-1"><a class="header-anchor" href="#фильтр"><span>- Фильтр:</span></a></h3>
<ol>
<li>тегам, <em>присвоенным диаграмме</em>;</li>
<li>папке - <em>месте хранения диаграммы</em>;</li>
<li>элементам архитектуры: <em>документам, системам, клиентам, коммуникациям, сущностям, действиям, прочим и кастомным типам элементов</em>;</li>
<li>ролям <em>- исполнителям задач процесса</em>;</li>
<li>статусу диаграммы: <em>новый, в работе, согласование, готов, архив</em>;</li>
<li>содержимому процесса - <em>поиск по слову в названии элементов диаграмм</em>;</li>
<li>автору диаграммы;</li>
<li>должностям, <em>исполняющим роли в процессе</em>;</li>
<li>сотрудникам -<em>по фамилии, имени отчеству человека, работающего в должности</em>;</li>
<li>качеству диаграммы - <em>оценке, проверке ошибок по правилам команды</em>;</li>
<li>поделился я - <em>диаграммы к которым я предоставил доступ другим людям</em>;</li>
<li>дате создания диаграммы;</li>
<li>дате обновления - <em>дате сохранения последней версии</em>;</li>
<li>автору обновления - <em>кто последний внёс изменения</em>;</li>
<li>типу диаграммы: BPMN <em>(процесс)</em>, BCM <em>(группа процессов)</em>;</li>
<li>поделились со мной - <em>диаграммы к которым мне дали доступ</em>.</li>
</ol>
<p><img src="@source/features_new_storm/0_home-page/table_filter.png" alt="image"></p>
<h3 id="настроика-колонок" tabindex="-1"><a class="header-anchor" href="#настроика-колонок"><span>- Настройка колонок</span></a></h3>
<p>Можно добавлять, удалять колонки, изменять их ширину</p>
<p><img src="@source/features_new_storm/0_home-page/table_columns.png" alt="image"></p>
<h3 id="опции-вкладки" tabindex="-1"><a class="header-anchor" href="#опции-вкладки"><span>- Опции вкладки:</span></a></h3>
<ol>
<li>режим отображения списка диаграмм: таблика или доска с карточками <em>(картинками)</em>;</li>
<li>перечень колонок таблицы;</li>
<li>настройка группировки диаграмм;</li>
<li>сортировка диаграмм;</li>
<li>предоставление команде ваших настроек вкладки</li>
</ol>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Включите &quot;Видят участники команды&quot; и ваши настройки вкладки попадают в шаблоны команды. Эти шаблоны доступны участнику команды при создании новой вкладки.</p>
</div>
<ol start="6">
<li>переименование вкладки;</li>
<li>дублирование вкладки;</li>
<li>скачивание списка процессов этой вкладки;</li>
<li>удаление вкладки;</li>
<li>сохранение настроек опций</li>
</ol>
<p><img src="@source/features_new_storm/0_home-page/table_options.png" alt="image"></p>
</div></template>


