<template><div><h1 id="_2-урок-понятие-бизнес-процесса-и-экзепляра-процесса" tabindex="-1"><a class="header-anchor" href="#_2-урок-понятие-бизнес-процесса-и-экзепляра-процесса"><span>2 урок:  Понятие бизнес-процесса и экзепляра процесса</span></a></h1>
<p>Понятие бизнес-процесса очень широкое, существует масса трактовок. Чтобы эту рассылку вы понимали правильно, вам нужно знать что под процессами понимает международное сообщество.</p>
<h2 id="официальное-определение-abpmp-org" tabindex="-1"><a class="header-anchor" href="#официальное-определение-abpmp-org"><span>Официальное определение (ABPMP.ORG)</span></a></h2>
<p>Существует общественная организация — The Association of Business Process Management Professionals. Она создана в 2003 году, в США.<br>
Задача организации — обобщать опыт экспертов в области процессов, проводить обучение, издавать книги и глоссарии.
Ассоциация не зависит от производителей софта или методологии и существует полностью на взносы членов, поэтому я ей доверяю.
Коллеги из ABPMP написали свод знаний по управлению процессами. В нём подробно описан термин “процесс”.</p>
<p><img src="@source/bpmn/2_lesson_1.png" alt="image"></p>
<h2 id="перевод-определения-на-русскии-язык-без-изменении-с-комментариями" tabindex="-1"><a class="header-anchor" href="#перевод-определения-на-русскии-язык-без-изменении-с-комментариями"><span>Перевод определения на русский язык без изменений с комментариями</span></a></h2>
<table>
<thead>
<tr>
<th></th>
<th></th>
<th></th>
</tr>
</thead>
<tbody>
<tr>
<td><strong>Официально</strong></td>
<td><strong>По-человечески</strong></td>
<td><strong>И в чём польза определения?</strong></td>
</tr>
<tr>
<td>Набор функций, выполняемых в определённой последовательности для создания потребительской ценности.</td>
<td>Последовательность работ.</td>
<td>Не процесс, если нет ценности для потребителей или последовательность не определена.</td>
</tr>
<tr>
<td>Процесс начинается с чётко определенных внешних событий.</td>
<td>Процесс начинается с внешних событий.</td>
<td>Процессы не начинаются случайно.</td>
</tr>
<tr>
<td>Процесс — сочетание всех действий, требуемых для достижения цели, получения результата, продукции или услуги, вне зависимости от того, где они выполняются.</td>
<td>Процесс включает всё необходимое для получения результата.</td>
<td>В процесс всегда должна включаться вся работа, чтобы достигнуть цели. Процесс не может окончиться безрезультатно.</td>
</tr>
<tr>
<td>Такое объединение действий, выполняемых совместно для создания продукции или услуги, обычно выходит за рамки функциональных границ и границ организации.</td>
<td>Обычно в процессе задействованы несколько отделов или организаций.</td>
<td>Если в вашем процессе один человек(или отдел, роль), то это повод всё перепроверить.</td>
</tr>
<tr>
<td>Действия, показанные в контексте их взаимосвязей, образуют последовательность или поток.</td>
<td>—</td>
<td>—</td>
</tr>
<tr>
<td>В таком контексте определяется набор действий, выполняемых людьми, системами или совместно теми и другими для достижения одной или нескольких целей</td>
<td>В процессе могут участвовать люди и программы.</td>
<td>На схемах процессов надо рисовать задачи для программ, если программы делают работу для результата процесса.</td>
</tr>
<tr>
<td>Процессы запускаются определёнными событиями и порождают определённый результат (или несколько результатов) в виде завершения процесса или передачи ответственности другому процессу</td>
<td>Результатом работы процесса является его завершение или запуск\изменение другого процесса.</td>
<td>Процессы должны иметь возможность завершаться. Процессы можно соединять с другими процессами.</td>
</tr>
<tr>
<td>Процессы состоят из набора взаимосвязанных задач или действий, нацеленных на решение конкретной проблемы</td>
<td>—</td>
<td>—</td>
</tr>
<tr>
<td>В контексте управления бизнес-процессами «бизнес-процесс» определяется, как сквозная работа, создающая потребительскую ценность</td>
<td>—</td>
<td>—</td>
</tr>
<tr>
<td>Понятие сквозной работы является принципиальным. В нём подразумевается вся работа, необходимая для создания потребительской ценности в полном объёме, невзирая на функциональные границы</td>
<td>В BPM “сквозная работа” является принципиальной. Процесс должен быть полезен потребителю, несмотря на то, кто делает работу для получения пользы.</td>
<td>“Сквозная” работа — это та, которая пришла из внешнего мира (“Хочу доставку воды!”, запрос клиента”) и в него же (“Вот вода, вот акты, подписывайте!”) пройдя через вашу организацию(Записи в CRM, отгрузки, оплаты). BPM — это о процессах, а не про служебки на ремонт мышки в ИТ-отдел.</td>
</tr>
</tbody>
</table>
<h2 id="что-такое-экземпляр-процесса" tabindex="-1"><a class="header-anchor" href="#что-такое-экземпляр-процесса"><span>Что такое экземпляр процесса</span></a></h2>
<p>Представьте, что у вас есть чертеж холодильника, который включает в себя 2 модели: с одной и двумя ручками. Чертеж будет называться бизнес-процессом, а конкретный холодильник (с одной или двумя ручками) — экземпляром процесса.</p>
<p><img src="@source/bpmn/2_lesson_2.png" alt="image"></p>
</div></template>


