<template><div><h1 id="_3-урок-3-уровня-моделирования-bpmn-схем" tabindex="-1"><a class="header-anchor" href="#_3-урок-3-уровня-моделирования-bpmn-схем"><span>3 урок:  3 уровня моделирования BPMN-схем</span></a></h1>
<p>Bpmn2 содержит ~480 элементов, которые не только описывают бизнес-процессы, но и могут использоваться для создания исполняемых программ в BPMS. При этом использование всей палитры может усложнить схему и сделать ее нечитаемой.</p>
<p>Авторы BPMN выделяют 3 уровня моделирования:</p>
<ul>
<li>
<p>Согласовательный (описательный);</p>
</li>
<li>
<p>Аналитический;</p>
</li>
<li>
<p>Исполняемый.</p>
</li>
</ul>
<p>Адаптация схемы под уровень моделирования и включение дополнительных деталей на каждом уровне помогут вам избежать проблем при согласовании и сэкономят много времени.</p>
<h2 id="согласовательныи-уровень" tabindex="-1"><a class="header-anchor" href="#согласовательныи-уровень"><span>Согласовательный уровень</span></a></h2>
<p>Это уровень для руководства, которое заинтересовано в улучшении процесса. Как правило, руководителям интересны:</p>
<ul>
<li>результат процесса;</li>
<li>основные задачи процесса;</li>
<li>исполнители процесса;</li>
<li>общение с внешними участниками процесса;</li>
<li>KPI процесса.</li>
<li>Если вы готовите такую схему, то учитывайте, что она должна быть понятна людям без опыта в BPMN.<br>
<img src="@source/bpmn/3_lesson_1.png" alt="image"></li>
</ul>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Для подобных схем рекомендую использовать только элементы: пул, дорожка, задача, подпроцесс, начальное событие, промежуточное событие, завершающее событие, база данных, сообщения (про элементы еще будут письма).</p>
</div>
<p>Схема должна показывать только один путь, приводящий процесс к ожидаемому результату.</p>
<p>В примере использованы подпроцессы (квадратики с плюсиками) и клиент, как внешняя, пустая сущность. Почему так сделано, вы узнаете из следующих писем, сейчас это не важно.</p>
<p><img src="@source/bpmn/3_lesson_2.png" alt="image"></p>
<div class="hint-container caution">
<p class="hint-container-title">Предупреждение</p>
<p>Вы могли заметить <strong>дорожки</strong>, горизонтальные прямоугольники с названием ролей. Мы не советуем их использовать в реальной деятельности, но они хорошо подходят для обучения.</p>
</div>
<h2 id="аналитическии-уровень" tabindex="-1"><a class="header-anchor" href="#аналитическии-уровень"><span>Аналитический уровень</span></a></h2>
<p>Это уровень для непосредственных участников процесса и аналитика. Схема такого уровня может быть ежедневной инструкцией.</p>
<p>Для аналитиков из такой схемы интересны:</p>
<ul>
<li>
<p>логичность процесса в целом;</p>
</li>
<li>
<p>разделение задач между системами и пользователями;</p>
</li>
<li>
<p>потенциальная возможность улучшения процесса за счёт оптимизации или автоматизации.<br>
Для исполнителей интересно:</p>
</li>
<li>
<p>что конкретно нужно делать.</p>
</li>
</ul>
<p><img src="@source/bpmn/3_lesson_3.png" alt="image"></p>
<p>В сравнении с согласовательной моделью здесь нужно:</p>
<ul>
<li>раскрыть подпроцессы до задач;</li>
<li>указать данные, которые важны для процесса;</li>
<li>указать альтернативные сценарии, если они есть.</li>
</ul>
<p>Такую схему нужно обязательно согласовать с экспертами в предметной области, т.к. в дальнейшем эти схемы становятся базой для исполняемых моделей.</p>
<p><img src="@source/bpmn/3_lesson_4.png" alt="image"></p>
<h2 id="исполняемыи-уровень" tabindex="-1"><a class="header-anchor" href="#исполняемыи-уровень"><span>Исполняемый уровень</span></a></h2>
<p>Модель этого уровня нужна для инженера BPMS. Она похожа на аналитическую модель, но должна быть дополнена следующей информацией (в том числе текстом):</p>
<ul>
<li>данные процесса;</li>
<li>группы и роли;</li>
<li>бизнес-правила;</li>
<li>пользовательский интерфейс;</li>
<li>KPI;</li>
<li>скрипты и сервисные задачи.</li>
</ul>
<p><img src="@source/bpmn/3_lesson_5.png" alt="image"></p>
<p>Про каждый из пунктов ещё будут письма в рассылке.</p>
<p><img src="@source/bpmn/3_lesson_6.png" alt="image"></p>
<h2 id="выводы" tabindex="-1"><a class="header-anchor" href="#выводы"><span>Выводы</span></a></h2>
<p>Заранее определяйтесь с потребителями вашей схемы и используйте соответствующий уровень моделирования.</p>
</div></template>


