<template><div><h1 id="_6-урок-bpmn-для-чаиников-пулы-и-дорожки-3-3" tabindex="-1"><a class="header-anchor" href="#_6-урок-bpmn-для-чаиников-пулы-и-дорожки-3-3"><span>6 урок: BPMN для &quot;чайников&quot;. Пулы и дорожки. (3/3)</span></a></h1>
<p>В этом письме заканчиваем тему базовых элементов. Я расскажу, как использовать дорожки и пулы правильно и избежать ошибок.</p>
<h2 id="пулы" tabindex="-1"><a class="header-anchor" href="#пулы"><span>Пулы</span></a></h2>
<p>Пулы отображают участников взаимодействия СНАРУЖИ процесса -  можно понимать организации, отделы, процессы — это зависит от вашей точки зрения на процесс. Как правило, если вы рисуете сквозной процесс, у вас будет один пул для вашей организации и прочие — для ваших клиентов, партнёров и так далее.<br>
<img src="@source/bpmn/6_lesson_1.png" alt="image"></p>
<h2 id="исполнители" tabindex="-1"><a class="header-anchor" href="#исполнители"><span>Исполнители</span></a></h2>
<p>Для того чтобы показать отдельное подразделение или роль, отвечающую за конкретный шаг, вы можете разделить пул дорожками.</p>
<p><img src="@source/bpmn/6_lesson_2.png" alt="image"></p>
<p>BPMN предполагает, что когда вы рисуете собственную организацию в процессе, вы имеете полный контроль над тем, как выполняется процесс.</p>
<h2 id="взаимодеиствие-исполнителеи-между-собои" tabindex="-1"><a class="header-anchor" href="#взаимодеиствие-исполнителеи-между-собои"><span>Взаимодействие исполнителей между собой</span></a></h2>
<p>Как помните, я показывал вам 3 типа линии.</p>
<p><img src="@source/bpmn/6_lesson_3.png" alt="image"></p>
<p>Линияиспользуется для соединения элементов процесса (события, задачи, подпроцессы, шлюзы) в пуле. Вы не можете начать или прервать эту линию в процессе просто так. Линии должны начинаться на стартовых событиях, а заканчиваться на завершающих событиях.</p>
<p>Линия НЕ может выходить за границу пула: это нарушит целостность процесса, и вы потеряете над ним контроль.</p>
<div class="hint-container caution">
<p class="hint-container-title">Предупреждение</p>
<p>Вы не можете рисовать задачи, события, шлюзы другим организациям. Только своей.</p>
</div>
<h2 id="взаимодеиствие-пулов-между-собои" tabindex="-1"><a class="header-anchor" href="#взаимодеиствие-пулов-между-собои"><span>Взаимодействие пулов между собой</span></a></h2>
<p>Для отображения деталей общения пулов, т.е. процессов или организаций, вы должны использовать поток сообщений.</p>
<p><img src="@source/bpmn/6_lesson_4.png" alt="image"></p>
<div class="hint-container caution">
<p class="hint-container-title">Предупреждение</p>
<p>Потоки сообщений допускаются только между пулами</p>
</div>
<h2 id="типичные-ошибки-и-способ-их-решения" tabindex="-1"><a class="header-anchor" href="#типичные-ошибки-и-способ-их-решения"><span>Типичные ошибки и способ их решения</span></a></h2>
<p><img src="@source/bpmn/6_lesson_5.png" alt="image"></p>
<p>Чтобы исправить эти ошибку нам нужно соединить два первых пула в один и разделить его дорожками, т.к. эти задачи выполняет одна организация.</p>
<p>А следом нам нужно добавить пул для отображения клиента, чтобы события получения и отправки оплаты выглядели как чёрный ящик: так называют пулы, когда реализация того, что находится внутри них, нашему процессу не интересна.</p>
<p>Нам всё равно, как клиент оплачивает заказы.</p>
<p><img src="@source/bpmn/6_lesson_6.png" alt="image"></p>
</div></template>


