<template><div><div class="hint-container caution">
<p class="hint-container-title">Предупреждение</p>
<p>Раздел в разработке</p>
</div>
<h1 id="обеспечение-информационнои-безопасности" tabindex="-1"><a class="header-anchor" href="#обеспечение-информационнои-безопасности"><span>Обеспечение информационной безопасности</span></a></h1>
<p>Мы серьезно относимся к обеспечению информационной безопасности при исопльзовании нашего решения. Помимо регулярного обновления зависимостей, сканирования приложения сканерами уязвимости и устранение найденных уязвимостей, мы предоставляем важные настройки, которые позволяют существенно органичить возможности системы для неавторизованных пользователей.</p>
<h2 id="возможные-настроики" tabindex="-1"><a class="header-anchor" href="#возможные-настроики"><span>Возможные настройки</span></a></h2>
<p>Настройки задаются с помощью ENV-переменных, переданных в контейнер:</p>
<ul>
<li>STORM_ALLOWED_ORIGINS - определяет источник запросов из браузера (CORS). Значение по-умолчанию - *.</li>
<li>STORM_DISABLE_SIMPLE_AUTH - запрещает авторизацию в системе по внутреннему механизму. Значение по-умолчанию - false.</li>
<li>STORM_DISABLE_ENV_IN_UI - запрещает просмотр ENV-переменных в интерфейсе администратора системы. Значение по-умолчанию - false.</li>
<li>STORM_DISABLE_ANON_SHARING - запрещает возможность поделиться диаграммой для анонимных пользователей. Значение по-умолчанию - false.</li>
</ul>
<h3 id="регистрация-и-авторизация" tabindex="-1"><a class="header-anchor" href="#регистрация-и-авторизация"><span>Регистрация и авторизация</span></a></h3>
<p>Переменные в административной панели:</p>
<ul>
<li>showRegistraton - отображать или нет возможность регистрации в системы. По-умолчанию - true.</li>
<li>showBasicLogin - отображать поля для входа с логином и паролем. По-умолчанию - true.</li>
<li>showCustomLoginButtonName - отображать уникальный текст на кнопке входа. По-умолчанию - false.</li>
<li>CustomLoginButtonName- текст на кнопке входа. По-умолчанию -&quot;Войти&quot;.</li>
<li>showCustomSSOLoginButtonName - отображать кнопку входа через Keycloak. По умолчанию - false.</li>
<li>customSSOLoginButtonName - текст на кнопке  входа через Keycloak. По умолчанию - &quot;Войти&quot;</li>
<li>showSSOLogin - отображать кнопку входа keycloak. По умолчанию - нет.</li>
</ul>
<h2 id="авторизация" tabindex="-1"><a class="header-anchor" href="#авторизация"><span>Авторизация</span></a></h2>
<p>Поддерживается 3 типа авторизации - keycloak, oauth2, ldap.</p>
<h4 id="настроика-keycloak" tabindex="-1"><a class="header-anchor" href="#настроика-keycloak"><span>Настройка keycloak</span></a></h4>
<p>Осуществляется путем задания ENV-переменных:</p>
<ul>
<li>KEYCLOAK_ENABLED - включение интеграции. Значение по-умолчанию - false.</li>
<li>KEYCLOAK_URL - URL авторизационного сервера. Используется для формирования ссылки для endpoint-а userInfo.</li>
<li>KEYCLOAK_REALM - название REALMa. Используется для формирования ссылки для endpoint-а userInfo.</li>
<li>KEYCLOAK_FRONT_REALM - используется для отдачи на фронт и правильного формирования кнопки.</li>
<li>KEYCLOAK_FRONT_CLIENT_ID - используется для отдачи на фронт и правильного формирования кнопки.</li>
<li>KEYCLOAK_FRONT_URL - используется для отдачи на фронт и правильного формирования кнопки.</li>
</ul>
<h2 id="а-так-в-панели-администратора-системы-путем-установки-значении" tabindex="-1"><a class="header-anchor" href="#а-так-в-панели-администратора-системы-путем-установки-значении"><span>А так в панели администратора системы, путем установки значений:</span></a></h2>
<h3 id="запрет-анонимных-деиствии" tabindex="-1"><a class="header-anchor" href="#запрет-анонимных-деиствии"><span>Запрет анонимных действий</span></a></h3>
<h3 id="siem-логирование" tabindex="-1"><a class="header-anchor" href="#siem-логирование"><span>SIEM-логирование</span></a></h3>
<p>Мы маскируем авторизационные заголовки и пароли, их невозможно найти в логах.</p>
<h4 id="принцип-работы" tabindex="-1"><a class="header-anchor" href="#принцип-работы"><span>Принцип работы</span></a></h4>
<h4 id="настроика-syslog" tabindex="-1"><a class="header-anchor" href="#настроика-syslog"><span>Настройка Syslog</span></a></h4>
</div></template>


