<template><div><h1 id="new-шторм-редактор-диаграмм-bpmn" tabindex="-1"><a class="header-anchor" href="#new-шторм-редактор-диаграмм-bpmn"><span>New Шторм. Редактор диаграмм BPMN</span></a></h1>
<p>Наш редактор BPMN имеет несколько меню для удобства работы с BPMN диаграммами.<br>
<img src="@source/новый_шторм_features_new_storm/bpmn-modeler.png" alt="image"></p>
<h2 id="описание-всех-меню" tabindex="-1"><a class="header-anchor" href="#описание-всех-меню"><span>Описание всех меню</span></a></h2>
<h3 id="меню-навигации" tabindex="-1"><a class="header-anchor" href="#меню-навигации"><span>Меню навигации</span></a></h3>
<div class="hint-container caution">
<p class="hint-container-title">ОПИСАТЬ</p>
</div>
<h3 id="меню-деиствии" tabindex="-1"><a class="header-anchor" href="#меню-деиствии"><span>Меню действий</span></a></h3>
<p>В этом меню возможно:</p>
<ul>
<li>
<ol>
<li>Вернуться на главную страницу (Мои процессы);</li>
</ol>
</li>
<li>
<p>Увидеть:</p>
<ol start="2">
<li>название диаграммы;</li>
<li>название папки в которой хранится диаграмма;</li>
<li>кто сохранил эту версию диаграммы;</li>
<li>дату и время версии;</li>
<li>сравнительный вид диаграммы: As Is или To Be</li>
<li>статус диаграммы (новая, в работе, на согласовании, готова, архив);</li>
</ol>
</li>
<li>
<p>Выполнить действия:</p>
<ol start="7">
<li>вызвать меню сохранения;</li>
<li>вызвать меню выгрузки: в регламент (docx) или графический файл (png, svg, pdf);</li>
<li>вызвать меню предоставления доступа другому пользователю Шторма или любому человеку</li>
<li>скрыть диаграмму от всех</li>
<li>удалить диаграмму</li>
<li>изменить статус</li>
</ol>
</li>
</ul>
<p><img src="@source/новый_шторм_features_new_storm/action-menu.png" alt="image"></p>
<h4 id="сохранение-диаграммы" tabindex="-1"><a class="header-anchor" href="#сохранение-диаграммы"><span>Сохранение диаграммы</span></a></h4>
<p>В этом меню вы можете:</p>
<ol>
<li>Указать название диаграммы</li>
<li>Добавить <a href="#%D1%82%D0%B5%D0%B3%D0%B8">теги</a></li>
<li>Указать <a href="#%D0%BF%D0%B0%D0%BF%D0%BA%D0%B8">папку</a></li>
<li>Указать сравнительный вид диаграммы (AS-IS / TO-BE) и связать со вторым процессом для <a href="#%D1%81%D1%80%D0%B0%D0%B2%D0%BD%D0%B5%D0%BD%D0%B8%D0%B5-as-is-%D0%B8-to-be">сравнения</a></li>
<li>Оставить комментарий к текущей версии</li>
<li>Увидеть [качество] вашей диаграммы</li>
</ol>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>При сохранении создаётся <a href="#%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D0%BE%D0%BD%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">версия</a>, к которой можно откатиться или выполнить сравнение</p>
</div>
<p>В этом же меню можно сохранить <strong>чужую диаграмму</strong>, к которой вы не имеете доступа на редактирование, в свои диаграммы.</p>
<p><img src="@source/новый_шторм_features_new_storm/save-menu.png" alt="image"></p>
<h4 id="скачать-экспорт-svg-png-pdf-bpmn-и-docx" tabindex="-1"><a class="header-anchor" href="#скачать-экспорт-svg-png-pdf-bpmn-и-docx"><span>Скачать (экспорт SVG, PNG, PDF, BPMN и .DOCX)</span></a></h4>
<p>В меню Скачать процесс есть 2 вкладки:<br>
А. <em><strong>Файлы</strong></em><br>
Б. <em><strong>Регламенты</strong></em></p>
<p>На вкладке <em><strong>Файлы</strong></em> можно скачать диаграмму</p>
<ul>
<li>как картинку (SVG, PNG);</li>
<li>машиночитаемый файл XML (BPMN);</li>
<li>как документ с оверлеями (PDF).</li>
</ul>
<p><img src="@source/новый_шторм_features_new_storm/download(picture).png" alt="image"></p>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Для сохранения картинки с <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%BE%D0%B2%D0%B5%D1%80%D0%BB%D0%B5%D0%B5%D0%B2">оверлеями</a> используйте скачивание в PDF</p>
</div>
<p>На вкладке <em><strong>Регламенты</strong></em> доступно:</p>
<ol>
<li>загрузка своего шаблона регламента;</li>
<li>выбрать шаблон из списка загруженных;</li>
<li>выгрузить в шаги процесса только задачи (убрать события, развилки и другие объекты диаграммы процесса)</li>
<li>скачать регламент процесса по базовому шаблону;</li>
<li>скачать регламент по своему выбранному шаблону</li>
</ol>
<p><img src="@source/новый_шторм_features_new_storm/download(reglament).png" alt="image"></p>
<h4 id="поделиться-диаграммои" tabindex="-1"><a class="header-anchor" href="#поделиться-диаграммои"><span>Поделиться диаграммой</span></a></h4>
<p><img src="@source/новый_шторм_features_new_storm/share-diagram.png" alt="image"></p>
<p>В этом меню можно предоставить/отозвать доступ на диаграмму:</p>
<ol>
<li>Конкретному человеку по e-mail с указанием прав (просматривать/редактировать)</li>
<li>Анонимно (не требует учетной записи в системе)</li>
<li>Получить код для встраивания диаграммы, она будет выглядеть вот так:</li>
</ol>
<iframe src="https://new.stormbpmn.com/app/diagram/ed955b21-8019-48ed-abc4-3fa7b0f491d5?embedded=true" style="border:1px #f2f2f2 none;" name="extAdmin" scrolling="yes" frameborder="1"  height="400" width="100%" allowfullscreen></iframe>
<p>Больше о <RouteLink to="/team-work/">совместной работе</RouteLink></p>
<h4 id="сменить-статус" tabindex="-1"><a class="header-anchor" href="#сменить-статус"><span>Сменить статус</span></a></h4>
<p>Для информирования коллег о состоянии работы над процессом можно использовать статусы:</p>
<ul>
<li>
<p><strong>Новый</strong> - процесс ещё не трогали, просто создали</p>
</li>
<li>
<p><strong>В работе</strong> - над процессом активно идёт работа</p>
</li>
<li>
<p><strong>На согласовании</strong> - процесс согласуется с кем-то, менять схему <strong>нельзя</strong>. Подробнее в <a href="#%D1%81%D0%BE%D0%B3%D0%BB%D0%B0%D1%81%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">согласованиях</a></p>
</li>
<li>
<p><strong>Готов</strong> - процесс готов к работе, менять схему нельзя</p>
</li>
<li>
<p><strong>Архив</strong> - процесс в архиве</p>
<p><img src="@source/новый_шторм_features_new_storm/change-status.png" alt="image"></p>
</li>
</ul>
<h4 id="as-is-и-to-be" tabindex="-1"><a class="header-anchor" href="#as-is-и-to-be"><span>AS-IS и TO-BE</span></a></h4>
<p>Если в <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D1%81%D0%BE%D1%85%D1%80%D0%B0%D0%BD%D0%B5%D0%BD%D0%B8%D1%8F">меню сохранения</a> вы указали тип процесса и связанный процесс, то появится возможность быстро перемещаться между версиями AS-IS и TO-BE, нажав на кнопку верхнего меню с типом диаграммы</p>
<p><img src="@source/новый_шторм_features_new_storm/as-is-to-be.png" alt="image"></p>
<div class="hint-container caution">
<p class="hint-container-title">Ещё в разработке</p>
<p>А также визуально <a href="#%D1%81%D1%80%D0%B0%D0%B2%D0%BD%D0%B5%D0%BD%D0%B8%D0%B5-as-is-%D0%B8-to-be">сравнить их</a>.</p>
</div>
<h3 id="левое-меню" tabindex="-1"><a class="header-anchor" href="#левое-меню"><span>Левое меню</span></a></h3>
<p>Левое меню предназначено для выбора элементов BPMN, управления ими и обеспечения удобства использования редактора.</p>
<div class="hint-container warning">
<p class="hint-container-title">Не все элементы</p>
<p>В левом меню находятся не все разновидности элементов BPMN, но это не значит, что их нет в системе 😃 Выбор типа (маркера) элемента производится в контекстном меню нажатием на кнопку .</p>
</div>
<p>Советуем обратить внимание на кнопки, обеспечивающие удобство работы:</p>
<p><img src="@source/новый_шторм_features_new_storm/left-menu.gif" alt="image"></p>
<p>Для понимания того, в какие элементы можно превратить значки, нужно разбираться в <RouteLink to="/bpmn/">BPMN</RouteLink>, т.к. сервис старается защитить вас от ошибок и не дать использовать элементы, которые невозможны по нотации.</p>
<h3 id="верхнее-меню" tabindex="-1"><a class="header-anchor" href="#верхнее-меню"><span>Верхнее меню</span></a></h3>
<p>Верхнее меню предназначено для работы с конкретной диаграммой и предоставляет возможности:</p>
<ol>
<li>Включить симулятор токена.</li>
<li>Развернуть диаграмму на полный экран.</li>
<li>включить, отключить миникарту</li>
<li>Приблизить.</li>
<li>Отдалить.</li>
<li>Отменить последнее действие.</li>
<li>Вернуть отмененное действие.</li>
<li>Сменить цвет выбранным элементам.</li>
<li>Скопировать выделенные элементы для вставки между вкладками.</li>
<li>Вставить выделенные элементы из другой вкладки.</li>
<li>Включить <a href="#%D0%BE%D1%86%D0%B5%D0%BD%D0%BA%D0%B0-%D0%BA%D0%B0%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%B0">проверку ошибок</a>.</li>
<li>Выполнить автонумерацию элементов.</li>
<li>Очистить автонумерацию.</li>
<li>Открыть справку по верхнему меню, горячим клавишам и элементам <a href="https://new.stormbpmn.com/bpmn/elements" target="_blank" rel="noopener noreferrer">BPMN<ExternalLinkIcon/></a> с примерами.</li>
<li>Скрыть шапку: меню действий и меню навигации.</li>
<li>Раскрыть <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%BE%D0%B2%D0%B5%D1%80%D0%BB%D0%B5%D0%B5%D0%B2">меню оверлеев</a>.</li>
</ol>
<p><img src="@source/новый_шторм_features_new_storm/up-menu-3.png" alt="image"></p>
<h3 id="контекстное-меню" tabindex="-1"><a class="header-anchor" href="#контекстное-меню"><span>Контекстное меню</span></a></h3>
<p>Контекстное меню открывается при клике на элемент и предоставляет следующие возможности в зависимости от того, на какой элемент вы кликнули:</p>
<ol>
<li>Выбрать и нарисовать следующий элемент.</li>
<li>Открытие меню для управления <a href="#%D1%80%D0%BE%D0%BB%D0%B8">ролями</a> и <a href="#%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">элементами архитектуры</a>.</li>
<li>Удаление элемента.</li>
<li>Текстовая аннотация к элементу.</li>
<li>Изменение атрибутов текущего элемента.</li>
<li>Соеденение текущего элементв с другим.</li>
<li>Открытие меню <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%B4%D0%BE%D0%BF%D0%BE%D0%BB%D0%BD%D0%B8%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D1%8B%D1%85-%D0%BD%D0%B0%D1%81%D1%82%D1%80%D0%BE%D0%B5%D0%BA-%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D0%B0">дополнительных настроек элемента</a>.</li>
</ol>
<p><img src="@source/новый_шторм_features_new_storm/context-menu-1.png" alt="image"></p>
<h3 id="меню-дополнительных-настроек-элемента" tabindex="-1"><a class="header-anchor" href="#меню-дополнительных-настроек-элемента"><span>Меню дополнительных настроек элемента</span></a></h3>
<p>В этом меню предоставляется возможность указывать всю ключевую информацию об элементе:</p>
<ol>
<li>Название</li>
<li><a href="#%D1%80%D0%BE%D0%BB%D0%B8">Роль</a> (<em>только для задач</em>)<br>
<em>(назначить роль на задачу, удалить связь роли с задачей, создать новую роль)</em></li>
<li><a href="#%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">Элементы архитектуры</a> (<em>только для задач</em>)<br>
<em>(связать элемент архитектуры с задачей, создать новый, удалить связь с задачей)</em></li>
</ol>
<p><img src="@source/новый_шторм_features_new_storm/supplemental-menu-1.png" alt="image"></p>
<div class="hint-container caution">
<p class="hint-container-title">Ещё в разработке</p>
<ol start="4">
<li><a href="#%D1%81%D0%B2%D1%8F%D0%B7%D1%8C-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%BE%D0%B2">Связанный процесс</a> (<em>только для Call Activity или Participant</em>)</li>
<li><a href="#%D1%81%D0%B2%D1%8F%D0%B7%D1%8C-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%BE%D0%B2">Создание события отправки сообщения</a>  (<em>только для Throw Event</em>)
или <a href="#%D1%81%D0%B2%D1%8F%D0%B7%D1%8C-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%BE%D0%B2">Связывание события получения сообщения с его отправкой</a>   (<em>только для Catch Event</em>)</li>
</ol>
</div>
<ol start="6">
<li>Описание элемента</li>
<li><a href="#%D1%80%D0%B0%D1%81%D1%87%D0%B5%D1%82-%D0%B4%D0%BB%D0%B8%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%D1%81%D1%82%D0%B8-%D1%81%D1%86%D0%B5%D0%BD%D0%B0%D1%80%D0%B8%D0%B5%D0%B9">Плановую длительность</a></li>
<li>Внешняя ссылка</li>
</ol>
<p><img src="@source/новый_шторм_features_new_storm/supplemental-menu-2.png" alt="image"></p>
<h3 id="меню-оверлеев" tabindex="-1"><a class="header-anchor" href="#меню-оверлеев"><span>Меню оверлеев</span></a></h3>
<p>Одним из ключевых удобств системы является возможность быстро и удобно включать и выключать отображение информации на диаграмме.
Меню оверлеев предоставляет возможность:</p>
<ol>
<li>включить отображение</li>
</ol>
<ul>
<li><a href="#%D1%80%D0%BE%D0%BB%D0%B8">Ролей</a></li>
<li>Должностей (<em>первой должности в <a href="#%D1%80%D0%B5%D0%B4%D0%B0%D0%BA%D1%82%D0%BE%D1%80-%D0%BE%D1%80%D0%B3%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%82%D1%83%D1%80%D1%8B">оргструктуре</a>, назначенной на роль</em> )</li>
<li>Систем (один из типов <a href="#%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">элементов архитектуры</a>)</li>
<li>Документов (один из типов <a href="#%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">элементов архитектуры</a>)</li>
</ul>
<ol start="2">
<li>развернуть список оверлеев Системы; Документы (<em>по умолчанию они свёрнуты в оверлей-группу, показывающий их наличие</em>)</li>
<li>отобразить значки, обозначающих, что у элемента есть</li>
</ol>
<ul>
<li>Описание</li>
<li><a href="#%D0%BA%D0%BE%D0%BC%D0%BC%D0%B5%D0%BD%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">Комментарии</a></li>
</ul>
<ol start="4">
<li>показать длительность</li>
<li>отобразить значки наличия у элементов:</li>
</ol>
<ul>
<li><a href="#%D1%81%D0%B2%D1%8F%D0%B7%D0%B8-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%B0">Связи</a> (исходящие)</li>
<li><a href="#%D0%B2%D1%85%D0%BE%D0%B4%D1%8F%D1%89%D0%B8%D0%B5-%D1%81%D0%B2%D1%8F%D0%B7%D0%B8-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%B0">Связи</a> (входящие)</li>
</ul>
<ol start="6">
<li>включить отображение оверлеев кастомных <a href="#%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">элементов архитектуры</a></li>
<li>развернуть список оверлеев всех кастомных ЭА</li>
<li>использовать горячие клавиши для отображения оверлеев и разворачивания их списков</li>
</ol>
<p><img src="@source/новый_шторм_features_new_storm/overlays-menu-1.png" alt="image"></p>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Включенные оверлеи автоматически вставляются в ссылку, которой вы делитесь с коллегами! Заказчикам ничего дополнительного нажимать не надо.
А еще, если вы включали оверлеи в настройках пользователя (Профиль -&gt; настройки) то на диаграммах вашего авторства они будут отображаться автоматически, даже ссылку делать не надо будет.</p>
</div>
<div class="hint-container caution">
<p class="hint-container-title">Ещё в разработке</p>
<h3 id="меню-представлении" tabindex="-1"><a class="header-anchor" href="#меню-представлении"><span>Меню представлений</span></a></h3>
<p>Описание процесса в системе можно посмотреть сразу в нескольких представлениях, в зависимости от ваших задач.</p>
<ul>
<li><strong>В виде схемы BPMN</strong> - подходит для анализа последовательности процесса</li>
<li><strong>В виде таблицы</strong> - подходит для уточнения задач, исполнителей, используемых систем и документов</li>
<li><strong>В виде регламента</strong> - подходит для последовательного изучения всей информации о процессе</li>
</ul>
<h4 id="табличное-представление" tabindex="-1"><a class="header-anchor" href="#табличное-представление"><span>Табличное представление</span></a></h4>
<p>Табличное представление выводит информацию о:</p>
<ul>
<li>Названии задачи</li>
<li>Пуле, в котором расположена задача</li>
<li>Роль, исполняющая задачу</li>
<li>Должности, привязанные к роли</li>
<li>Системы, используемые в задаче</li>
<li>Документы, используемые в задаче</li>
<li>Описание задачи</li>
</ul>
<p>Также это представление даёт возможность скачать таблицу в .xls и осуществить поиск по содержимому. Например, если написать <strong>кладовщик</strong>, то система выдаст только те задачи, где упоминается это слово в любом из столбцов.<br>
<img src="@source/новый_шторм_features_new_storm/table-view-1.png" alt="image"></p>
<h4 id="представление-в-виде-регламента" tabindex="-1"><a class="header-anchor" href="#представление-в-виде-регламента"><span>Представление в виде регламента</span></a></h4>
<p>Это представление позволяет просмотреть на процесс последовательно, со всех сторон и предоставляет возможности:</p>
<ol>
<li>Просмотреть и ввести общее описание.
<img src="@source/новый_шторм_features_new_storm/reglament-view-1.png" alt="image"></li>
<li>Указать состав рабочей группы: владельцев, спонсоров и т.д.</li>
<li>Посмотреть на схему.</li>
<li>Посмотреть и отредактировать описание задач в разрезе ролей
<img src="@source/новый_шторм_features_new_storm/reglament-view-2.png" alt="image"></li>
<li>Историю согласований.</li>
<li>Связь процессов, потребителей и поставщиков процесса.</li>
<li>Используемые элементы архитектуры.</li>
<li>Карту архитектуры относительно процесса.</li>
<li>Все комментарии процесса.</li>
</ol>
</div>
<h3 id="правое-меню" tabindex="-1"><a class="header-anchor" href="#правое-меню"><span>Правое меню</span></a></h3>
<p>Правое меню даёт дополнительные возможности работы с диаграммой в зависимости от выбранного заголовка:</p>
<ol>
<li>отобразить <a href="#%D1%80%D0%BE%D0%BB%D0%B8">роли</a> и все <a href="#%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">элементов архитектуры</a> для каждого элемента диаграммы;</li>
<li>показать <a href="#%D0%BA%D0%BE%D0%BC%D0%BC%D0%B5%D0%BD%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">комментарии</a> к диаграмме и отдельным её элементам;</li>
</ol>
<div class="hint-container caution">
<p class="hint-container-title">Ещё в разработке</p>
<ol start="3">
<li>сравнить текущую <a href="#%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D0%BE%D0%BD%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">версию</a> диаграммы с предыдущими</li>
<li>отобразить <a href="#%D1%81%D0%B2%D1%8F%D0%B7%D0%B8-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%B0">связи</a> диаграммы с другими и её элементов</li>
<li>вывести панель упраления Camunda</li>
</ol>
</div>
<p><img src="@source/новый_шторм_features_new_storm/right-menu-1.png" alt="image"></p>
<p>Цвет активной вкладки тёмный.
И в правом меню отображается соответствующая информация</p>
<p><img src="@source/новый_шторм_features_new_storm/right-menu-2.png" alt="image"></p>
<div class="hint-container caution">
<p class="hint-container-title">Кнопка в отпуске</p>
<h3 id="детали-по-клику" tabindex="-1"><a class="header-anchor" href="#детали-по-клику"><span>Детали по клику</span></a></h3>
<p>После включения соответствующей настройки в правом меню появляется возможность:</p>
<ul>
<li>Поделиться ссылкой на конкретный элемент</li>
<li>Найти выбранный элемент на схеме</li>
<li>Установить <a href="#%D1%81%D0%B2%D1%8F%D0%B7%D1%8C-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%BE%D0%B2">связь</a> с Call Activity</li>
<li>Установить роль</li>
<li>Установить элементы архитектуры</li>
<li>Прочитать описание выбранной задачи</li>
<li>Просмотреть и написать комментарий к выбранной задаче</li>
</ul>
<p><img src="@source/новый_шторм_features_new_storm/click-details.png" alt="image"></p>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>В этом представлении отображается схема выбранного Call Activity! Это удобный способ просматривать их содержимое с той же диаграммы, на которой оно используется.</p>
</div>
</div>
<p>:::</p>
<h2 id="обеспечение-удобства-работы" tabindex="-1"><a class="header-anchor" href="#обеспечение-удобства-работы"><span>Обеспечение удобства работы</span></a></h2>
<h3 id="горячие-клавиши" tabindex="-1"><a class="header-anchor" href="#горячие-клавиши"><span>Горячие клавиши</span></a></h3>
<p>Редактор поддерживает работу с горячими клавишами, что сильно ускоряет работу при моделировании процессов:</p>
<ul>
<li><strong>F2</strong> - изменить название выбранного элемента</li>
<li><strong>F3</strong> или <strong>ctrl + f</strong> - открыть меню поиска элементов</li>
<li><strong>F5</strong> или <strong>ctrl + F5</strong> - обновить страницу браузера</li>
<li><strong>F11</strong> - перейти в полноэкранный режим</li>
<li><strong>ctrl + z</strong> - отменить последнее действие</li>
<li><strong>ctrl +shift + z</strong> или <strong>ctrl + y</strong> - вернуть отмененное действие</li>
<li><strong>ctrl + a</strong> - выделить всё</li>
<li><strong>ctrl + scroll</strong> - изменение масштаба</li>
<li><strong>scroll</strong> - перемещение по вертикали</li>
<li><strong>shift + scroll</strong> - перемещение по горизонтали</li>
<li><strong>ctrl + click</strong> - выделять элементы по одному в группу</li>
<li><strong>shift + click</strong> - выбрать элементы группой</li>
<li><strong>alt + 1...8</strong> - включить отображение соответствующих оверлеев</li>
<li><strong>alt + shift + 3, 4</strong> - изменить свёрнутость списка оверлеев Системы, Документы</li>
<li><strong>alt + a</strong> - включить отображение всех оверлеев</li>
<li><strong>alt + sift + a</strong> - изменить свёрнутость списка всех оверлеев</li>
</ul>
<h2 id="качество-бизнес-процессов-bpmn" tabindex="-1"><a class="header-anchor" href="#качество-бизнес-процессов-bpmn"><span>Качество бизнес-процессов BPMN</span></a></h2>
<p>Система предоставляет мощные средства для управления качеством ваших диаграмм в BPMN, создаваемых по вашему соглашению о моделировании. \ 
Качественные диаграммы гарантируют минимальное время на обсуждение формальных признаков описания и позволяют сразу переходить к сути.</p>
<h3 id="оценка" tabindex="-1"><a class="header-anchor" href="#оценка"><span>Оценка</span></a></h3>
<p>Система предоставляет ~30 правил проверки BPMN, которые система проверяет автоматически при каждом сохранении.  <br>
<strong>Включение</strong>, отключение проверки осуществляется кнопкой в <a href="#%D0%B2%D0%B5%D1%80%D1%85%D0%BD%D0%B5%D0%B5-%D0%BC%D0%B5%D0%BD%D1%8E">верхнем меню</a>.</p>
<p>Выявленные ошибки бывают трех типов:</p>
<ol>
<li><strong>Рекомендация</strong> (<em>стикер синего цвета</em>) - рекомендуем моделировать лучше</li>
<li><strong>Предупреждение</strong> (<em>желтого цвета</em>)- лучше исправить</li>
<li><strong>Фатальная ошибка</strong> (<em>красного цвета</em>) - серьёзное нарушение BPMN, обязательно исправить.</li>
</ol>
<p><img src="@source/новый_шторм_features_new_storm/error-check-1.png" alt="image"></p>
<h4 id="ошибки-для-camunda" tabindex="-1"><a class="header-anchor" href="#ошибки-для-camunda"><span>Ошибки для Camunda</span></a></h4>
<p>Это функция позволяет проверить атрибуты автоматизации Camunda 7, задаваемые в процессе, и сразу найти те ошибки, на которые Camunda 7 укажет вам при попытке загрузить ваш XML на сервер.</p>
<h4 id="настроика-правил-проверки" tabindex="-1"><a class="header-anchor" href="#настроика-правил-проверки"><span>Настройка правил проверки</span></a></h4>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Данная функция работает только на тарифе TEAM и выше.</p>
</div>
<p>Вы так же можете настроить трактовку каждого из правил уникальным образом для своей команды, а также:</p>
<ul>
<li>Настроить минимальную среднюю оценку, которую требует ваша команда. При нарушении этого показателя члены команды постоянно будут видеть уведомление о низком качестве процессов.</li>
<li>Указать минимальный процент указания (задействования) систем, ролей, документов на схеме.</li>
<li>Включить или отключить; изменить заголовок, описание, важность, дополнительную ссылку для каждого из правил.<br>
<img src="@source/новый_шторм_features_new_storm/error-check-2.png" alt="image"></li>
</ul>
<p>Настраивается в разделе <RouteLink to="/team-work/#%D0%BF%D1%80%D0%BE%D1%87%D0%B8%D0%B5-%D0%BD%D0%B0%D1%81%D1%82%D1%80%D0%BE%D0%B8%D0%BA%D0%B8-%D0%BA%D0%BE%D0%BC%D0%B0%D0%BD%D0%B4%D1%8B">команды</RouteLink>.</p>
<h3 id="симуляция-токена" tabindex="-1"><a class="header-anchor" href="#симуляция-токена"><span>Симуляция токена</span></a></h3>
<p>Вы так же можете выполнить проверку проходимости процесса <strong>токеном</strong>. Посмотрите это видео, если не знаете, что это такое:</p>
<iframe width="560" height="315" src="https://www.youtube.com/embed/Gfx5atU3YDY?si=ARC0B7o3i9K1DCey" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
<p>Для включения симуляции токена:</p>
<ol>
<li>нажмите кнопку включения симуляции токена</li>
<li>приблизьтесь к любому стартовому событию и нажмите на символ Play для запуска токена</li>
<li>используйте переключатель на шлюзах, чтобы вести токена по выбранному направлению:<br>
<img src="@source/новый_шторм_features_new_storm/token-simulation.png" alt="image"></li>
</ol>
<div class="hint-container caution">
<p class="hint-container-title">В разработке</p>
<h3 id="расчет-длительности-сценария" tabindex="-1"><a class="header-anchor" href="#расчет-длительности-сценария"><span>Расчет длительности сценария</span></a></h3>
<p>Если вы указывали <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%B4%D0%BE%D0%BF%D0%BE%D0%BB%D0%BD%D0%B8%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D1%8B%D1%85-%D0%BD%D0%B0%D1%81%D1%82%D1%80%D0%BE%D0%B5%D0%BA-%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D0%B0">длительность в задачах</a>, то система может посчитать время, за которое выполнится конкретный проход токена при симуляции токена, указав самые длительные операции:
<img src="@source/новый_шторм_features_new_storm/error-check-4.png" alt="image"></p>
</div>
<div class="hint-container caution">
<p class="hint-container-title">В разработке</p>
<h2 id="версионирование" tabindex="-1"><a class="header-anchor" href="#версионирование"><span>Версионирование</span></a></h2>
<p>Система автоматически создает версии диаграмм вот по таким поводам:</p>
<ul>
<li>Прошло больше 30 изменений диаграммы</li>
<li>Кто-то (не владелец процесса и не пред.автор изменения) внёс изменения в диаграмму</li>
</ul>
<p>Это позволяет <strong>всегда</strong> восстановить пред.версию и посмотреть разницу. Автор диаграммы получает e-mail уведомление, если в его диаграмме создали новую версию.
Также система сохраняет версии описания задач.</p>
<h3 id="как-вернуть-версию-процесса" tabindex="-1"><a class="header-anchor" href="#как-вернуть-версию-процесса"><span>Как вернуть версию процесса</span></a></h3>
<ol>
<li>Если вы хотите вернуть версию процесса, то найдите на главной странице карточку процесса и нажмите в верхний правый угол, выберите &quot;Все версии&quot;:
<img src="@source/новый_шторм_features_new_storm/restore-versions-1.png" alt="image"></li>
<li>Выберете интересующую версию и нажмите <strong>посмотреть версию</strong>.</li>
<li>В открывшемся окне нажмите <strong>&quot;установить как текущую&quot;</strong>.</li>
</ol>
<h3 id="сравнение-версии" tabindex="-1"><a class="header-anchor" href="#сравнение-версии"><span>Сравнение версий</span></a></h3>
<p>Сравнение версий доступно в двух вариантах:</p>
<ol>
<li><strong>Вычисление изменений текущей версии относительно старой</strong> - включается через <a href="#%D0%BF%D1%80%D0%B0%D0%B2%D0%BE%D0%B5-%D0%BC%D0%B5%D0%BD%D1%8E">правое меню</a>:
<img src="@source/новый_шторм_features_new_storm/version-compare-1.png" alt="image"></li>
<li><strong>Просто сравнение со старой версией</strong> - включается через меню и нажатие кнопки <strong>сравнить</strong>:
<img src="@source/новый_шторм_features_new_storm/restore-versions-1.png" alt="image"></li>
</ol>
</div>
<h2 id="согласование" tabindex="-1"><a class="header-anchor" href="#согласование"><span>Согласование</span></a></h2>
<p>Система позволяет <strong>согласовывать процессы</strong> с любыми пользователями системы - т.е. получить и зафиксировать мнение человека о вашем процессе.</p>
<div class="hint-container important">
<p class="hint-container-title">Важно</p>
<p>Согласующему необязательно быть участником команды, вы можете отправить согласование на любой e-mail - человек получит соответствующее уведомление. <strong>Согласования бесплатны.</strong></p>
</div>
<h3 id="просмотр-согласовании" tabindex="-1"><a class="header-anchor" href="#просмотр-согласовании"><span>Просмотр согласований</span></a></h3>
<p>Для просмотра согласований на главной странице есть соответствующий раздел:<br>
<img src="@source/новый_шторм_features_new_storm/appruval-4.png" alt="imaget"></p>
<h3 id="отправка-на-согласование" tabindex="-1"><a class="header-anchor" href="#отправка-на-согласование"><span>Отправка на согласование</span></a></h3>
<p>Для отправки процесса на согласование</p>
<ol>
<li>смените ему статус на <strong>на согласовании</strong> ;</li>
<li>укажите e-mail согласующих (<em>в конце ввода е-мейла нажмите клавишу Enter</em>);</li>
<li>нажмите <strong>отправить на согласование</strong></li>
<li>сохраните изменение статуса</li>
</ol>
<div class="hint-container warning">
<p class="hint-container-title">Примечание</p>
<p>Если дополнительно отправляете ещё кому-то схему уже находящуюся в статусе  схема уже в статусе <strong>на согласовании</strong>, то пункты 1 и 4 можно не выполнять</p>
</div>
<p><img src="@source/новый_шторм_features_new_storm/appruval-1.png" alt="imaget"></p>
<div class="hint-container warning">
<p class="hint-container-title">Внимание</p>
<p>После отправки схемы на согласование диаграмму нельзя будет редактировать или менять её статус, пока не будут получены результаты по ВСЕМ отправленным запросам на согласование.</p>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Советуем снабдить ваше первое согласование вот <a href="https://www.youtube.com/watch?v=tKGegGh15oc&amp;ab_channel=BPMN2ru" target="_blank" rel="noopener noreferrer">такой ссылкой<ExternalLinkIcon/></a>, людям будет сильно проще разобраться в системе и они быстрее нажмут все кнопки для согласования.</p>
<iframe width="560" height="315" src="https://www.youtube.com/embed/tKGegGh15oc?si=pam4af5M82dYhPKw" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>
</div>
</div>
<h3 id="выполнение-согласования" tabindex="-1"><a class="header-anchor" href="#выполнение-согласования"><span>Выполнение согласования</span></a></h3>
<p>После получения ссылки и авторизации в системе, согласующий увидит такое меню и сможет поделиться своим мнением:</p>
<p><img src="@source/новый_шторм_features_new_storm/appruval-2.png" alt="imaget"></p>
<p>Во вкладке <strong>комментарии</strong> согласующий сможет оставить комментарии. Для оставления комментария к конкретному элементу достаточно на него нажать.</p>
<p><img src="@source/новый_шторм_features_new_storm/appruval-3.png" alt="imaget"></p>
<div class="hint-container warning">
<p class="hint-container-title">Примечание</p>
<p>По-умолчанию отображаются согласования только по последней версии. Нажмите &quot;Посмотреть историю&quot;, если хотите посмотреть предыдущие согласования.</p>
</div>
<h3 id="удаление-согласования" tabindex="-1"><a class="header-anchor" href="#удаление-согласования"><span>Удаление согласования</span></a></h3>
<p>Если согласование перестало быть актуальным, то автор согласования может удалить запрошенное согласование, пока по нему ещЁ не высказались. Для этого нажмите на <strong>мусорную корзину</strong> в левом нижем углу.</p>
<h2 id="импорт-процессов-из-других-систем" tabindex="-1"><a class="header-anchor" href="#импорт-процессов-из-других-систем"><span>Импорт процессов из других систем</span></a></h2>
<p>Система поддерживает полноценный BPMN - это значит, что если система-источник производит XML-файл в спецификации BPMN, то Stormbpmn сможет его загрузить.</p>
<p>Загрузить можно диаграммы из <mark>Cawemo, Camunda Modeler, Bizagi Modeler</mark> и так далее.</p>
<p>Загрузить диаграммы из <mark>Visio, Draw.io, Miro</mark> <strong>нельзя</strong>.</p>
<p>Для загрузки нажмите кнопку в меню навигации:<br>
<img src="@source/новый_шторм_features_new_storm/bpmn-import-1.png" alt="imaget"></p>
<p>Для импорта в конкретную папку нажмите кнопку в меню папки:<br>
<img src="@source/новый_шторм_features_new_storm/bpmn-import-2.png" alt="imaget"></p>
<div class="hint-container caution">
<p class="hint-container-title">В разработке</p>
<h2 id="сравнение-as-is-и-to-be" tabindex="-1"><a class="header-anchor" href="#сравнение-as-is-и-to-be"><span>Сравнение AS-IS и TO-BE</span></a></h2>
<p>Одна из удобных возможностей - это визуально сравнить 2 диаграммы, для того чтобы представить визуальную разницу между версиями AS-IS и TO-BE.</p>
<p><img src="@source/новый_шторм_features_new_storm/as-is-to-be-1.png" alt="imaget"></p>
</div>
<h3 id="установление-связи-между-двумя-моделями" tabindex="-1"><a class="header-anchor" href="#установление-связи-между-двумя-моделями"><span>Установление связи между двумя моделями</span></a></h3>
<p>Для установления связи в <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D1%81%D0%BE%D1%85%D1%80%D0%B0%D0%BD%D0%B5%D0%BD%D0%B8%D1%8F">меню сохранения</a> установить тип процесса и связанный процесс:<br>
<img src="@source/новый_шторм_features_new_storm/as-is-to-be-2.png" alt="imaget"></p>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Советуем для начала хорошенько проработать модель AS-IS, тогда её можно будет дублировать и на базе дубля сделать TO-BE. Также это сделает возможным автоматическое сравнение схем (когда оно будет готово).</p>
</div>
<div class="hint-container caution">
<p class="hint-container-title">В разработке</p>
<h2 id="связь-процессов" tabindex="-1"><a class="header-anchor" href="#связь-процессов"><span>Связь процессов</span></a></h2>
<p>Бизнес-процессы редко работают в одиночку. В целях декомпозиции и управляемости их часто разделяют на разные процессы, которые даже могут описываться разными людьми, департаментами, компаниями.</p>
<p>Система поддерживает возможность связи процессов друг с другом с целью удобной навигации и построения графов связности.</p>
<p>Просматривать связи можно через <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%BE%D0%B2%D0%B5%D1%80%D0%BB%D0%B5%D0%B5%D0%B2">меню оверлеев</a> или <a href="#%D0%BF%D1%80%D0%B0%D0%B2%D0%BE%D0%B5-%D0%BC%D0%B5%D0%BD%D1%8E">правое меню</a>.</p>
<h3 id="связь-через-call-activity-и-participant" tabindex="-1"><a class="header-anchor" href="#связь-через-call-activity-и-participant"><span>Связь через Call activity и Participant</span></a></h3>
<p>Для установления связи через Call activity\Participant откройте <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%BF%D0%BE%D0%B4%D1%80%D0%BE%D0%B1%D0%BD%D0%BE%D1%81%D1%82%D0%B5%D0%B9-%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D0%B0">меню подробностей</a> и укажите соответствующий связанный бизнес-процесс:<br>
<img src="@source/новый_шторм_features_new_storm/links-1.png" alt="imaget"></p>
<h3 id="связь-через-message-catch-events-message-catch-task" tabindex="-1"><a class="header-anchor" href="#связь-через-message-catch-events-message-catch-task"><span>Связь через Message Catch Events \ Message Catch Task</span></a></h3>
<p>Для установления такой связи откройте <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%BF%D0%BE%D0%B4%D1%80%D0%BE%D0%B1%D0%BD%D0%BE%D1%81%D1%82%D0%B5%D0%B9-%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D0%B0">меню подробностей</a> и укажите соответствующий связанный элемент отправки сообщения:<br>
<img src="@source/новый_шторм_features_new_storm/links-2.png" alt="imaget"></p>
</div>
<h3 id="декомпозиция-через-subprocess" tabindex="-1"><a class="header-anchor" href="#декомпозиция-через-subprocess"><span>Декомпозиция через Subprocess</span></a></h3>
<p>Еще один вариант декомпозиции - использование Subprocess. В этом случае вы получаете возможность на одном листе проваливаться в подпроцессы.</p>
<h4 id="как-использовать-subprocess" tabindex="-1"><a class="header-anchor" href="#как-использовать-subprocess"><span>Как использовать Subprocess</span></a></h4>
<ol>
<li>
<p>Установите с помощью контексного меню тип активности &quot;Свернутый подпроцесс&quot;:
<img src="@source/новый_шторм_features_new_storm/links-3.png" alt="imaget"></p>
</li>
<li>
<p>Нажмите на значок перехода к схеме декомпозии подпроцесса:<br>
<img src="@source/новый_шторм_features_new_storm/links-4.png" alt="imaget"></p>
</li>
<li>
<p>Вернитесь на уровень выше при необходимости:<br>
<img src="@source/новый_шторм_features_new_storm/links-5.png" alt="imaget"></p>
</li>
</ol>
<div class="hint-container warning">
<p class="hint-container-title">Примечание</p>
<p>По нотации BPMN Свернутый подпроцесс (subrocess) является непосредственной частью текущей схемы, поэтому переиспользовать его в других диаграммах (или даже в этой 2 раза) нельзя. Это не ярлык, а средство декомпозии. Такие связи не будут участвовать в графе связности.</p>
</div>
</div></template>


