<template><div><h1 id="new-шторм-папки-и-теги" tabindex="-1"><a class="header-anchor" href="#new-шторм-папки-и-теги"><span>New Шторм. Папки и теги</span></a></h1>
<p>Папки и тэги - предназначены для организации хранения диаграмм бизнес-процессов и их структурирования по общему признаку.
Таким признаком может быть принадлежность к направлению деятельности, продукту, функции, подразделению компании, владельцу процесса и т.п.
Что является таким признаком Вы определяете сами, исходя из своих целей.
Папки и тэги помогают группировать связанные диаграммы процессов под &quot;общим флагом&quot;. Это облегчает их поиск, управление ими.
И особенно полезно при работе с большим количеством схем и сложной связанностью между ними.</p>
<div class="hint-container warning">
<p class="hint-container-title">Примечание</p>
<p>Папки  - это часть платной подписки TEAM или Enterprise. Без подписки их использование невозможно.</p>
</div>
<div class="hint-container caution">
<p class="hint-container-title">Предупреждение</p>
<p>Готовим описание по новой версии шторма</p>
</div>
</div></template>


