<template><div><h1 id="new-шторм-комментарии" tabindex="-1"><a class="header-anchor" href="#new-шторм-комментарии"><span>New Шторм. Комментарии</span></a></h1>
<p>Комментарии - это отличный способ для экономии вашего времени и обсуждения процессов, как в рабочем режиме, так и в режиме согласования. Время экономится за счет того, что не нужно собирать бесконечные встречи, люди делятся своим мнением асинхронно, по возможности.</p>
<div class="hint-container caution">
<p class="hint-container-title">Предупреждение</p>
<p>Готовим описание по новой версии шторма</p>
</div>
</div></template>


