export const searchIndex = [
  {
    "title": "С чего начать",
    "headers": [
      {
        "level": 2,
        "title": "Какие задачи решает Stormbpmn",
        "slug": "какие-задачи-решает-stormbpmn",
        "link": "#какие-задачи-решает-stormbpmn",
        "children": []
      },
      {
        "level": 2,
        "title": "Ваш первый процесс от идеи до заказчика за 5 минут",
        "slug": "ваш-первыи-процесс-от-идеи-до-заказчика-за-5-минут",
        "link": "#ваш-первыи-процесс-от-идеи-до-заказчика-за-5-минут",
        "children": []
      }
    ],
    "path": "/get-started.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Главная страница",
    "headers": [],
    "path": "/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "API",
    "headers": [],
    "path": "/api/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Что такое BPMN",
    "headers": [],
    "path": "/bpmn/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Примеры процессов в BPMN",
    "headers": [
      {
        "level": 2,
        "title": "1 пример",
        "slug": "_1-пример",
        "link": "#_1-пример",
        "children": []
      }
    ],
    "path": "/examples/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Описание функций",
    "headers": [
      {
        "level": 2,
        "title": "Редактор BPMN",
        "slug": "редактор-bpmn",
        "link": "#редактор-bpmn",
        "children": [
          {
            "level": 3,
            "title": "Оверлеи",
            "slug": "оверлеи",
            "link": "#оверлеи",
            "children": []
          },
          {
            "level": 3,
            "title": "Элементы архитектуры",
            "slug": "элементы-архитектуры",
            "link": "#элементы-архитектуры",
            "children": []
          },
          {
            "level": 3,
            "title": "3 типа представлений",
            "slug": "_3-типа-представлении",
            "link": "#_3-типа-представлении",
            "children": []
          },
          {
            "level": 3,
            "title": "Обеспечение удобства работы",
            "slug": "обеспечение-удобства-работы",
            "link": "#обеспечение-удобства-работы",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "Описание задач",
        "slug": "описание-задач",
        "link": "#описание-задач",
        "children": []
      },
      {
        "level": 2,
        "title": "Оргструктура",
        "slug": "оргструктура",
        "link": "#оргструктура",
        "children": [
          {
            "level": 3,
            "title": "Загрузка из CSV",
            "slug": "загрузка-из-csv",
            "link": "#загрузка-из-csv",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "Группы процессов",
        "slug": "группы-процессов",
        "link": "#группы-процессов",
        "children": []
      },
      {
        "level": 2,
        "title": "Регламенты",
        "slug": "регламенты",
        "link": "#регламенты",
        "children": []
      },
      {
        "level": 2,
        "title": "Версионирование",
        "slug": "версионирование",
        "link": "#версионирование",
        "children": []
      },
      {
        "level": 2,
        "title": "Комментирование",
        "slug": "комментирование",
        "link": "#комментирование",
        "children": []
      },
      {
        "level": 2,
        "title": "Графы",
        "slug": "графы",
        "link": "#графы",
        "children": []
      },
      {
        "level": 2,
        "title": "Согласование",
        "slug": "согласование",
        "link": "#согласование",
        "children": []
      },
      {
        "level": 2,
        "title": "Импорт процессов",
        "slug": "импорт-процессов",
        "link": "#импорт-процессов",
        "children": []
      },
      {
        "level": 2,
        "title": "Экспорт процессов",
        "slug": "экспорт-процессов",
        "link": "#экспорт-процессов",
        "children": []
      },
      {
        "level": 2,
        "title": "Поиск процессов",
        "slug": "поиск-процессов",
        "link": "#поиск-процессов",
        "children": []
      },
      {
        "level": 2,
        "title": "Элементы архитектуры",
        "slug": "элементы-архитектуры-1",
        "link": "#элементы-архитектуры-1",
        "children": [
          {
            "level": 3,
            "title": "Загрузка из CSV",
            "slug": "загрузка-из-csv-1",
            "link": "#загрузка-из-csv-1",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "Связь процессов",
        "slug": "связь-процессов",
        "link": "#связь-процессов",
        "children": []
      },
      {
        "level": 2,
        "title": "Сравнение AS-IS и TO-BE",
        "slug": "сравнение-as-is-и-to-be",
        "link": "#сравнение-as-is-и-to-be",
        "children": []
      }
    ],
    "path": "/features/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "h1 Heading 😎",
    "headers": [
      {
        "level": 2,
        "title": "h2 Heading",
        "slug": "h2-heading",
        "link": "#h2-heading",
        "children": [
          {
            "level": 3,
            "title": "h3 Heading",
            "slug": "h3-heading",
            "link": "#h3-heading",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "Horizontal Rules",
        "slug": "horizontal-rules",
        "link": "#horizontal-rules",
        "children": []
      },
      {
        "level": 2,
        "title": "Typographic replacements",
        "slug": "typographic-replacements",
        "link": "#typographic-replacements",
        "children": []
      },
      {
        "level": 2,
        "title": "Emphasis",
        "slug": "emphasis",
        "link": "#emphasis",
        "children": []
      },
      {
        "level": 2,
        "title": "Blockquotes",
        "slug": "blockquotes",
        "link": "#blockquotes",
        "children": []
      },
      {
        "level": 2,
        "title": "Lists",
        "slug": "lists",
        "link": "#lists",
        "children": []
      },
      {
        "level": 2,
        "title": "Code",
        "slug": "code",
        "link": "#code",
        "children": []
      },
      {
        "level": 2,
        "title": "Tables",
        "slug": "tables",
        "link": "#tables",
        "children": []
      },
      {
        "level": 2,
        "title": "Links",
        "slug": "links",
        "link": "#links",
        "children": []
      },
      {
        "level": 2,
        "title": "Images",
        "slug": "images",
        "link": "#images",
        "children": []
      },
      {
        "level": 2,
        "title": "Plugins",
        "slug": "plugins",
        "link": "#plugins",
        "children": [
          {
            "level": 3,
            "title": "Emojies",
            "slug": "emojies",
            "link": "#emojies",
            "children": []
          },
          {
            "level": 3,
            "title": "Subscript / Superscript",
            "slug": "subscript-superscript",
            "link": "#subscript-superscript",
            "children": []
          },
          {
            "level": 3,
            "title": "<ins>",
            "slug": "ins",
            "link": "#ins",
            "children": []
          },
          {
            "level": 3,
            "title": "<mark>",
            "slug": "mark",
            "link": "#mark",
            "children": []
          },
          {
            "level": 3,
            "title": "Footnotes",
            "slug": "footnotes",
            "link": "#footnotes",
            "children": []
          },
          {
            "level": 3,
            "title": "Definition lists",
            "slug": "definition-lists",
            "link": "#definition-lists",
            "children": []
          },
          {
            "level": 3,
            "title": "Abbreviations",
            "slug": "abbreviations",
            "link": "#abbreviations",
            "children": []
          },
          {
            "level": 3,
            "title": "Custom containers",
            "slug": "custom-containers",
            "link": "#custom-containers",
            "children": []
          }
        ]
      }
    ],
    "path": "/guide/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Enterprise-версия",
    "headers": [
      {
        "level": 2,
        "title": "Архитектура",
        "slug": "архитектура",
        "link": "#архитектура",
        "children": []
      },
      {
        "level": 2,
        "title": "Инструкция по установке",
        "slug": "инструкция-по-установке",
        "link": "#инструкция-по-установке",
        "children": []
      },
      {
        "level": 2,
        "title": "Админинистративный интерфейс",
        "slug": "админинистративныи-интерфеис",
        "link": "#админинистративныи-интерфеис",
        "children": []
      }
    ],
    "path": "/enterprise/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Как ... ?",
    "headers": [],
    "path": "/how-to/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "В реальной жизни",
    "headers": [
      {
        "level": 2,
        "title": "Создать ТЗ на разработку процесса",
        "slug": "создать-тз-на-разработку-процесса",
        "link": "#создать-тз-на-разработку-процесса",
        "children": []
      },
      {
        "level": 2,
        "title": "Подговиться к операционному росту и адаптации новых сотрудников",
        "slug": "подговиться-к-операционному-росту-и-адаптации-новых-сотрудников",
        "link": "#подговиться-к-операционному-росту-и-адаптации-новых-сотрудников",
        "children": []
      },
      {
        "level": 2,
        "title": "Нарисовать BPMN и проверить корректность",
        "slug": "нарисовать-bpmn-и-проверить-корректность",
        "link": "#нарисовать-bpmn-и-проверить-корректность",
        "children": []
      },
      {
        "level": 2,
        "title": "Обсудить с коллегами процесс",
        "slug": "обсудить-с-коллегами-процесс",
        "link": "#обсудить-с-коллегами-процесс",
        "children": []
      },
      {
        "level": 2,
        "title": "Согласовать процесс с заказчиком",
        "slug": "согласовать-процесс-с-заказчиком",
        "link": "#согласовать-процесс-с-заказчиком",
        "children": []
      },
      {
        "level": 2,
        "title": "Спроектировать изменения процесса AS-IS и TO-BE",
        "slug": "спроектировать-изменения-процесса-as-is-и-to-be",
        "link": "#спроектировать-изменения-процесса-as-is-и-to-be",
        "children": []
      },
      {
        "level": 2,
        "title": "Выдать сотруднику описание того, как работать",
        "slug": "выдать-сотруднику-описание-того-как-работать",
        "link": "#выдать-сотруднику-описание-того-как-работать",
        "children": []
      },
      {
        "level": 2,
        "title": "Найти все места, где используется информационная система",
        "slug": "наити-все-места-где-используется-информационная-система",
        "link": "#наити-все-места-где-используется-информационная-система",
        "children": []
      },
      {
        "level": 2,
        "title": "Максимально подробно подготовить описание процесса AS-IS",
        "slug": "максимально-подробно-подготовить-описание-процесса-as-is",
        "link": "#максимально-подробно-подготовить-описание-процесса-as-is",
        "children": []
      },
      {
        "level": 2,
        "title": "Загрузить процессы из Camunda\\Bizagi и показать кому-то, у кого их нет",
        "slug": "загрузить-процессы-из-camunda-bizagi-и-показать-кому-то-у-кого-их-нет",
        "link": "#загрузить-процессы-из-camunda-bizagi-и-показать-кому-то-у-кого-их-нет",
        "children": []
      },
      {
        "level": 2,
        "title": "Найти функциональные разрывы в процессах",
        "slug": "наити-функциональные-разрывы-в-процессах",
        "link": "#наити-функциональные-разрывы-в-процессах",
        "children": []
      },
      {
        "level": 2,
        "title": "Расчет длительности процесса",
        "slug": "расчет-длительности-процесса",
        "link": "#расчет-длительности-процесса",
        "children": []
      },
      {
        "level": 2,
        "title": "Обеспечить качество работы команды",
        "slug": "обеспечить-качество-работы-команды",
        "link": "#обеспечить-качество-работы-команды",
        "children": []
      }
    ],
    "path": "/real-life-scenarios/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Совместная работа",
    "headers": [
      {
        "level": 2,
        "title": "Управление командой",
        "slug": "управление-командои",
        "link": "#управление-командои",
        "children": [
          {
            "level": 3,
            "title": "Cоздание команды",
            "slug": "cоздание-команды",
            "link": "#cоздание-команды",
            "children": []
          },
          {
            "level": 3,
            "title": "Приглашение в команду",
            "slug": "приглашение-в-команду",
            "link": "#приглашение-в-команду",
            "children": []
          },
          {
            "level": 3,
            "title": "Управление правами",
            "slug": "управление-правами",
            "link": "#управление-правами",
            "children": []
          },
          {
            "level": 3,
            "title": "Обеспечение качества работы команды",
            "slug": "обеспечение-качества-работы-команды",
            "link": "#обеспечение-качества-работы-команды",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "Поделиться процессом",
        "slug": "поделиться-процессом",
        "link": "#поделиться-процессом",
        "children": []
      },
      {
        "level": 2,
        "title": "Встроить процесс",
        "slug": "встроить-процесс",
        "link": "#встроить-процесс",
        "children": []
      },
      {
        "level": 2,
        "title": "Поделиться папкой",
        "slug": "поделиться-папкои",
        "link": "#поделиться-папкои",
        "children": []
      }
    ],
    "path": "/team-work/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Полезные ссылки",
    "headers": [],
    "path": "/usefull-link/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "",
    "headers": [],
    "path": "/404.html",
    "pathLocale": "/",
    "extraFields": []
  }
]

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updateSearchIndex) {
    __VUE_HMR_RUNTIME__.updateSearchIndex(searchIndex)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ searchIndex }) => {
    __VUE_HMR_RUNTIME__.updateSearchIndex(searchIndex)
  })
}
