export const searchIndex = [
  {
    "title": "С чего начать",
    "headers": [
      {
        "level": 2,
        "title": "Какие задачи решает Stormbpmn",
        "slug": "какие-задачи-решает-stormbpmn",
        "link": "#какие-задачи-решает-stormbpmn",
        "children": []
      },
      {
        "level": 2,
        "title": "Ваш первый процесс от идеи до заказчика за 5 минут",
        "slug": "ваш-первыи-процесс-от-идеи-до-заказчика-за-5-минут",
        "link": "#ваш-первыи-процесс-от-идеи-до-заказчика-за-5-минут",
        "children": []
      }
    ],
    "path": "/get-started.html",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Главная страница",
    "headers": [],
    "path": "/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Что такое BPMN",
    "headers": [],
    "path": "/bpmn/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Примеры процессов в BPMN",
    "headers": [
      {
        "level": 2,
        "title": "1 пример",
        "slug": "_1-пример",
        "link": "#_1-пример",
        "children": []
      }
    ],
    "path": "/examples/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Enterprise-версия",
    "headers": [
      {
        "level": 2,
        "title": "Архитектура",
        "slug": "архитектура",
        "link": "#архитектура",
        "children": []
      },
      {
        "level": 2,
        "title": "Админинистративный интерфейс",
        "slug": "админинистративныи-интерфеис",
        "link": "#админинистративныи-интерфеис",
        "children": [
          {
            "level": 3,
            "title": "Управление пользователями",
            "slug": "управление-пользователями",
            "link": "#управление-пользователями",
            "children": []
          },
          {
            "level": 3,
            "title": "Управление командами",
            "slug": "управление-командами",
            "link": "#управление-командами",
            "children": []
          },
          {
            "level": 3,
            "title": "Лицензия",
            "slug": "лицензия",
            "link": "#лицензия",
            "children": []
          },
          {
            "level": 3,
            "title": "Переменные окружения",
            "slug": "переменные-окружения",
            "link": "#переменные-окружения",
            "children": []
          },
          {
            "level": 3,
            "title": "Настройка приложения",
            "slug": "настроика-приложения",
            "link": "#настроика-приложения",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "Инструкция по установке",
        "slug": "инструкция-по-установке",
        "link": "#инструкция-по-установке",
        "children": []
      },
      {
        "level": 2,
        "title": "Инструкция по обновлению",
        "slug": "инструкция-по-обновлению",
        "link": "#инструкция-по-обновлению",
        "children": []
      }
    ],
    "path": "/enterprise/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "API",
    "headers": [
      {
        "level": 2,
        "title": "Авторизация",
        "slug": "авторизация",
        "link": "#авторизация",
        "children": []
      }
    ],
    "path": "/api/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Описание функций",
    "headers": [
      {
        "level": 2,
        "title": "Домашняя страница",
        "slug": "домашняя-страница",
        "link": "#домашняя-страница",
        "children": []
      },
      {
        "level": 2,
        "title": "Бизнес-процессы в BPMN",
        "slug": "бизнес-процессы-в-bpmn",
        "link": "#бизнес-процессы-в-bpmn",
        "children": [
          {
            "level": 3,
            "title": "Описание всех меню",
            "slug": "описание-всех-меню",
            "link": "#описание-всех-меню",
            "children": []
          },
          {
            "level": 3,
            "title": "Качество бизнес-процессов BPMN",
            "slug": "качество-бизнес-процессов-bpmn",
            "link": "#качество-бизнес-процессов-bpmn",
            "children": []
          },
          {
            "level": 3,
            "title": "Версионирование",
            "slug": "версионирование",
            "link": "#версионирование",
            "children": []
          },
          {
            "level": 3,
            "title": "Согласование",
            "slug": "согласование",
            "link": "#согласование",
            "children": []
          },
          {
            "level": 3,
            "title": "Импорт и экспорт процессов в BPMN",
            "slug": "импорт-и-экспорт-процессов-в-bpmn",
            "link": "#импорт-и-экспорт-процессов-в-bpmn",
            "children": []
          },
          {
            "level": 3,
            "title": "Связь процессов",
            "slug": "связь-процессов",
            "link": "#связь-процессов",
            "children": []
          },
          {
            "level": 3,
            "title": "Сравнение AS-IS и TO-BE",
            "slug": "сравнение-as-is-и-to-be",
            "link": "#сравнение-as-is-и-to-be",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "Редактор групп процессов",
        "slug": "редактор-групп-процессов",
        "link": "#редактор-групп-процессов",
        "children": []
      },
      {
        "level": 2,
        "title": "Редактор оргструктуры",
        "slug": "редактор-оргструктуры",
        "link": "#редактор-оргструктуры",
        "children": []
      },
      {
        "level": 2,
        "title": "Регламенты",
        "slug": "регламенты",
        "link": "#регламенты",
        "children": []
      },
      {
        "level": 2,
        "title": "Комментирование",
        "slug": "комментирование",
        "link": "#комментирование",
        "children": []
      },
      {
        "level": 2,
        "title": "Графы",
        "slug": "графы",
        "link": "#графы",
        "children": []
      },
      {
        "level": 2,
        "title": "Элементы архитектуры",
        "slug": "элементы-архитектуры-1",
        "link": "#элементы-архитектуры-1",
        "children": [
          {
            "level": 3,
            "title": "Загрузка из CSV",
            "slug": "загрузка-из-csv",
            "link": "#загрузка-из-csv",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "Поиск",
        "slug": "поиск",
        "link": "#поиск",
        "children": []
      },
      {
        "level": 2,
        "title": "Теги",
        "slug": "теги",
        "link": "#теги",
        "children": []
      },
      {
        "level": 2,
        "title": "Папки",
        "slug": "папки",
        "link": "#папки",
        "children": []
      },
      {
        "level": 2,
        "title": "Роли",
        "slug": "роли",
        "link": "#роли",
        "children": [
          {
            "level": 3,
            "title": "Создание ролей",
            "slug": "создание-ролеи",
            "link": "#создание-ролеи",
            "children": []
          },
          {
            "level": 3,
            "title": "Редактирование ролей",
            "slug": "редактирование-ролеи",
            "link": "#редактирование-ролеи",
            "children": []
          },
          {
            "level": 3,
            "title": "Удаление ролей",
            "slug": "удаление-ролеи",
            "link": "#удаление-ролеи",
            "children": []
          }
        ]
      }
    ],
    "path": "/features/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Как ... ?",
    "headers": [],
    "path": "/how-to/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "В реальной жизни",
    "headers": [
      {
        "level": 2,
        "title": "Создать ТЗ на разработку процесса",
        "slug": "создать-тз-на-разработку-процесса",
        "link": "#создать-тз-на-разработку-процесса",
        "children": []
      },
      {
        "level": 2,
        "title": "Подговиться к операционному росту и адаптации новых сотрудников",
        "slug": "подговиться-к-операционному-росту-и-адаптации-новых-сотрудников",
        "link": "#подговиться-к-операционному-росту-и-адаптации-новых-сотрудников",
        "children": []
      },
      {
        "level": 2,
        "title": "Согласовать процесс с заказчиком",
        "slug": "согласовать-процесс-с-заказчиком",
        "link": "#согласовать-процесс-с-заказчиком",
        "children": []
      },
      {
        "level": 2,
        "title": "Спроектировать изменения процесса AS-IS и TO-BE",
        "slug": "спроектировать-изменения-процесса-as-is-и-to-be",
        "link": "#спроектировать-изменения-процесса-as-is-и-to-be",
        "children": []
      },
      {
        "level": 2,
        "title": "Создать реестр процессов компании",
        "slug": "создать-реестр-процессов-компании",
        "link": "#создать-реестр-процессов-компании",
        "children": []
      }
    ],
    "path": "/real-life-scenarios/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Полезные ссылки",
    "headers": [],
    "path": "/usefull-link/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "Совместная работа",
    "headers": [
      {
        "level": 2,
        "title": "4 типа совместной работы",
        "slug": "_4-типа-совместнои-работы",
        "link": "#_4-типа-совместнои-работы",
        "children": [
          {
            "level": 3,
            "title": "На уровне процесса - поделиться конкретным процессом",
            "slug": "на-уровне-процесса-поделиться-конкретным-процессом",
            "link": "#на-уровне-процесса-поделиться-конкретным-процессом",
            "children": []
          },
          {
            "level": 3,
            "title": "На уровне папки",
            "slug": "на-уровне-папки",
            "link": "#на-уровне-папки",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "Управление командой",
        "slug": "управление-командои",
        "link": "#управление-командои",
        "children": [
          {
            "level": 3,
            "title": "Cоздание команды",
            "slug": "cоздание-команды",
            "link": "#cоздание-команды",
            "children": []
          },
          {
            "level": 3,
            "title": "Приглашение в команду",
            "slug": "приглашение-в-команду",
            "link": "#приглашение-в-команду",
            "children": []
          },
          {
            "level": 3,
            "title": "Управление правами",
            "slug": "управление-правами",
            "link": "#управление-правами",
            "children": []
          },
          {
            "level": 3,
            "title": "Прочие настройки команды",
            "slug": "прочие-настроики-команды",
            "link": "#прочие-настроики-команды",
            "children": []
          },
          {
            "level": 3,
            "title": "Выход из команды",
            "slug": "выход-из-команды",
            "link": "#выход-из-команды",
            "children": []
          },
          {
            "level": 3,
            "title": "Удаление команды",
            "slug": "удаление-команды",
            "link": "#удаление-команды",
            "children": []
          }
        ]
      },
      {
        "level": 2,
        "title": "Поделиться процессом",
        "slug": "поделиться-процессом",
        "link": "#поделиться-процессом",
        "children": []
      },
      {
        "level": 2,
        "title": "Встроить процесс",
        "slug": "встроить-процесс",
        "link": "#встроить-процесс",
        "children": []
      },
      {
        "level": 2,
        "title": "Поделиться папкой",
        "slug": "поделиться-папкои",
        "link": "#поделиться-папкои",
        "children": []
      }
    ],
    "path": "/team-work/",
    "pathLocale": "/",
    "extraFields": []
  },
  {
    "title": "",
    "headers": [],
    "path": "/404.html",
    "pathLocale": "/",
    "extraFields": []
  }
]

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updateSearchIndex) {
    __VUE_HMR_RUNTIME__.updateSearchIndex(searchIndex)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ searchIndex }) => {
    __VUE_HMR_RUNTIME__.updateSearchIndex(searchIndex)
  })
}
