<template><div><h1 id="совместная-работа" tabindex="-1"><a class="header-anchor" href="#совместная-работа"><span>Совместная работа</span></a></h1>
<div class="custom-container danger"><p class="custom-container-title">DANGER</p>
<p>Раздел в разработке. Одновременная работа с одной диаграммой из нескольких вкладок или браузеров пока не поддерживается.</p>
</div>
<p>Совместная работа в система в работе предназначена для того, чтобы экономить ваше время за счет:</p>
<ul>
<li>Все видят одни и теже процессы</li>
<li>Все процессы в актуальном состоянии</li>
<li>Не надо пересылать файлы и ссылки</li>
<li>Все изменения версионируются и можно откатиться к пред. версиям, если кто-то что-то сломал</li>
<li>Можно посмотреть, чем текущая версия отличается от предидущей.</li>
</ul>
<h2 id="_4-типа-совместнои-работы" tabindex="-1"><a class="header-anchor" href="#_4-типа-совместнои-работы"><span>4 типа совместной работы</span></a></h2>
<p>В системе существует несколько способов поделиться своей работой с коллегами - на уровне процесса, на уровне папки, на уровне команды и на уровне предприятия.</p>
<p>Чем ближе выданы права к диаграмме, тем они сильнее. Т.е. права на уровне процесса сильнее прав на уровне папки. А на уровне папки - сильнее чем на уровне команды.</p>
<h3 id="на-уровне-процесса-поделиться-конкретным-процессом" tabindex="-1"><a class="header-anchor" href="#на-уровне-процесса-поделиться-конкретным-процессом"><span>На уровне процесса - поделиться конкретным процессом</span></a></h3>
<p>Вы можете поделиться конкретной диаграммой с конкретными пользователями. Это хорошо работает, когда вам нужно просто поделиться одной диаграммой.
<img src="@source/team-work/share-diagram-1.png" alt="image"></p>
<div class="custom-container tip"><p class="custom-container-title">TIP</p>
<p>Используйте этот способ, если хотите поделиться процессом не заставляя регистрироваться в системе. Включите галочку анонимный доступ.</p>
</div>
<p>На этом экране можно настраивать:</p>
<ul>
<li>Отображение <RouteLink to="/features/#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%BE%D0%B2%D0%B5%D1%80%D0%BB%D0%B5%D0%B5%D0%B2">оверлеев</RouteLink>  по ссылке</li>
<li>Просматривать, редактировать или удалять права конкретных пользователей на диаграмму</li>
<li>Предоставлять анонимный доступ</li>
<li>Предоставлять доступ к диаграмме для организации (только ENTERPRISE-версия)</li>
<li>Просматривать код для встраивания диаграммы в системы типа Confluence</li>
</ul>
<p>Чтобы посмотреть и массово управлять такими выданными правами, нужно перейти в раздел <a href="https://stormbpmn.com/app/guests" target="_blank" rel="noopener noreferrer">гости<ExternalLinkIcon/></a>.</p>
<div class="custom-container warning"><p class="custom-container-title">WARNING</p>
<p>Такое предоставление доступа не делает получателя доступа членом вашей команды. Такое предоставление доступа потребяет лимит бесплатных доступов на тарифе Personal.</p>
</div>
<p>При выдаче доступа человек получит уведомление по почте с предложением зарегистрироваться (если не было учетной записи в системе) или с тем, что ему предоставлен доступ (если учетная запись была).
Все диаграммы, которыми когда либо делились с человеком, доступы на главной странице в разделе &quot;Поделились со мной&quot;:<br>
<img src="@source/team-work/share-with-me.png" alt="image"></p>
<h3 id="на-уровне-папки" tabindex="-1"><a class="header-anchor" href="#на-уровне-папки"><span>На уровне папки</span></a></h3>
<p>В тарифе TEAM существует возможность поделится конкретной папкой с конкретным человеком. По смыслу работает точно так же  - отображается в &quot;поделились со мной&quot;, шлется нотификация. При этом человек НЕ увидит внутреннюю структуру папок, а просто увидит их все скопом.  Анонимный доступ до папок невозможен.
<img src="@source/team-work/share-folder.png" alt="image"></p>
<div class="custom-container tip"><p class="custom-container-title">TIP</p>
<p>Этот вариант хорошо работает, когда вы не хотите приглашать человека в вашу команду, но вам нужно поделиться с ним группой каких-то процессов.</p>
</div>
<h2 id="управление-командои" tabindex="-1"><a class="header-anchor" href="#управление-командои"><span>Управление командой</span></a></h2>
<h3 id="cоздание-команды" tabindex="-1"><a class="header-anchor" href="#cоздание-команды"><span>Cоздание команды</span></a></h3>
<h3 id="приглашение-в-команду" tabindex="-1"><a class="header-anchor" href="#приглашение-в-команду"><span>Приглашение в команду</span></a></h3>
<h3 id="управление-правами" tabindex="-1"><a class="header-anchor" href="#управление-правами"><span>Управление правами</span></a></h3>
<h3 id="обеспечение-качества-работы-команды" tabindex="-1"><a class="header-anchor" href="#обеспечение-качества-работы-команды"><span>Обеспечение качества работы команды</span></a></h3>
<h2 id="поделиться-процессом" tabindex="-1"><a class="header-anchor" href="#поделиться-процессом"><span>Поделиться процессом</span></a></h2>
<h2 id="встроить-процесс" tabindex="-1"><a class="header-anchor" href="#встроить-процесс"><span>Встроить процесс</span></a></h2>
<h2 id="поделиться-папкои" tabindex="-1"><a class="header-anchor" href="#поделиться-папкои"><span>Поделиться папкой</span></a></h2>
</div></template>


