<template><div><h1 id="с-чего-начать" tabindex="-1"><a class="header-anchor" href="#с-чего-начать"><span>С чего начать</span></a></h1>
<p>Stormbpmn  - это лучший веб-сервис для <strong>полноценного</strong> моделирования бизнес-процессов с использованием BPMN. В отличии от прочих сервисов, в Storm можно описывать все аспекты процессов:</p>
<ul>
<li>Cхему взаимодействия участников в BPMN;</li>
<li>Задачи участников;</li>
<li>Самих участников, как в виде ролей, так и на оргструктуре;</li>
<li>Длительность выполнения задач;</li>
<li>Использование систем, документов в бизнес-процессах;</li>
<li>Связь процессов друг с другом;</li>
</ul>
<div class="custom-container tip"><p class="custom-container-title">Наш главный приоритет</p>
<p>Скорость и удобство работы команд бизнес-аналитиков и их коллег. Вы убедитесь в этом, как только начнете работу с системой.</p>
</div>
<h2 id="какие-задачи-решает-stormbpmn" tabindex="-1"><a class="header-anchor" href="#какие-задачи-решает-stormbpmn"><span>Какие задачи решает Stormbpmn</span></a></h2>
<p>Система идеально подойдет, если вы:</p>
<ul>
<li>Хотите описать сложное взаимодействие группы людей и систем;</li>
<li>Спроектировать большие изменения вашей бизнес и ИТ-архитектуры;</li>
<li>Сфомировать ТЗ на автоматизацию бизнес-процессов;</li>
<li>Обеспечить быструю и качественную адаптацию новых сотрудников;</li>
</ul>
<p>Смотрите <RouteLink to="/real-life-scenarios/">примеры из реальной жизни</RouteLink>, чтобы узнать больше.</p>
<h2 id="ваш-первыи-процесс-от-идеи-до-заказчика-за-5-минут" tabindex="-1"><a class="header-anchor" href="#ваш-первыи-процесс-от-идеи-до-заказчика-за-5-минут"><span>Ваш первый процесс от идеи до заказчика за 5 минут</span></a></h2>
<ol>
<li>
<p>Зарегистрируйтесь в <a href="https://stormbpmn.com/app/signup" target="_blank" rel="noopener noreferrer">системе<ExternalLinkIcon/></a>:<br>
<img src="@source/sign-in.png" alt="image"></p>
</li>
<li>
<p>Создайте процесс:<br>
<img src="@source/create-process.png" alt="image"></p>
</li>
<li>
<p>Используйте <RouteLink to="//bpmn/">BPMN</RouteLink>:<br>
<img src="@source/model-process.png" alt="image"></p>
</li>
<li>
<p>Сохраните процесс:<br>
<img src="@source/save-process.png" alt="image"></p>
</li>
<li>
<p>Укажите имя:<br>
<img src="@source/enter-name.png" alt="image"></p>
</li>
<li>
<p>Поделись ссылкой:<br>
<img src="@source/share-process.png" alt="image"></p>
</li>
<li>
<p>Укажите анонимный доступ:<br>
<img src="@source/anon-share.png" alt="image"></p>
</li>
</ol>
<div class="custom-container tip"><p class="custom-container-title">Вот и все</p>
<p><strong>Отправьте ссылку коллеге, она уже в буфере обмена. Вы великолепны 🎉!</strong></p>
</div>
</div></template>


