<template><div><h1 id="совместная-работа" tabindex="-1"><a class="header-anchor" href="#совместная-работа"><span>Совместная работа</span></a></h1>
<div class="hint-container caution">
<p class="hint-container-title">Предупреждение</p>
<p>Раздел в разработке. Одновременная работа с одной диаграммой из нескольких вкладок или браузеров пока не поддерживается.</p>
</div>
<p>Совместная работа в система в работе предназначена для того, чтобы экономить ваше время за счет:</p>
<ul>
<li>Все видят одни и теже процессы</li>
<li>Все процессы в актуальном состоянии</li>
<li>Не надо пересылать файлы и ссылки</li>
<li>Все изменения версионируются и можно откатиться к пред. версиям, если кто-то что-то сломал</li>
<li>Можно посмотреть, чем текущая версия отличается от предыдущей.</li>
</ul>
<h2 id="_4-типа-совместнои-работы" tabindex="-1"><a class="header-anchor" href="#_4-типа-совместнои-работы"><span>4 типа совместной работы</span></a></h2>
<p>В системе существует несколько способов поделиться своей работой с коллегами - на уровне процесса, на уровне папки, на уровне команды и на уровне предприятия.</p>
<p>Чем ближе выданы права к диаграмме, тем они сильнее. Т.е. права на уровне процесса сильнее прав на уровне папки. А на уровне папки - сильнее чем на уровне команды.</p>
<h3 id="на-уровне-процесса-поделиться-конкретным-процессом" tabindex="-1"><a class="header-anchor" href="#на-уровне-процесса-поделиться-конкретным-процессом"><span>На уровне процесса - поделиться конкретным процессом</span></a></h3>
<p>Вы можете поделиться конкретной диаграммой с конкретными пользователями. Это хорошо работает, когда вам нужно просто поделиться одной диаграммой.
<img src="@source/team-work/share-diagram-1.png" alt="image"></p>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Используйте этот способ, если хотите поделиться процессом не заставляя регистрироваться в системе. Включите галочку анонимный доступ.</p>
</div>
<p>На этом экране можно настраивать:</p>
<ul>
<li>Отображение <RouteLink to="/features/#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%BE%D0%B2%D0%B5%D1%80%D0%BB%D0%B5%D0%B5%D0%B2">оверлеев</RouteLink>  по ссылке</li>
<li>Просматривать, редактировать или удалять права конкретных пользователей на диаграмму</li>
<li>Предоставлять анонимный доступ</li>
<li>Предоставлять доступ к диаграмме для организации (только ENTERPRISE-версия)</li>
<li>Просматривать код для встраивания диаграммы в системы типа Confluence</li>
</ul>
<p>Чтобы посмотреть и массово управлять такими выданными правами, нужно перейти в раздел <a href="https://stormbpmn.com/app/guests" target="_blank" rel="noopener noreferrer">гости<ExternalLinkIcon/></a>.</p>
<div class="hint-container warning">
<p class="hint-container-title">Примечание</p>
<p>Такое предоставление доступа не делает получателя доступа членом вашей команды. Такое предоставление доступа потребяет лимит бесплатных доступов на тарифе Personal.</p>
</div>
<p>При выдаче доступа человек получит уведомление по почте с предложением зарегистрироваться (если не было учетной записи в системе) или с тем, что ему предоставлен доступ (если учетная запись была).
Все диаграммы, которыми когда либо делились с человеком, доступы на главной странице в разделе &quot;Поделились со мной&quot;:<br>
<img src="@source/team-work/share-with-me.png" alt="image"></p>
<h3 id="на-уровне-папки" tabindex="-1"><a class="header-anchor" href="#на-уровне-папки"><span>На уровне папки</span></a></h3>
<p>В тарифе TEAM существует возможность поделится конкретной папкой с конкретным человеком. По смыслу работает точно так же  - отображается в &quot;поделились со мной&quot;, шлется нотификация. При этом человек НЕ увидит внутреннюю структуру папок, а просто увидит их все скопом.  Анонимный доступ до папок невозможен.<br>
<img src="@source/team-work/share-folder.png" alt="image"></p>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Этот вариант хорошо работает, когда вы не хотите приглашать человека в вашу команду, но вам нужно поделиться с ним группой каких-то процессов.</p>
</div>
<h2 id="управление-командои" tabindex="-1"><a class="header-anchor" href="#управление-командои"><span>Управление командой</span></a></h2>
<p>Команда - это группа людей, которые вместе работают над одними процессами. <em>Например, у вас есть команда &quot;Кредитные карты&quot;, в которой 10 человек и все они работают с продуктом &quot;Кредитная карта&quot;</em>.<br>
Участники команды, в отличии от всех других способов совместной работы, получают такие приемущества:</p>
<ul>
<li>Видят все диаграммы всех участников команды автоматически, без необходимости предоставлять права</li>
<li>Видят структуру папок</li>
<li>У них общие <RouteLink to="/features/#%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B-1">элементы архитектуры</RouteLink> и <RouteLink to="/features/#%D1%80%D0%BE%D0%BB%D0%B8">роли</RouteLink></li>
<li>Видят общие шаблоны регламентов</li>
<li>Имеют общие требования по качеству описания процессов</li>
<li>Видят общую <RouteLink to="/features/#%D0%BE%D0%B3%D1%80%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%82%D1%83%D1%80%D0%B0">оргструктуру</RouteLink></li>
</ul>
<div class="hint-container warning">
<p class="hint-container-title">Примечание</p>
<p>Доступность диаграмм для членов команды определяется по ее участникам. Участник входит в команду - его диаграммы всем видны. Участник уволился и его убрали из команды - диаграммы не видны.<br>
Чтобы избежать недоступности диаграмм после увольнения сотрудников используйте кнопку &quot;забрать авторство диаграмм&quot; перед тем, как удалить участника.</p>
</div>
<h3 id="cоздание-команды" tabindex="-1"><a class="header-anchor" href="#cоздание-команды"><span>Cоздание команды</span></a></h3>
<p>Создать команду может любой пользователь системы по <a href="https://stormbpmn.com/app/team/" target="_blank" rel="noopener noreferrer">ссылке<ExternalLinkIcon/></a><br>
<img src="@source/team-work/create-team.png" alt="image"></p>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Создание команды в первый раз включает тестовый период со всеми функциями системы, попробуйте!</p>
</div>
<h3 id="приглашение-в-команду" tabindex="-1"><a class="header-anchor" href="#приглашение-в-команду"><span>Приглашение в команду</span></a></h3>
<p>Чтобы команда работала, люди должны иметь уточные записи в системе и вступить в команду. Есть несколько способов вступить в команду:</p>
<h4 id="по-почте" tabindex="-1"><a class="header-anchor" href="#по-почте"><span>По почте</span></a></h4>
<p>При создании команды или по <a href="https://stormbpmn.com/app/team/" target="_blank" rel="noopener noreferrer">ссылке<ExternalLinkIcon/></a> при нажатии на кнопку <strong>&quot;пригласить по почте&quot;</strong> вы можете указать почтовые ящики ващих коллег. Если у них есть аккаунт в системе и они не входят в команды, от они сразу же будут добавлены в вашу команду. Если у них нет аккаунтов, то сначала они получат приглашение зарегистрироваться.</p>
<div class="hint-container caution">
<p class="hint-container-title">Предупреждение</p>
<p>Поскольку приглашение по почте связано с отправкой писем от нашего имени, у нас встроена защита от спама. Не отправляйте больше 5 приглашений за раз.</p>
</div>
<h4 id="по-ссылке" tabindex="-1"><a class="header-anchor" href="#по-ссылке"><span>По ссылке</span></a></h4>
<p>Самый удобный вариант - получить ссылку по кнопке <strong>&quot;пригласить по ссылке&quot;</strong> и отправить его коллегам. Перейдя по ней они смогут зарегистрироваться или присоедениться к команде. В этом случае у них будут права на чтение, их можно будет сменить позднее.</p>
<div class="hint-container warning">
<p class="hint-container-title">Примечание</p>
<p>Если участник уже член команды, то вступить по ссылке у него не получится - сначала надо выйти из команды или удалить команду.</p>
</div>
<h4 id="по-домену" tabindex="-1"><a class="header-anchor" href="#по-домену"><span>По домену</span></a></h4>
<p>Если ваша организация имеет свой домен, например <strong>stormbpmn.com</strong>  , то вы можете указать его в настройках команды. Тогдай любой человек с такой почтой, например <strong>d.kotov@stormbpmn.com</strong>, получат возможность вступить в вашу команду.  Тоже хороший способ собрать всех коллег вместе. Указываете домен и говорите &quot;Регистрируемся с рабочих почт и вступаем в команду!&quot;.</p>
<h3 id="управление-правами" tabindex="-1"><a class="header-anchor" href="#управление-правами"><span>Управление правами</span></a></h3>
<p>Сейчас существует 3 типа прав:</p>
<ul>
<li><strong>Администратор</strong> - может создавать роли и элементы архитектуры и делать вообще все с командой.</li>
<li><strong>Чтение\редактирование</strong> - НЕ может создавать роли и элементы архитектуры, НЕ может менять настройки команды. Может редактировать папки и диаграммы коллег.</li>
<li><strong>Чтение</strong> - Не может редактировать диаграммы коллег, не может трогать папки. Может создавать диаграммы.</li>
</ul>
<p>Управляение правами осуществяется путем выбора участников и нажатия на кнопку <strong>&quot;Сменить права&quot;</strong>.</p>
<h3 id="прочие-настроики-команды" tabindex="-1"><a class="header-anchor" href="#прочие-настроики-команды"><span>Прочие настройки команды</span></a></h3>
<h3 id="выход-из-команды" tabindex="-1"><a class="header-anchor" href="#выход-из-команды"><span>Выход из команды</span></a></h3>
<h3 id="удаление-команды" tabindex="-1"><a class="header-anchor" href="#удаление-команды"><span>Удаление команды</span></a></h3>
<h2 id="поделиться-процессом" tabindex="-1"><a class="header-anchor" href="#поделиться-процессом"><span>Поделиться процессом</span></a></h2>
<h2 id="встроить-процесс" tabindex="-1"><a class="header-anchor" href="#встроить-процесс"><span>Встроить процесс</span></a></h2>
<h2 id="поделиться-папкои" tabindex="-1"><a class="header-anchor" href="#поделиться-папкои"><span>Поделиться папкой</span></a></h2>
<h2 id="гости" tabindex="-1"><a class="header-anchor" href="#гости"><span>Гости</span></a></h2>
</div></template>


