<template><div><h1 id="командная-работа" tabindex="-1"><a class="header-anchor" href="#командная-работа"><span>Командная работа</span></a></h1>
<div class="hint-container caution">
<p class="hint-container-title">Предупреждение</p>
<p>Раздел в разработке. Одновременная работа с одной диаграммой из нескольких вкладок или браузеров пока не поддерживается.</p>
</div>
<p>Командная работа в система в работе предназначена для того, чтобы экономить ваше время за счет:</p>
<ul>
<li>Все видят одни и теже процессы</li>
<li>Все процессы в актуальном состоянии</li>
<li>Не надо пересылать файлы и ссылки</li>
<li>Все изменения версионируются и можно откатиться к пред. версиям, если кто-то что-то сломал</li>
<li>Можно посмотреть, чем текущая версия отличается от предыдущей.</li>
</ul>
<h2 id="_4-типа-команднои-работы" tabindex="-1"><a class="header-anchor" href="#_4-типа-команднои-работы"><span>4 типа командной работы</span></a></h2>
<p>В системе существует несколько способов поделиться своей работой с коллегами:</p>
<ol>
<li>на уровне процесса;</li>
<li>на уровне команды;</li>
<li>на уровне предприятия.</li>
</ol>
<p>Чем ближе выданы права к диаграмме, тем они сильнее. Т.е. права на уровне процесса сильнее прав на уровне папки. А на уровне папки - сильнее чем на уровне команды.</p>
<h3 id="на-уровне-процесса-поделиться-конкретнои-диаграммои" tabindex="-1"><a class="header-anchor" href="#на-уровне-процесса-поделиться-конкретнои-диаграммои"><span>На уровне процесса - поделиться конкретной диаграммой</span></a></h3>
<p>Это способ работает когда нужно просто поделиться одной диаграммой. Он описан в функции <RouteLink to="/features_new_storm/1_bpmn-editor/#%D0%BF%D0%BE%D0%B4%D0%B5%D0%BB%D0%B8%D1%82%D1%8C%D1%81%D1%8F-%D0%B4%D0%B8%D0%B0%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%BE%D0%B8">Поделиться диаграммой</RouteLink></p>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Этот вариант хорошо работает, когда вы не хотите приглашать человека в вашу команду, но вам нужно поделиться с ним группой каких-то процессов.</p>
</div>
<h2 id="управление-командои" tabindex="-1"><a class="header-anchor" href="#управление-командои"><span>Управление командой</span></a></h2>
<p>Команда - это группа людей, которые вместе работают над одними процессами. <em>Например, у вас есть команда &quot;Кредитные карты&quot;, в которой 10 человек и все они работают с продуктом &quot;Кредитная карта&quot;</em>.<br>
Участники команды, в отличии от всех других способов совместной работы, получают такие приемущества:</p>
<ol>
<li><strong>Видят все диаграммы всех участников команды автоматически</strong>, без необходимости предоставлять права</li>
<li>Видят структуру папок</li>
<li>Работают по общим требованиям, правилам качества описания процессов</li>
<li>У них общие:
<ul>
<li><RouteLink to="/team-work/3_org-chart-editor.html">оргструктура</RouteLink></li>
<li><RouteLink to="/team-work/4_assignees.html">роли</RouteLink></li>
<li><RouteLink to="/team-work/5_elements-architecture/">элементы архитектуры</RouteLink></li>
<li><RouteLink to="/team-work/6_reglaments/process_reglament.html#%D1%88%D0%B0%D0%B1%D0%BB%D0%BE%D0%BD-%D1%80%D0%B5%D0%B3%D0%BB%D0%B0%D0%BC%D0%B5%D0%BD%D1%82%D0%B0-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%B0">шаблоны регламентов</RouteLink></li>
</ul>
</li>
</ol>
<div class="hint-container caution">
<p class="hint-container-title">Предупреждение</p>
<p>Доступность диаграмм для членов команды определяется по ее участникам. Участник входит в команду - его диаграммы всем видны. Участник уволился и его убрали из команды - диаграммы не видны.<br>
Чтобы <strong>избежать недоступности диаграмм после увольнения сотрудников</strong> используйте кнопку <a href="#%D1%81%D0%B4%D0%B5%D0%BB%D0%B0%D1%82%D1%8C-%D1%81%D0%B5%D0%B1%D1%8F-%D0%B0%D0%B2%D1%82%D0%BE%D1%80%D0%BE%D0%BC-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%BE%D0%B2">&quot;Сделать себя автором процессов&quot;</a>  перед тем, как удалить участника.</p>
</div>
<h3 id="cоздание-команды" tabindex="-1"><a class="header-anchor" href="#cоздание-команды"><span>Cоздание команды</span></a></h3>
<p>Создать команду может любой пользователь системы по <a href="https://stormbpmn.com/app/team/participants" target="_blank" rel="noopener noreferrer">ссылке<ExternalLinkIcon/></a><br>
<img src="@source/team-work/create-team.png" alt="image"></p>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Создание команды в первый раз включает <strong>бесплатный</strong> тестовый период для ознакомления со всеми функциями системы. Попробуйте!</p>
</div>
<h3 id="приглашение-в-команду" tabindex="-1"><a class="header-anchor" href="#приглашение-в-команду"><span>Приглашение в команду</span></a></h3>
<p>Чтобы команда работала, люди должны иметь учетные записи в системе и вступить в команду. Есть несколько способов вступить в команду:</p>
<h4 id="по-почте" tabindex="-1"><a class="header-anchor" href="#по-почте"><span>По почте</span></a></h4>
<p>При создании команды или по <a href="https://stormbpmn.com/app/team/participants" target="_blank" rel="noopener noreferrer">ссылке<ExternalLinkIcon/></a> при нажатии на кнопку <strong>&quot;пригласить по почте&quot;</strong> вы можете указать почтовые ящики ващих коллег. Если у них есть аккаунт в системе и они не входят в команды, от они сразу же будут добавлены в вашу команду. Если у них нет аккаунтов, то сначала они получат приглашение зарегистрироваться.
<img src="@source/team-work/invite_team.png" alt="image"></p>
<div class="hint-container caution">
<p class="hint-container-title">Предупреждение</p>
<p>Поскольку приглашение по почте связано с отправкой писем от нашего имени, у нас встроена защита от спама. Не отправляйте больше 5 приглашений за раз.</p>
</div>
<h4 id="по-ссылке" tabindex="-1"><a class="header-anchor" href="#по-ссылке"><span>По ссылке</span></a></h4>
<p>Самый удобный вариант - получить ссылку по кнопке <strong>&quot;Пригласить по ссылке&quot;</strong> и отправить его коллегам удобным Вам способом. Перейдя по ней они смогут зарегистрироваться или присоедениться к команде. В этом случае у них будут права на чтение, их можно будет сменить позднее.</p>
<h4 id="по-домену" tabindex="-1"><a class="header-anchor" href="#по-домену"><span>По домену</span></a></h4>
<p>Если ваша организация имеет свой домен, например <strong>stormbpmn.com</strong>  , то вы можете указать его в настройках команды. Тогдай любой человек с такой почтой, например <strong>d.kotov@stormbpmn.com</strong>, получат возможность вступить в вашу команду.  Тоже хороший способ собрать всех коллег вместе. Указываете домен и говорите &quot;Регистрируемся с рабочих почт и вступаем в команду!&quot;.</p>
<h3 id="управление-правами" tabindex="-1"><a class="header-anchor" href="#управление-правами"><span>Управление правами</span></a></h3>
<p>В системе у участников команды есть базовые права 3 типов:</p>
<ol>
<li><strong>Админ</strong> - права управления командой и её объектами: пр роли, элементы архитектуры (создание, редактирование, удаление).</li>
<li><strong>Чтение и изменение</strong> - НЕ может создавать роли и элементы архитектуры, НЕ может менять настройки команды. Может редактировать папки и диаграммы коллег.</li>
<li><strong>Только чтение</strong> - Не может редактировать диаграммы коллег, не может трогать папки. Может создавать диаграммы.</li>
</ol>
<p>Управление правами осуществяется путем выбора участника из списка команды и нажатия на кнопку <strong>&quot;Изменить права&quot;</strong>.<br>
<img src="@source/team-work/change_team_rights.png" alt="image"></p>
<h3 id="гранулярные-права" tabindex="-1"><a class="header-anchor" href="#гранулярные-права"><span>Гранулярные права</span></a></h3>
<div class="hint-container caution">
<p class="hint-container-title">В разработке</p>
<p>Функция гранулярных прав позволяет выдавать участникам команды индивидуальные наборы прав к каждому типу объектов системы: папки, роли, элементы архитектуры, оргструктура, реестр процессов и т.д.</p>
</div>
<h3 id="удаление-участника-из-команды" tabindex="-1"><a class="header-anchor" href="#удаление-участника-из-команды"><span>Удаление участника из команды</span></a></h3>
<p>Админ команды имеет возможность удалить участника из команды.
При удалении система выдаст предупреждение о риске недоступности диаграмм удаляемого участника. И предложить оставить их в команде
<img src="@source/team-work/remove-from-team.png" alt="image"></p>
<p>Если желаете оставить в команде диаграммы удаляемого участника, то используйте кнопку</p>
<h3 id="сделать-себя-автором-процессов" tabindex="-1"><a class="header-anchor" href="#сделать-себя-автором-процессов"><span>Сделать себя автором процессов</span></a></h3>
<p><img src="@source/team-work/make_yourself_autor.png" alt="image"></p>
<h3 id="прочие-настроики-команды" tabindex="-1"><a class="header-anchor" href="#прочие-настроики-команды"><span>Прочие настройки команды</span></a></h3>
<h3 id="выход-из-команды" tabindex="-1"><a class="header-anchor" href="#выход-из-команды"><span>Выход из команды</span></a></h3>
<h3 id="удаление-команды" tabindex="-1"><a class="header-anchor" href="#удаление-команды"><span>Удаление команды</span></a></h3>
<h2 id="поделиться-процессом" tabindex="-1"><a class="header-anchor" href="#поделиться-процессом"><span>Поделиться процессом</span></a></h2>
<h2 id="встроить-процесс" tabindex="-1"><a class="header-anchor" href="#встроить-процесс"><span>Встроить процесс</span></a></h2>
<h2 id="поделиться-папкои" tabindex="-1"><a class="header-anchor" href="#поделиться-папкои"><span>Поделиться папкой</span></a></h2>
<h2 id="гости" tabindex="-1"><a class="header-anchor" href="#гости"><span>Гости</span></a></h2>
</div></template>


