<template><div><h1 id="в-реальнои-жизни" tabindex="-1"><a class="header-anchor" href="#в-реальнои-жизни"><span>В реальной жизни</span></a></h1>
<p>В реальной жизни люди не хотят разбираться в кнопках и формах <em>просто так</em>, люди хотят решать рабочие задачи быстро и эффективно.</p>
<p>На этой странице собраны примеры решения типичных задач бизнес-аналитиков в контексте моделирования бизнес-процессов и даны ссылки на описание <strong>функций системы</strong>, с помощью которых они решаются.</p>
<nav class="table-of-contents"><ul><li><router-link to="#создать-тз-на-разработку-процесса">Создать ТЗ на разработку процесса</router-link></li><li><router-link to="#подговиться-к-операционному-росту-и-адаптации-новых-сотрудников">Подговиться к операционному росту и адаптации новых сотрудников</router-link></li><li><router-link to="#согласовать-процесс-с-заказчиком">Согласовать процесс с заказчиком</router-link></li><li><router-link to="#спроектировать-изменения-процесса-as-is-и-to-be">Спроектировать изменения процесса AS-IS и TO-BE</router-link></li><li><router-link to="#создать-реестр-процессов-компании">Создать реестр процессов компании</router-link></li></ul></nav>
<h2 id="создать-тз-на-разработку-процесса" tabindex="-1"><a class="header-anchor" href="#создать-тз-на-разработку-процесса"><span>Создать ТЗ на разработку процесса</span></a></h2>
<p>В этом видео бизнес-аналитик подробно рассказывает, как он и его коллега используют систему для формирования технических заданий на разработку и изменение 1С.</p>
<iframe width="560" height="315" src="https://www.youtube.com/embed/QlOFXuYYEgU?si=NcKOSCi7FZEpQ6Vw" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>
<p>Используемые функции:</p>
<ul>
<li><RouteLink to="/features/#%D1%80%D0%B5%D0%B4%D0%B0%D0%BA%D1%82%D0%BE%D1%80-bpmn">Моделирование процессов в BPMN</RouteLink></li>
<li><RouteLink to="/features/#%D0%BE%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D0%B8%D0%B5-%D0%B7%D0%B0%D0%B4%D0%B0%D1%87">Описание задач</RouteLink></li>
<li><RouteLink to="/features/#%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">Элементы архитектуры</RouteLink></li>
<li><RouteLink to="/features/#%D0%BA%D0%BE%D0%BC%D0%BC%D0%B5%D0%BD%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">Комментарии</RouteLink></li>
<li><RouteLink to="/features/#%D1%80%D0%BE%D0%BB%D0%B8">Роли</RouteLink></li>
<li><RouteLink to="/features/#%D1%80%D0%B5%D0%B3%D0%BB%D0%B0%D0%BC%D0%B5%D0%BD%D1%82%D1%8B">Регламент</RouteLink></li>
<li><RouteLink to="/team-work/#%D0%BF%D0%BE%D0%B4%D0%B5%D0%BB%D0%B8%D1%82%D1%8C%D1%81%D1%8F-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%BE%D0%BC">Поделиться процессом</RouteLink></li>
</ul>
<h2 id="подговиться-к-операционному-росту-и-адаптации-новых-сотрудников" tabindex="-1"><a class="header-anchor" href="#подговиться-к-операционному-росту-и-адаптации-новых-сотрудников"><span>Подговиться к операционному росту и адаптации новых сотрудников</span></a></h2>
<p>В этом видео CEO stormbpmn описывает бизнес-процессы stormbpmn <s>в stormbpmn</s> 😃 для предстоящего роста количества сотрудников и их быстрой адаптации.</p>
<iframe width="560" height="315" src="https://www.youtube.com/embed/5wmeM3gWwbs?si=VKqGCRsAaVyj9xIM" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>
<p>Используемые функции:</p>
<ul>
<li><RouteLink to="/features/#%D1%80%D0%B5%D0%B4%D0%B0%D0%BA%D1%82%D0%BE%D1%80-bpmn">Моделирование процессов в BPMN</RouteLink></li>
<li><RouteLink to="/features/#%D1%80%D0%BE%D0%BB%D0%B8">Роли</RouteLink></li>
<li><RouteLink to="/features/#%D0%BE%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D0%B8%D0%B5-%D0%B7%D0%B0%D0%B4%D0%B0%D1%87">Описание задач</RouteLink></li>
<li><RouteLink to="/features/#%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">Элементы архитектуры</RouteLink></li>
</ul>
<h2 id="согласовать-процесс-с-заказчиком" tabindex="-1"><a class="header-anchor" href="#согласовать-процесс-с-заказчиком"><span>Согласовать процесс с заказчиком</span></a></h2>
<p>В этом сценарии мы предполагаем, что у вас есть <strong>заказчик</strong> - ваш коллега, для которого вы описываете процесс или представитель внешний организации. Ваша задача - получить формальное подтверждение того, что заказчик видел процесс и согласен с тем, как оно описан.</p>
<p>Для этого вам потребуется, как минимум:</p>
<ul>
<li><RouteLink to="/features/#%D1%80%D0%B5%D0%B4%D0%B0%D0%BA%D1%82%D0%BE%D1%80-bpmn">Моделирование процессов в BPMN</RouteLink></li>
<li><RouteLink to="/features/#%D0%BA%D0%BE%D0%BC%D0%BC%D0%B5%D0%BD%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">Комментарии</RouteLink></li>
<li><RouteLink to="/features/#%D1%81%D0%BE%D0%B3%D0%BB%D0%B0%D1%81%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">Согласование</RouteLink></li>
<li><RouteLink to="/team-work/#%D0%BF%D0%BE%D0%B4%D0%B5%D0%BB%D0%B8%D1%82%D1%8C%D1%81%D1%8F-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%BE%D0%BC">Поделиться процессом</RouteLink></li>
</ul>
<p>А если <strong>заказчик</strong> будет очень внимателен и требователен к описанию процессов, то вам может потребоваться:</p>
<ul>
<li><RouteLink to="/features/#%D0%BE%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D0%B8%D0%B5-%D0%B7%D0%B0%D0%B4%D0%B0%D1%87">Описание задач</RouteLink></li>
<li><RouteLink to="/features/#%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">Элементы архитектуры</RouteLink></li>
<li><RouteLink to="/features/#%D0%BE%D0%B1%D0%B5%D1%81%D0%BF%D0%B5%D1%87%D0%B5%D0%BD%D0%B8%D0%B5-%D0%BA%D0%B0%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%B0">Обеспечение качества</RouteLink></li>
</ul>
<p>В этом видео мы подготовили подсказку для ваших <strong>заказчиков</strong>, чтобы они знали и понимали, где именно искать интересующую их информацию:</p>
<iframe width="560" height="315" src="https://www.youtube.com/embed/tKGegGh15oc?si=pam4af5M82dYhPKw" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>
<h2 id="спроектировать-изменения-процесса-as-is-и-to-be" tabindex="-1"><a class="header-anchor" href="#спроектировать-изменения-процесса-as-is-и-to-be"><span>Спроектировать изменения процесса AS-IS и TO-BE</span></a></h2>
<p>В этом сценарии мы хотим изменить какой-то процесс и для этого нам нужно нарисовать 2 состояния процесса - AS-IS и TO-BE. В этом нам помогут:</p>
<ul>
<li><RouteLink to="/features/#%D1%80%D0%B5%D0%B4%D0%B0%D0%BA%D1%82%D0%BE%D1%80-bpmn">Моделирование процессов в BPMN</RouteLink></li>
<li><RouteLink to="/features/#%D0%BE%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D0%B8%D0%B5-%D0%B7%D0%B0%D0%B4%D0%B0%D1%87">Описание задач</RouteLink></li>
<li><RouteLink to="/features/#%D1%80%D0%BE%D0%BB%D0%B8">Роли</RouteLink></li>
<li><RouteLink to="/features/#%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">Элементы архитектуры</RouteLink></li>
<li><RouteLink to="/features/#%D1%81%D1%80%D0%B0%D0%B2%D0%BD%D0%B5%D0%BD%D0%B8%D0%B5-as-is-%D0%B8-to-be">AS-IS и TO-BE</RouteLink></li>
</ul>
<h2 id="создать-реестр-процессов-компании" tabindex="-1"><a class="header-anchor" href="#создать-реестр-процессов-компании"><span>Создать реестр процессов компании</span></a></h2>
<p>В этом сценарии вам нужно описать все процессы и наладить постоянную работу с ними. Для этого вам потребуется:</p>
<ul>
<li><RouteLink to="/features/#%D1%80%D0%B5%D0%B4%D0%B0%D0%BA%D1%82%D0%BE%D1%80-bpmn">Моделирование процессов в BPMN</RouteLink></li>
<li><RouteLink to="/features/#%D0%BE%D0%BF%D0%B8%D1%81%D0%B0%D0%BD%D0%B8%D0%B5-%D0%B7%D0%B0%D0%B4%D0%B0%D1%87">Описание задач</RouteLink></li>
<li><RouteLink to="/features/#%D1%80%D0%BE%D0%BB%D0%B8">Роли</RouteLink></li>
<li><RouteLink to="/features/#%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">Элементы архитектуры</RouteLink></li>
<li><RouteLink to="/team-work/">Совместная работа</RouteLink></li>
<li><RouteLink to="/features/#%D0%BE%D0%B1%D0%B5%D1%81%D0%BF%D0%B5%D1%87%D0%B5%D0%BD%D0%B8%D0%B5-%D0%BA%D0%B0%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%B0">Обеспечение качества</RouteLink></li>
<li><RouteLink to="/features/#%D0%BF%D0%B0%D0%BF%D0%BA%D0%B8">Папки</RouteLink></li>
<li><RouteLink to="/features/#%D1%80%D0%B5%D0%B4%D0%B0%D0%BA%D1%82%D0%BE%D1%80-%D0%B3%D1%80%D1%83%D0%BF%D0%BF-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%BE%D0%B2">Группы процессов</RouteLink></li>
</ul>
</div></template>


