<template><div><h1 id="установка" tabindex="-1"><a class="header-anchor" href="#установка"><span>Установка</span></a></h1>
<p>Stormbpmn поставляется как docker-контейнер из приватного репозитория, который включается в себя и front, и back. Установка заключается в правильном указании .ENV-перменных внутрь контейнера, поднятии смежных контейнеров (если необходимо), и манипуляции в административном интерфейсе.</p>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Контейнер расположен в приватном репозитории, запросите доступ к нему через менеджера, с которым работаете.</p>
</div>
<h3 id="требования-к-ресурсам" tabindex="-1"><a class="header-anchor" href="#требования-к-ресурсам"><span>Требования к ресурсам</span></a></h3>
<p>Контейнер stormbmn:</p>
<ul>
<li>vCPU - 4</li>
<li>vRAM - 8 GB
Прочие контейнеры не требуют серьезных ресурсов - если вы будете создавать их с нуля (а не переиспользовать существующие сервисы компании), то ориентируетесь на минимальные требования из документации соответствующих контейнеров.</li>
</ul>
</div></template>


