import comp from "D:/stormbpmn-documentation/src/.vuepress/.temp/pages/features_new_storm/4_assignees.html.vue"
const data = JSON.parse("{\"path\":\"/features_new_storm/4_assignees.html\",\"title\":\"New Шторм. Роли\",\"lang\":\"ru-RU\",\"frontmatter\":{\"order\":4},\"headers\":[{\"level\":2,\"title\":\"Создание ролей\",\"slug\":\"создание-ролеи\",\"link\":\"#создание-ролеи\",\"children\":[{\"level\":3,\"title\":\"С интерфейса процесса в правом меню:\",\"slug\":\"с-интерфеиса-процесса-в-правом-меню\",\"link\":\"#с-интерфеиса-процесса-в-правом-меню\",\"children\":[]},{\"level\":3,\"title\":\"С интерфейса процесса в меню подробностей:\",\"slug\":\"с-интерфеиса-процесса-в-меню-подробностеи\",\"link\":\"#с-интерфеиса-процесса-в-меню-подробностеи\",\"children\":[]},{\"level\":3,\"title\":\"В левом меню главной страницы\",\"slug\":\"в-левом-меню-главнои-страницы\",\"link\":\"#в-левом-меню-главнои-страницы\",\"children\":[]}]},{\"level\":2,\"title\":\"Редактирование ролей\",\"slug\":\"редактирование-ролеи\",\"link\":\"#редактирование-ролеи\",\"children\":[]},{\"level\":2,\"title\":\"Удаление ролей\",\"slug\":\"удаление-ролеи\",\"link\":\"#удаление-ролеи\",\"children\":[]}],\"git\":{\"createdTime\":1714504462000,\"updatedTime\":1741038310000,\"contributors\":[{\"name\":\"VovaGDX\",\"email\":\"vladimir.shishkin@gmail.com\",\"commits\":5}]},\"readingTime\":{\"minutes\":1.18,\"words\":354},\"filePathRelative\":\"features_new_storm/4_assignees.md\",\"localizedDate\":\"30 апреля 2024 г.\",\"excerpt\":\"\\n<p>Роли это отличный инструмент для указания исполнителей задач. Под ролью понимается исполнитель конкретной задачи в процессе или процессах (т.к. Роли - это справочник, который можно переиспользовать). Роли это правильная и хорошая альтернатива дорожкам.</p>\\n<p>Роль - это испольнитель задачи. Роль это не должность.\\n1 задача = 1 роль = N (несколько) должностей.\\nОдну роль может выполнять несколько должностей. Например, роль \\\"Инициатор закупки товаров для нужд компании\\\". Её может выполнять несколько должностей в одной компании: офис-менеджер, бухгалтер, заведующий хозяйством, администратор\\nА может и одна должность выполнять несколько ролей. Например, директор компании может выполнять роль, исполняющую административные задачи, а также роль, выполняющую юридические задачи, функции ведения бухгалтерского учёта, кадровую работу и т.д</p>\"}")
export { comp, data }

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updatePageData) {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ data }) => {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  })
}
