<template><div><h1 id="создание-эа" tabindex="-1"><a class="header-anchor" href="#создание-эа"><span>Создание ЭА</span></a></h1>
<h1 id="создание-элемента-архитектуры" tabindex="-1"><a class="header-anchor" href="#создание-элемента-архитектуры"><span>Создание элемента архитектуры</span></a></h1>
<div class="hint-container warning">
<p class="hint-container-title">Примечание</p>
<p>Создавать Элементы архитектуры  может <strong>администратор команды</strong> или участник, наделенный им соответствующим правом. Элементы архитектуры - это часть платной подписки TEAM или Enterprise. Без подписки их использование невозможно.</p>
</div>
<p>При создании Элемента архитектуры можно указать:</p>
<ul>
<li><strong>Внешний ID</strong> - идентификатор элемента в другой системе. Будет полезно, если вы загружаете элементы из других систем.</li>
<li><strong>Ссылка во внешней системе</strong> - ссылка на внешнюю систему. Будет красиво отображаться, если заполнена. Поддерживается плейсхолдер.</li>
<li><strong>Статус</strong> - отображет информацию о том, в каком состоянии находится Элемент архитектуры.</li>
<li><strong>Цвет</strong> - используется в оверлеях.</li>
</ul>
<h2 id="с-интерфеиса-процесса-в-правом-меню" tabindex="-1"><a class="header-anchor" href="#с-интерфеиса-процесса-в-правом-меню"><span>С интерфейса процесса в <RouteLink to="/features/1_bpmn-editor.html#%D0%BF%D1%80%D0%B0%D0%B2%D0%BE%D0%B5-%D0%BC%D0%B5%D0%BD%D1%8E">правом меню</RouteLink></span></a></h2>
<p><img src="@source/features_new_storm/6) Элементы архитектуры/create-element_architecture-1.png" alt="image"></p>
<ol>
<li>Встаньте на задачу</li>
<li>Нажмите &quot;+&quot; Роль</li>
</ol>
<p>Откроется</p>
<h2 id="меню-редактирования-элемента-архитектуры" tabindex="-1"><a class="header-anchor" href="#меню-редактирования-элемента-архитектуры"><span>меню редактирования элемента архитектуры</span></a></h2>
<p><img src="@source/features_new_storm/6) Элементы архитектуры/create-element_architecture-2.png" alt="image"></p>
<ol>
<li>Впишите название элемента архитектуры (ЭА)</li>
<li>Выберите тип ЭА</li>
<li>Выберите цвет оверлея для отображения ЭА на схеме</li>
<li>Укажите ID элемента архитектуры во внешнем источнике</li>
<li>Впишите ссылку на ЭА во внешней системе</li>
<li>Установите статус ЭА</li>
<li>Сохраните ЭА</li>
</ol>
<p><strong>Видео с примером создания элемента архитектуры</strong> <br>
<img src="@source/features_new_storm/6) Элементы архитектуры/create-element_architecture-rm.gif" alt="image"></p>
<p><br>
<br>
\</p>
<h2 id="с-интерфеиса-процесса-в-меню-подробностеи" tabindex="-1"><a class="header-anchor" href="#с-интерфеиса-процесса-в-меню-подробностеи"><span>С интерфейса процесса в <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%BF%D0%BE%D0%B4%D1%80%D0%BE%D0%B1%D0%BD%D0%BE%D1%81%D1%82%D0%B5%D0%B9">меню подробностей</a>:</span></a></h2>
<p><img src="@source/features_new_storm/6) Элементы архитектуры/create-element_architecture-3.png" alt="image"></p>
<ol>
<li>Встаньте на задачу</li>
<li>Откройте меню подробностей</li>
<li>Нажмите &quot;+&quot; Элемент архитектуры</li>
<li>откроется <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D1%80%D0%B5%D0%B4%D0%B0%D0%BA%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D1%8F-%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D0%B0-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">меню редактирования элемента архитектуры</a></li>
</ol>
<h2 id="в-левом-меню-главнои-страницы" tabindex="-1"><a class="header-anchor" href="#в-левом-меню-главнои-страницы"><span>В левом меню главной страницы</span></a></h2>
<p>Или по <a href="https://new.stormbpmn.com/app/team/assets" target="_blank" rel="noopener noreferrer">ссылке<ExternalLinkIcon/></a>:<br>
<img src="@source/features_new_storm/6) Элементы архитектуры/create-element_architecture-4.png" alt="image"></p>
<p>Откроется <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D1%80%D0%B5%D0%B4%D0%B0%D0%BA%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D1%8F-%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D0%B0-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">меню редактирования элемента архитектуры</a></p>
<div class="hint-container caution">
<p class="hint-container-title">В разработке</p>
<h2 id="c-помощью-загрузки-из-csv" tabindex="-1"><a class="header-anchor" href="#c-помощью-загрузки-из-csv"><span>C помощью загрузки из .csv</span></a></h2>
<p>Разделитель - запятая, кодировка - UTF8.
По <a href="https://new.stormbpmn.com/app/team" target="_blank" rel="noopener noreferrer">ссылке<ExternalLinkIcon/></a>:</p>
</div>
<h2 id="c-помощью-rest-api" tabindex="-1"><a class="header-anchor" href="#c-помощью-rest-api"><span>C помощью <RouteLink to="/enterprise/rest-api.html#%D0%B7%D0%B0%D0%B3%D1%80%D1%83%D0%B7%D0%BA%D0%B0-%D0%B8-%D0%B8%D0%BB%D0%B8-%D0%BE%D0%B1%D0%BD%D0%BE%D0%B2%D0%BB%D0%B5%D0%BD%D0%B8%D0%B5-%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D0%BE%D0%B2-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">REST API</RouteLink></span></a></h2>
<!---

## Редактирование Элементов архитектуры

Редактирование Элементов архитектуры доступно
- в интерфейсе процесса 

![image](edit-element_architecture-1.png)

Откроется [меню редактирования элемента архитектуры](#меню-редактирования-элемента-архитектуры)


- в справочнике 'элементов архитектуры', по [ссылке](https://new.stormbpmn.com/app/team/assets)

![image](edit-element_architecture-2.png)

Откроется [меню редактирования элемента архитектуры](#меню-редактирования-элемента-архитектуры)




## Удаление Элементов архитектуры

Удалить Элемент архитектуры можно только в справочнике ролей, по [ссылке](https://newstormbpmn.com/app/team/assets).

![image](delete-element_architecture-1.png)

:::danger
Если Элемент архитектуры использован в диаграмме, то система не позволит его удалить /n

Тут же можно просмотреть перечень диаграмм в которых он использован. 
![image](list_chart-delete-element_architecture.png)

Отвяжите его перед удалением.
:::




## Кастомные элементы архитектуры

Система позволяет вводить свои типы элементов архитектуры. Типичной практикой является создание своих справочников:
- Метрик
- Функциональных разрывов
- Проектов
- Рисков
- Типа операций
- Оборудования
и т.д.

Это отличный способ описывать те аспекты процессов, которые интересуют именно вашу организацию.


### Создание определений элементов архитектуры

По ссылке [https://new.stormbpmn.com/app/team/assets](https://new.stormbpmn.com/app/team/assets)

![alt text](create-type-element_architecture.png)
 1) Нажмите **Определение элементов**:

 2) Выберите иконку, которая будет использоваться в оверлееях.
 3) Впишите название типа для справочника.
 Код автоматически создаст система - он используется в API и при генерации документов.
 4) Дайте описание: характеристики, для чего предназначен и т.д..
 5) Выберите к чему может быть применим справочник:
 - процесс и задача;
 - процесс;
 - задача.
 6) сохраните внесенные данные


 ### Создание элемента по кастомному справочнику
 Не откличается от создания типового элемента архитектуре. /n
 При выборе типа ЭА, выберите свой кастомный тип:

 ![alt text](custom-ea-3.png)

 ### Использование в практике
 Не отличается от использования типовых ЭА.

--></div></template>


