<template><div><h1 id="кастомные-эа" tabindex="-1"><a class="header-anchor" href="#кастомные-эа"><span>Кастомные ЭА</span></a></h1>
<h1 id="собственные-элементы-архитектуры" tabindex="-1"><a class="header-anchor" href="#собственные-элементы-архитектуры"><span>Собственные элементы архитектуры</span></a></h1>
<h2 id="кастомные-элементы-архитектуры" tabindex="-1"><a class="header-anchor" href="#кастомные-элементы-архитектуры"><span>Кастомные элементы архитектуры</span></a></h2>
<p>Система позволяет вводить свои типы элементов архитектуры. Типичной практикой является создание своих справочников:</p>
<ul>
<li>Метрик</li>
<li>Функциональных разрывов</li>
<li>Проектов</li>
<li>Рисков</li>
<li>Типа операций</li>
<li>Оборудования
и т.д.</li>
</ul>
<p>Это отличный способ описывать те аспекты процессов, которые интересуют именно вашу организацию.</p>
<h3 id="создание-определении-элементов-архитектуры" tabindex="-1"><a class="header-anchor" href="#создание-определении-элементов-архитектуры"><span>Создание определений элементов архитектуры</span></a></h3>
<p>По ссылке <a href="https://new.stormbpmn.com/app/team/assets" target="_blank" rel="noopener noreferrer">https://new.stormbpmn.com/app/team/assets<ExternalLinkIcon/></a></p>
<p><img src="@source/features_new_storm/6) Элементы архитектуры/create-type-element_architecture.png" alt="alt text"></p>
<ol>
<li>
<p>Нажмите <strong>Определение элементов</strong>:</p>
</li>
<li>
<p>Выберите иконку, которая будет использоваться в оверлееях.</p>
</li>
<li>
<p>Впишите название типа для справочника.
Код автоматически создаст система - он используется в API и при генерации документов.</p>
</li>
<li>
<p>Дайте описание: характеристики, для чего предназначен и т.д..</p>
</li>
<li>
<p>Выберите к чему может быть применим справочник:</p>
</li>
</ol>
<ul>
<li>процесс и задача;</li>
<li>процесс;</li>
<li>задача.</li>
</ul>
<ol start="6">
<li>сохраните внесенные данные</li>
</ol>
<h3 id="создание-элемента-по-кастомному-справочнику" tabindex="-1"><a class="header-anchor" href="#создание-элемента-по-кастомному-справочнику"><span>Создание элемента по кастомному справочнику</span></a></h3>
<p>Не откличается от создания типового элемента архитектуре. /n
При выборе типа ЭА, выберите свой кастомный тип:</p>
<p><img src="@source/features_new_storm/6) Элементы архитектуры/custom-ea-3.png" alt="alt text"></p>
<h3 id="использование-в-практике" tabindex="-1"><a class="header-anchor" href="#использование-в-практике"><span>Использование в практике</span></a></h3>
<p>Не отличается от использования типовых ЭА.</p>
</div></template>


