<template><div><h1 id="new-шторм-элементы-архитектуры" tabindex="-1"><a class="header-anchor" href="#new-шторм-элементы-архитектуры"><span>New Шторм. Элементы архитектуры</span></a></h1>
<p>Элементы архитектуры предназначены для указания ресурсов и объектов, используемых для выполнения задачи.</p>
<p>Элементы архитектуры являются обогащённой альтернативой таким элементам BPMN, как объект данных и артефакты.
Они позволяют не перегружать диаграмму, а включение их отображения раскрывает информацию о процессе и улучшает его понимание.</p>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Элементы архитектуры образуют справочник. Созданные Элементы можно использовать в нескольких диаграммах.</p>
</div>
<p>Основные их типы:</p>
<ul>
<li><strong>Система</strong> - программное обеспечение, используемое для выполнения пользовательской или сервисной задачи;</li>
<li><strong>Документ</strong> - артефакт, содержащий контекст бизнес-процесса;</li>
<li><strong>Коммуникация</strong> - отражает способ, канал коммуникации;</li>
<li><strong>Действие</strong> - используют для типизации действий, абстрактных задач и ручных операций.
Дополнительные типы: клиент; сущность; прочее.</li>
</ul>
<div class="hint-container warning">
<p class="hint-container-title">Примечание</p>
<p>На схеме оверлеями отображаются только два основных элемента архитектуры: Система и Документ</p>
</div>
</div></template>


