import comp from "D:/stormbpmn-documentation/src/.vuepress/.temp/pages/features_new_storm/5_elements-architecture/index.html.vue"
const data = JSON.parse("{\"path\":\"/features_new_storm/5_elements-architecture/\",\"title\":\"New Шторм. Элементы архитектуры\",\"lang\":\"ru-RU\",\"frontmatter\":{\"order\":1,\"dir\":{\"text\":\"New Шторм. Элементы архитектуры\",\"order\":5,\"link\":true,\"index\":true}},\"headers\":[{\"level\":2,\"title\":\"Создание элемента архитектуры\",\"slug\":\"создание-элемента-архитектуры\",\"link\":\"#создание-элемента-архитектуры\",\"children\":[{\"level\":3,\"title\":\"С интерфейса процесса в правом меню\",\"slug\":\"с-интерфеиса-процесса-в-правом-меню\",\"link\":\"#с-интерфеиса-процесса-в-правом-меню\",\"children\":[]},{\"level\":3,\"title\":\"меню редактирования элемента архитектуры\",\"slug\":\"меню-редактирования-элемента-архитектуры\",\"link\":\"#меню-редактирования-элемента-архитектуры\",\"children\":[]},{\"level\":3,\"title\":\"С интерфейса процесса в меню подробностей:\",\"slug\":\"с-интерфеиса-процесса-в-меню-подробностеи\",\"link\":\"#с-интерфеиса-процесса-в-меню-подробностеи\",\"children\":[]},{\"level\":3,\"title\":\"В левом меню главной страницы\",\"slug\":\"в-левом-меню-главнои-страницы\",\"link\":\"#в-левом-меню-главнои-страницы\",\"children\":[]},{\"level\":3,\"title\":\"C помощью загрузки из .csv\",\"slug\":\"c-помощью-загрузки-из-csv\",\"link\":\"#c-помощью-загрузки-из-csv\",\"children\":[]},{\"level\":3,\"title\":\"C помощью REST API\",\"slug\":\"c-помощью-rest-api\",\"link\":\"#c-помощью-rest-api\",\"children\":[]}]},{\"level\":2,\"title\":\"Редактирование Элементов архитектуры\",\"slug\":\"редактирование-элементов-архитектуры\",\"link\":\"#редактирование-элементов-архитектуры\",\"children\":[]},{\"level\":2,\"title\":\"Удаление Элементов архитектуры\",\"slug\":\"удаление-элементов-архитектуры\",\"link\":\"#удаление-элементов-архитектуры\",\"children\":[]},{\"level\":2,\"title\":\"Кастомные элементы архитектуры\",\"slug\":\"кастомные-элементы-архитектуры\",\"link\":\"#кастомные-элементы-архитектуры\",\"children\":[{\"level\":3,\"title\":\"Создание определений элементов архитектуры\",\"slug\":\"создание-определении-элементов-архитектуры\",\"link\":\"#создание-определении-элементов-архитектуры\",\"children\":[]},{\"level\":3,\"title\":\"Создание элемента по кастомному справочнику\",\"slug\":\"создание-элемента-по-кастомному-справочнику\",\"link\":\"#создание-элемента-по-кастомному-справочнику\",\"children\":[]},{\"level\":3,\"title\":\"Использование в практике\",\"slug\":\"использование-в-практике\",\"link\":\"#использование-в-практике\",\"children\":[]}]}],\"git\":{},\"readingTime\":{\"minutes\":2.04,\"words\":613},\"filePathRelative\":\"features_new_storm/5_elements-architecture/README.md\"}")
export { comp, data }

if (import.meta.webpackHot) {
  import.meta.webpackHot.accept()
  if (__VUE_HMR_RUNTIME__.updatePageData) {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  }
}

if (import.meta.hot) {
  import.meta.hot.accept(({ data }) => {
    __VUE_HMR_RUNTIME__.updatePageData(data)
  })
}
