<template><div><h1 id="бизнес-процессы-в-bpmn" tabindex="-1"><a class="header-anchor" href="#бизнес-процессы-в-bpmn"><span>Бизнес-процессы в BPMN</span></a></h1>
<p>Наш редактор имеет множество функций и все они направлены на обеспечение удобства работы с BPMN диаграммами.<br>
Рассмотрим подробнее все возможности:
<img src="@source/features/bpmn-modeler.png" alt="image"></p>
<h2 id="описание-всех-меню" tabindex="-1"><a class="header-anchor" href="#описание-всех-меню"><span>Описание всех меню</span></a></h2>
<h3 id="левое-меню" tabindex="-1"><a class="header-anchor" href="#левое-меню"><span>Левое меню</span></a></h3>
<p>Левое меню предназначено для выбора элементов BPMN, управления ими и обеспечения удобства использования редактора.</p>
<div class="hint-container warning">
<p class="hint-container-title">Не все элементы</p>
<p>В левом меню находятся не все разновидности элементов BPMN, но это не значит, что их нет в системе 😃 Различные представления элементов меняются в контекстном меню.</p>
</div>
<p>Советуем обратить внимание на кнопки, обеспечивающие удобство работы:</p>
<p><img src="@source/features/left-menu.gif" alt="image"></p>
<p>Для понимания того, в какие элементы можно превратить значки, нужно разбираться в <RouteLink to="/bpmn/">BPMN</RouteLink>, т.к. сервис старается защитить вас от ошибок и не дать использовать элементы, которые невозможны по нотации.</p>
<h3 id="меню-сохранения" tabindex="-1"><a class="header-anchor" href="#меню-сохранения"><span>Меню сохранения</span></a></h3>
<h4 id="сохранение-диаграммы" tabindex="-1"><a class="header-anchor" href="#сохранение-диаграммы"><span>Сохранение диаграммы</span></a></h4>
<p>В этом меню вы можете:</p>
<ul>
<li>Указать название диаграммы</li>
<li>Указать <a href="#%D0%BF%D0%B0%D0%BF%D0%BA%D0%B8">папку</a></li>
<li>Добавить <a href="#%D1%82%D0%B5%D0%B3%D0%B8">теги</a></li>
<li>Указать тип-процесса (AS-IS / TO-BE) и связать со вторым процессом для <a href="#%D1%81%D1%80%D0%B0%D0%B2%D0%BD%D0%B5%D0%BD%D0%B8%D0%B5-as-is-%D0%B8-to-be">сравнения</a></li>
<li>Указать комментарий к текущей версии</li>
<li>Оценить [качество] вашей диаграммы</li>
</ul>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>При сохранении создаётся <a href="#%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D0%BE%D0%BD%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">версия</a>, к которой можно откатиться или выполнить сравнение</p>
</div>
<p>В этом же меню можно сохранить <strong>чужую диаграмму</strong>, к которой вы не имеете доступа на редактирование, в свои диаграммы.</p>
<p><img src="@source/features/save-menu.png" alt="image"></p>
<h4 id="скачать-экспорт-png-bpmn-docx" tabindex="-1"><a class="header-anchor" href="#скачать-экспорт-png-bpmn-docx"><span>Скачать (экспорт PNG, BPMN, .DOCX)</span></a></h4>
<p>В этом меню можно скачать диаграмму в нужном формате, включая <a href="#%D1%80%D0%B5%D0%B3%D0%BB%D0%B0%D0%BC%D0%B5%D0%BD%D1%82%D1%8B">.docx</a><br>
<img src="@source/features/download-menu.png" alt="image"></p>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Скачивание картинки с <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%BE%D0%B2%D0%B5%D1%80%D0%BB%D0%B5%D0%B5%D0%B2">оверлеями</a> доступно по другой кнопке</p>
</div>
<h4 id="поделиться-диаграммои" tabindex="-1"><a class="header-anchor" href="#поделиться-диаграммои"><span>Поделиться диаграммой</span></a></h4>
<p>В этом меню можно предоставить/отозвать доступ на диаграмму:</p>
<ul>
<li>Анонимно (не требует учетной записи в системе)</li>
<li>Конкретному человеку по e-mail с указанием прав (просматривать/редактировать)</li>
<li>Получить код для встраивания диаграммы, она будет выглядеть вот так:</li>
</ul>
<iframe src="https://stormbpmn.com/app/diagram/0855ae10-6ef8-4a23-9df0-f7d6cef12722?embedded=true" style="border:1px #f2f2f2 none;" name="extAdmin" scrolling="yes" frameborder="1"  height="500" width="100%" allowfullscreen></iframe>
<p><img src="@source/features/share-diagram.png" alt="image"></p>
<p>Больше о <RouteLink to="/team-work/">совместной работе</RouteLink></p>
<h4 id="сменить-статус" tabindex="-1"><a class="header-anchor" href="#сменить-статус"><span>Сменить статус</span></a></h4>
<p>Для информирования коллег о состоянии работы над процессом можно использовать статусы:</p>
<ul>
<li><strong>Новый</strong> - процесс ещё не трогали, просто создали</li>
<li><strong>В работе</strong> - над процессом активно идёт работа</li>
<li><strong>На согласовании</strong> - процесс согласуется с кем-то, менять схему <strong>нельзя</strong>. Подробнее в <a href="#%D1%81%D0%BE%D0%B3%D0%BB%D0%B0%D1%81%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">согласованиях</a></li>
<li><strong>Готов</strong> - процесс готов к работе, менять схему нельзя</li>
<li><strong>Архив</strong> - процесс в архиве
<img src="@source/features/change-status.png" alt="image"></li>
</ul>
<div class="hint-container warning">
<p class="hint-container-title">Примечание</p>
<p>Сейчас менять или добавлять статусы нельзя.</p>
</div>
<h4 id="as-is-и-to-be" tabindex="-1"><a class="header-anchor" href="#as-is-и-to-be"><span>AS-IS и TO-BE</span></a></h4>
<p>Если в <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D1%81%D0%BE%D1%85%D1%80%D0%B0%D0%BD%D0%B5%D0%BD%D0%B8%D1%8F">меню сохранения</a> вы указали тип процесса и связанный процесс, то появится возможность быстро перемещаться между версиями AS-IS и TO-BE, а также визуально сравнить их.
<img src="@source/features/as-is-to-be.png" alt="image"></p>
<h3 id="верхнее-меню" tabindex="-1"><a class="header-anchor" href="#верхнее-меню"><span>Верхнее меню</span></a></h3>
<p>Верхнее меню предназначено для работы с конкретной диаграммой и предоставляет возможности:<br>
<img src="@source/features/up-menu-2.png" alt="image"></p>
<ol start="0">
<li>Включить симулятор токена.</li>
<li>Развернуть диаграмму на полный экран.</li>
<li>Открыть панель свойств BPMN/свойств Camunda.</li>
<li>Включить <a href="#%D0%BE%D1%86%D0%B5%D0%BD%D0%BA%D0%B0-%D0%BA%D0%B0%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%B0">проверку ошибок</a>.</li>
<li>Отключить проверку ошибок.</li>
<li>Отменить последнее дейсвтие.</li>
<li>Повторить последнее действие.</li>
<li>Приблизить.</li>
<li>Отдалить.</li>
<li>Включить или выключить миникарту.</li>
<li>Сменить цвет выбранным элементам.</li>
<li>Скопировать выделенные элементы для вставки между вкладками.</li>
<li>Вставить выделенные элементы из другой вкладки.</li>
<li>Включить автонумерацию элементов.</li>
<li>Отключить автонумерацию элементов.</li>
<li>Открыть встроенную справку по <RouteLink to="/bpmn/">BPMN</RouteLink> и горячими клавишам.</li>
<li>Скачать диаграмму с оверлеями.</li>
</ol>
<h3 id="контекстное-меню" tabindex="-1"><a class="header-anchor" href="#контекстное-меню"><span>Контекстное меню</span></a></h3>
<p>Контекстное меню открывается при клике на элемент и предоставляет следующие возможности в зависимости от того, на какой элемент вы кликнули:<br>
<img src="@source/features/context-menu-1.png" alt="image"></p>
<ol>
<li>Смена типа элемента.</li>
<li>Открытие меню для управления <a href="#%D1%80%D0%BE%D0%BB%D0%B8">ролями</a> и <a href="#%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">элементами архитектуры</a>.</li>
<li>Удаление элемента.</li>
<li>Текстовая аннотация к элементу.</li>
<li>Изменение атрибутов текущего элемента.</li>
<li>Соеденение текущего элементв с другим.</li>
<li>Открытие <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%BF%D0%BE%D0%B4%D1%80%D0%BE%D0%B1%D0%BD%D0%BE%D1%81%D1%82%D0%B5%D0%B8-%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D0%B0">подробностей элемента</a>.</li>
</ol>
<h3 id="меню-подробностеи-элемента" tabindex="-1"><a class="header-anchor" href="#меню-подробностеи-элемента"><span>Меню подробностей элемента</span></a></h3>
<p>В этом меню предоставляется возможность указывать всю ключевую информацию об элементе:</p>
<ul>
<li>Название</li>
<li><a href="#%D1%80%D0%BE%D0%BB%D0%B8">Роль</a> (<em>только для задач</em>)</li>
<li><a href="#%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">Элементы архитектуры</a> (<em>только для задач</em>)</li>
<li><a href="#%D1%81%D0%B2%D1%8F%D0%B7%D1%8C-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%BE%D0%B2">Связанный процесс</a> (<em>только для Call Activity или Participant</em>)</li>
<li><a href="#%D1%80%D0%B0%D1%81%D1%87%D0%B5%D1%82-%D0%B4%D0%BB%D0%B8%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%D1%81%D1%82%D0%B8-%D1%81%D1%86%D0%B5%D0%BD%D0%B0%D1%80%D0%B8%D0%B5%D0%B9">Плановую длительность</a></li>
<li>Описание</li>
<li><a href="#%D1%81%D0%B2%D1%8F%D0%B7%D1%8C-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%BE%D0%B2">Элемент отправки сообщения</a>  (<em>только для Catch Event</em>)</li>
<li>Внешняя ссылка (<em>отображается на схеме</em>)</li>
</ul>
<p><img src="@source/features/context-menu-2.png" alt="image">
Также это меню позволяет:</p>
<ul>
<li>Просматривать версии описания</li>
<li>Скопировать прямую ссылку на элемент</li>
<li>Просмотреть комментарии к элементу</li>
</ul>
<h3 id="меню-оверлеев" tabindex="-1"><a class="header-anchor" href="#меню-оверлеев"><span>Меню оверлеев</span></a></h3>
<p><img src="@source/features/overlays-2.png" alt="image"></p>
<p>Одним из ключевых удобств системы является возможность быстро и удобно включать и выключать отображение информации на диаграмме.
Меню оверлеев предоставляет возможность включать отображение:</p>
<ul>
<li>Плановой длительности</li>
<li>Ролей</li>
<li>Должностей (<em>первой должности в <a href="#%D1%80%D0%B5%D0%B4%D0%B0%D0%BA%D1%82%D0%BE%D1%80-%D0%BE%D1%80%D0%B3%D1%81%D1%82%D1%80%D1%83%D0%BA%D1%82%D1%83%D1%80%D1%8B">оргструктуре</a>, назначенной на роль</em> )</li>
<li>Систем (один из типов <a href="#%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">элементов архитектуры</a>)</li>
<li>Документов (один из типов <a href="#%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">элементов архитектуры</a>)</li>
<li><a href="#%D1%81%D0%B2%D1%8F%D0%B7%D0%B8-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%B0">Связей</a></li>
<li><a href="#%D0%BA%D0%BE%D0%BC%D0%BC%D0%B5%D0%BD%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">Комментариев</a></li>
<li>Описание задач</li>
<li>Кастомных <a href="#%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B-%D0%B0%D1%80%D1%85%D0%B8%D1%82%D0%B5%D0%BA%D1%82%D1%83%D1%80%D1%8B">элементов архитектуры</a></li>
</ul>
<p>Кроме того, это меню позволяет скачать в виде .PNG или .SVG диаграмму с включенными овереляеми.<br>
<img src="@source/features/overlays-3.png" alt="image"></p>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Включенные оверлеи автоматически вставляются в ссылку, которой вы делитесь с коллегами! Заказчикам ничего дополнительного нажимать не надо.</p>
</div>
<h3 id="меню-представлении" tabindex="-1"><a class="header-anchor" href="#меню-представлении"><span>Меню представлений</span></a></h3>
<p>Описание процесса в системе можно посмотреть сразу в нескольких представлениях, в зависимости от ваших задач.</p>
<ul>
<li><strong>В виде схемы BPMN</strong> - подходит для анализа последовательности процесса</li>
<li><strong>В виде таблицы</strong> - подходит для уточнения задач, исполнителей, используемых систем и документов</li>
<li><strong>В виде регламента</strong> - подходит для последовательного изучения всей информации о процессе</li>
</ul>
<h4 id="табличное-представление" tabindex="-1"><a class="header-anchor" href="#табличное-представление"><span>Табличное представление</span></a></h4>
<p>Табличное представление выводит информацию о:</p>
<ul>
<li>Названии задачи</li>
<li>Пуле, в котором расположена задача</li>
<li>Роль, исполняющая задачу</li>
<li>Должности, привязанные к роли</li>
<li>Системы, используемые в задаче</li>
<li>Документы, используемые в задаче</li>
<li>Описание задачи</li>
</ul>
<p>Также это представление даёт возможность скачать таблицу в .xls и осуществить поиск по содержимому. Например, если написать <strong>кладовщик</strong>, то система выдаст только те задачи, где упоминается это слово в любом из столбцов.<br>
<img src="@source/features/table-view-1.png" alt="image"></p>
<h4 id="представление-в-виде-регламента" tabindex="-1"><a class="header-anchor" href="#представление-в-виде-регламента"><span>Представление в виде регламента</span></a></h4>
<p>Это представление позволяет просмотреть на процесс последовательно, со всех сторон и предоставляет возможности:</p>
<ol>
<li>Просмотреть и ввести общее описание.
<img src="@source/features/reglament-view-1.png" alt="image"></li>
<li>Указать состав рабочей группы: владельцев, спонсоров и т.д.</li>
<li>Посмотреть на схему.</li>
<li>Посмотреть и отредактировать описание задач в разрезе ролей
<img src="@source/features/reglament-view-2.png" alt="image"></li>
<li>Историю согласований.</li>
<li>Связь процессов, потребителей и поставщиков процесса.</li>
<li>Используемые элементы архитектуры.</li>
<li>Карту архитектуры относительно процесса.</li>
<li>Все комментарии процесса.</li>
</ol>
<h3 id="правое-меню" tabindex="-1"><a class="header-anchor" href="#правое-меню"><span>Правое меню</span></a></h3>
<p>Правое меню отображает дополнительную информацию к диаграмме в зависимости от выбранного отображения.<br>
<img src="@source/features/right-menu-1.png" alt="image"></p>
<p><img src="@source/features/right-menu-2.png" alt="image"></p>
<ol>
<li>Включить отображение всех элементов архитектуры и ролей.</li>
<li>Включить отображение <a href="#%D0%B4%D0%B5%D1%82%D0%B0%D0%BB%D0%B8-%D0%BF%D0%BE-%D0%BA%D0%BB%D0%B8%D0%BA%D1%83">деталей задачи по клику</a> (пока в отпуске кнопка).</li>
<li>Сравнить текущую <a href="#%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D0%BE%D0%BD%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5">версию</a> с предыдущими</li>
<li>Включить отображение всех элементов архитектуры. (пока в отпуске)</li>
<li>Включить отображение связей процесса.</li>
<li>Включить комментарии.</li>
</ol>
<h3 id="детали-по-клику-правои-кнопкои" tabindex="-1"><a class="header-anchor" href="#детали-по-клику-правои-кнопкои"><span>Детали по клику правой кнопкой</span></a></h3>
<p><img src="@source/features/context-detail-menu.png" alt="image">
По нажатию правой кнопкой на любую задачу открывается правое контекстное меню, в котором можно управлять ролями и элементами архитектуры, а так же читать и оставлять комментарии.</p>
<h3 id="детали-по-клику-кнопка-в-отпуске" tabindex="-1"><a class="header-anchor" href="#детали-по-клику-кнопка-в-отпуске"><span>Детали по клику (кнопка в отпуске)</span></a></h3>
<p>После включения соответствующей настройки в правом меню появляется возможность:</p>
<ul>
<li>Поделиться ссылкой на конкретный элемент</li>
<li>Найти выбранный элемент на схеме</li>
<li>Установить <a href="#%D1%81%D0%B2%D1%8F%D0%B7%D1%8C-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D1%81%D1%81%D0%BE%D0%B2">связь</a> с Call Activity</li>
<li>Установить роль</li>
<li>Установить элементы архитектуры</li>
<li>Прочитать описание выбранной задачи</li>
<li>Просмотреть и написать комментарий к выбранной задаче</li>
</ul>
<p><img src="@source/features/click-details.png" alt="image"></p>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>В этом представлении отображается схема выбранного Call Activity! Это удобный способ просматривать их содержимое с той же диаграммы, на которой оно используется.</p>
</div>
<h2 id="обеспечение-удобства-работы" tabindex="-1"><a class="header-anchor" href="#обеспечение-удобства-работы"><span>Обеспечение удобства работы</span></a></h2>
<h3 id="горячие-клавиши" tabindex="-1"><a class="header-anchor" href="#горячие-клавиши"><span>Горячие клавиши</span></a></h3>
<p>Редактор поддерживает работу с горячими клавишами, что сильно ускоряет работу при моделировании процессов:</p>
<ul>
<li><strong>ctrl + z</strong> отменить последнее действие</li>
<li><strong>ctrl + y</strong> - вернуть отмененное действие</li>
<li><strong>ctrl + a</strong> - выделить всё</li>
<li><strong>ctrl + scroll</strong> - изменение масштаба</li>
<li><strong>scroll</strong> - перемещение по вертикали</li>
<li><strong>shift + scroll</strong> - перемещение по горизонтали</li>
<li><strong>shift + click</strong> - выбрать элементы группой</li>
<li><strong>ctrl + click</strong> - выделять элементы по одному в группу</li>
<li><strong>alt + 1...8</strong> - включить отображение соответствующих оверлеев</li>
<li><strong>ctrl+f</strong> - открыть меню поиска элементов</li>
</ul>
<h2 id="качество-бизнес-процессов-bpmn" tabindex="-1"><a class="header-anchor" href="#качество-бизнес-процессов-bpmn"><span>Качество бизнес-процессов BPMN</span></a></h2>
<p>Система предоставляет мощные средства для управления качеством ваших диаграмм в BPMN, создаваемых по вашему соглашению о моделировании.</p>
<p>Качественные диаграммы гарантируют минимальное время на обсуждение формальных признаков описания и позволяют сразу переходить к сути.</p>
<h3 id="оценка" tabindex="-1"><a class="header-anchor" href="#оценка"><span>Оценка</span></a></h3>
<p>Система предоставляет ~30 правил проверки BPMN, которые система проверяет автоматически при каждом сохранении.<br>
Выявленные ошибки бывают трех типов:</p>
<ul>
<li><strong>Информационная ошибка</strong> - можно моделировать лучше</li>
<li><strong>Предупреждение</strong> - лучше поправить</li>
<li><strong>Фатальная ошибка</strong> - серьёзное нарушение BPMN, лучше не показывать такие диаграммы коллегам</li>
</ul>
<p>Включение и выключение проверки осуществляется в <a href="#%D0%B2%D0%B5%D1%80%D1%85%D0%BD%D0%B5%D0%B5-%D0%BC%D0%B5%D0%BD%D1%8E">верхнем меню</a>.</p>
<p><img src="@source/features/error-check-1.png" alt="image"></p>
<h4 id="ошибки-для-camunda" tabindex="-1"><a class="header-anchor" href="#ошибки-для-camunda"><span>Ошибки для Camunda</span></a></h4>
<p>Это функция позволяет проверить атрибуты автоматизации Camunda 7, задаваемые в процессе, и сразу найти те ошибки, на которые Camunda 7 укажет вам при попытке загрузить ваш XML на сервер.</p>
<h4 id="настроика-правил-проверки" tabindex="-1"><a class="header-anchor" href="#настроика-правил-проверки"><span>Настройка правил проверки</span></a></h4>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Данная функция работает только на тарифе TEAM и выше.</p>
</div>
<p>Вы так же можете настроить трактовку каждого из правил уникальным образом для своей команды, а также:</p>
<ul>
<li>Настроить минимальную среднюю оценку, которую требует ваша команда. При нарушении этого показателя члены команды постоянно будут видеть уведомление о низком качестве процессов.</li>
<li>Указать минимальный процент указания (задействования) систем, ролей, документов на схеме.</li>
<li>Исключить часть действий на левой панели, <em>например, запретить создавать хранилище данных</em>.</li>
<li>Задать используемость, заголовок, описание, важность, дополнительную ссылку для каждого из правил.<br>
<img src="@source/features/error-check-2.png" alt="image"></li>
</ul>
<p>Настраивается в разделе <RouteLink to="/team-work/#%D0%BF%D1%80%D0%BE%D1%87%D0%B8%D0%B5-%D0%BD%D0%B0%D1%81%D1%82%D1%80%D0%BE%D0%B8%D0%BA%D0%B8-%D0%BA%D0%BE%D0%BC%D0%B0%D0%BD%D0%B4%D1%8B">команды</RouteLink>.</p>
<h3 id="симуляция-токена" tabindex="-1"><a class="header-anchor" href="#симуляция-токена"><span>Симуляция токена</span></a></h3>
<p>Вы так же можете выполнить проверку проходимости процесса <strong>токеном</strong>. Посмотрите это видео, если не знаете, что это такое:</p>
<iframe width="560" height="315" src="https://www.youtube.com/embed/Gfx5atU3YDY?si=ARC0B7o3i9K1DCey" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
<div class="hint-container caution">
<p class="hint-container-title">Предупреждение</p>
<p>Симуляция токена поддерживает не все элементы. Вы получите соответсвующее уведомление <strong>Not supported</strong>, если воспользуетесь таким элементом. Замените его. Симуляция токена работает только, если у вас есть права на редактирование диаграммы. А редактирование отключается у любой диаграммы, если её статус на согласовании\готова.</p>
</div>
<p>Для включения симуляции токена нажмите кнопку, приблизьтесь к любому стартовому событию и нажмите на символ Play. Используйте переключатель на шлюзах, чтобы вести Token по выбранному направлению:<br>
<img src="@source/features/error-check-3.png" alt="image"></p>
<h3 id="расчет-длительности-сценария" tabindex="-1"><a class="header-anchor" href="#расчет-длительности-сценария"><span>Расчет длительности сценария</span></a></h3>
<p>Если вы указывали <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%BF%D0%BE%D0%B4%D1%80%D0%BE%D0%B1%D0%BD%D0%BE%D1%81%D1%82%D0%B5%D0%B8-%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D0%B0">длительность в задачах</a>, то система может посчитать время, за которое выполнится конкретный проход токена при симуляции токена, указав самые длительные операции:
<img src="@source/features/error-check-4.png" alt="image"></p>
<h2 id="версионирование" tabindex="-1"><a class="header-anchor" href="#версионирование"><span>Версионирование</span></a></h2>
<p>Система автоматически создает версии диаграмм вот по таким поводам:</p>
<ul>
<li>Прошло больше 30 изменений диаграммы</li>
<li>Кто-то (не владелец процесса и не пред.автор изменения) внёс изменения в диаграмму</li>
</ul>
<p>Это позволяет <strong>всегда</strong> восстановить пред.версию и посмотреть разницу. Автор диаграммы получает e-mail уведомление, если в его диаграмме создали новую версию.
Также система сохраняет версии описания задач.</p>
<h3 id="как-вернуть-версию-процесса" tabindex="-1"><a class="header-anchor" href="#как-вернуть-версию-процесса"><span>Как вернуть версию процесса</span></a></h3>
<ol>
<li>Если вы хотите вернуть версию процесса, то найдите на главной странице карточку процесса и нажмите в верхний правый угол, выберите &quot;Все версии&quot;:
<img src="@source/features/restore-versions-1.png" alt="image"></li>
<li>Выберете интересующую версию и нажмите <strong>посмотреть версию</strong>.</li>
<li>В открывшемся окне нажмите <strong>&quot;установить как текущую&quot;</strong>.</li>
</ol>
<h3 id="сравнение-версии" tabindex="-1"><a class="header-anchor" href="#сравнение-версии"><span>Сравнение версий</span></a></h3>
<p>Сравнение версий доступно в двух вариантах:</p>
<ol>
<li><strong>Вычисление изменений текущей версии относительно старой</strong> - включается через <a href="#%D0%BF%D1%80%D0%B0%D0%B2%D0%BE%D0%B5-%D0%BC%D0%B5%D0%BD%D1%8E">правое меню</a>:
<img src="@source/features/version-compare-1.png" alt="image"></li>
<li><strong>Просто сравнение со старой версией</strong> - включается через меню и нажатие кнопки <strong>сравнить</strong>:
<img src="@source/features/restore-versions-1.png" alt="image"></li>
</ol>
<h2 id="согласование" tabindex="-1"><a class="header-anchor" href="#согласование"><span>Согласование</span></a></h2>
<p>Система позволяет <strong>согласовывать процессы</strong> с любыми пользователями системы - т.е. получить и зафиксировать мнение человека о вашем процессе.</p>
<div class="hint-container important">
<p class="hint-container-title">Важно</p>
<p>Согласующему необязательно быть участником команды, вы можете отправить согласование на любой e-mail - человек получит соответствующее уведомление. <strong>Согласования бесплатны.</strong></p>
</div>
<h3 id="просмотр-согласовании" tabindex="-1"><a class="header-anchor" href="#просмотр-согласовании"><span>Просмотр согласований</span></a></h3>
<p>Для просмотра согласований на главной странице есть соответствующий раздел:<br>
<img src="@source/features/appruval-4.png" alt="imaget"></p>
<h3 id="отправка-на-согласование" tabindex="-1"><a class="header-anchor" href="#отправка-на-согласование"><span>Отправка на согласование</span></a></h3>
<p>Для отправки процесса на согласование смените ему статус на <strong>на согласовании</strong> и укажите e-mail согласующих, нажмите <strong>отправить на согласование</strong>:<br>
<img src="@source/features/appruval-1.png" alt="imaget"></p>
<p>После этого диаграмму нельзя будет редактировать или менять статус, пока ВСЕ запрошенные согласования не будут получены.</p>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Советуем снабдить ваше первое согласование вот <a href="https://www.youtube.com/watch?v=tKGegGh15oc&amp;ab_channel=BPMN2ru" target="_blank" rel="noopener noreferrer">такой ссылкой<ExternalLinkIcon/></a>, людям будет сильно проще разобраться в системе и они быстрее отожмут все кнопки.</p>
<iframe width="560" height="315" src="https://www.youtube.com/embed/tKGegGh15oc?si=pam4af5M82dYhPKw" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>
</div>
<h3 id="выполнение-согласования" tabindex="-1"><a class="header-anchor" href="#выполнение-согласования"><span>Выполнение согласования</span></a></h3>
<p>После получения ссылки и авторизации в системе, согласующий увидет такое меню и сможет поделиться своим мнением:</p>
<p><img src="@source/features/appruval-2.png" alt="imaget"></p>
<p>Во вкладке <strong>комментарии</strong> согласующий сможет оставить комментарии. Для оставления комментария к конкретному элементу достаточно на него нажать.</p>
<p><img src="@source/features/appruval-3.png" alt="imaget"></p>
<div class="hint-container warning">
<p class="hint-container-title">Примечание</p>
<p>По-умолчанию отображаются согласования только по последней версии. Нажмите &quot;Посмотреть историю&quot;, если хотите посмотреть предыдущие согласования.</p>
</div>
<h3 id="удаление-согласования" tabindex="-1"><a class="header-anchor" href="#удаление-согласования"><span>Удаление согласования</span></a></h3>
<p>Если согласование перестало быть актуальным, то автор согласования может удалить запрошенное согласование, пока по нему ещЁ не высказались. Для этого нажмите на <strong>мусорную корзину</strong> в левом нижем углу.</p>
<h2 id="импорт-процессов-из-других-системы" tabindex="-1"><a class="header-anchor" href="#импорт-процессов-из-других-системы"><span>Импорт процессов из других системы</span></a></h2>
<p>Система поддерживает полноценный BPMN - это значит, что если система-источник производит XML-файл в спецификации BPMN, то Stormbpmn сможет его загрузить.</p>
<p>Загрузить можно диаграммы из <mark>Cawemo, Camunda Modeler, Bizagi Modeler</mark> и так далее.</p>
<p>Загрузить диаграммы из <mark>Visio, Draw.io, Miro</mark> <strong>нельзя</strong>.</p>
<p>Для загрузки нажмите  кнопку:<br>
<img src="@source/features/bpmn-import-1.png" alt="imaget"></p>
<p>Для импорта в конкретную папку нажмите:<br>
<img src="@source/features/bpmn-import-2.png" alt="imaget"></p>
<h2 id="сравнение-as-is-и-to-be" tabindex="-1"><a class="header-anchor" href="#сравнение-as-is-и-to-be"><span>Сравнение AS-IS и TO-BE</span></a></h2>
<p>Одна из удобных возможностей - это визуально сравнить 2 диаграммы, для того чтобы представить визуальную разницу между версиями AS-IS и TO-BE.</p>
<p><img src="@source/features/as-is-to-be-1.png" alt="imaget"></p>
<h3 id="установление-связи-между-двумя-моделями" tabindex="-1"><a class="header-anchor" href="#установление-связи-между-двумя-моделями"><span>Установление связи между двумя моделями</span></a></h3>
<p>Для установления связи в <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D1%81%D0%BE%D1%85%D1%80%D0%B0%D0%BD%D0%B5%D0%BD%D0%B8%D1%8F">меню сохранения</a> установить тип процесса и связанный процесс:<br>
<img src="@source/features/as-is-to-be-2.png" alt="imaget"></p>
<div class="hint-container tip">
<p class="hint-container-title">Совет</p>
<p>Советуем для начала хорошенько проработать модель AS-IS, тогда её можно будет дублировать и на базе дубля сделать TO-BE. Также это сделает возможным автоматическое сравнение схем (когда оно будет готово).</p>
</div>
<h2 id="связь-процессов" tabindex="-1"><a class="header-anchor" href="#связь-процессов"><span>Связь процессов</span></a></h2>
<p>Бизнес-процессы редко работают в одиночку. В целях декомпозиции и управляемости их часто разделяют на разные процессы, которые даже могут описываться разными людьми, департаментами, компаниями.</p>
<p>Система поддерживает возможность связи процессов друг с другом с целью удобной навигации и построения графов связности.</p>
<p>Просматривать связи можно через <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%BE%D0%B2%D0%B5%D1%80%D0%BB%D0%B5%D0%B5%D0%B2">меню оверлеев</a> или <a href="#%D0%BF%D1%80%D0%B0%D0%B2%D0%BE%D0%B5-%D0%BC%D0%B5%D0%BD%D1%8E">правое меню</a>.</p>
<h3 id="связь-через-call-activity-и-participant" tabindex="-1"><a class="header-anchor" href="#связь-через-call-activity-и-participant"><span>Связь через Call activity и Participant</span></a></h3>
<p>Для установления связи через Call activity\Participant откройте <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%BF%D0%BE%D0%B4%D1%80%D0%BE%D0%B1%D0%BD%D0%BE%D1%81%D1%82%D0%B5%D0%B9-%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D0%B0">меню подробностей</a> и укажите соотвествующий связанный бизнес-процесс:<br>
<img src="@source/features/links-1.png" alt="imaget"></p>
<h3 id="связь-через-message-catch-events-message-catch-task" tabindex="-1"><a class="header-anchor" href="#связь-через-message-catch-events-message-catch-task"><span>Связь через Message Catch Events \ Message Catch Task</span></a></h3>
<p>Для установления такой связи откройте <a href="#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%BF%D0%BE%D0%B4%D1%80%D0%BE%D0%B1%D0%BD%D0%BE%D1%81%D1%82%D0%B5%D0%B9-%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D0%B0">меню подробностей</a> и укажите соответствующий связанный элемент отправки сообщения:<br>
<img src="@source/features/links-2.png" alt="imaget"></p>
<h3 id="декомпозиция-через-subprocess" tabindex="-1"><a class="header-anchor" href="#декомпозиция-через-subprocess"><span>Декомпозиция через Subprocess</span></a></h3>
<p>Еще один вариант декомпозиции - использование Subprocess. В этом случае вы получаете возможность на одном листе проваливаться в подпроцессы.</p>
<h4 id="как-использовать-subprocess" tabindex="-1"><a class="header-anchor" href="#как-использовать-subprocess"><span>Как использовать Subprocess</span></a></h4>
<ol>
<li>Укажите тип подпроцесса.</li>
<li>Нажмите на значок стрелки:<br>
<img src="@source/features/links-3.png" alt="imaget"></li>
<li>Вернитесь на уровень выше при необходимости:<br>
<img src="@source/features/links-4.png" alt="imaget"></li>
</ol>
<div class="hint-container warning">
<p class="hint-container-title">Примечание</p>
<p>По нотации BPMN Subrocess является непосредственной частью текущей схемы, поэтому переиспользовать его в других диаграммах (или даже в этой 2 раза) нельзя. Это не ярлык, а средство декомпозии. Такие связи не будут участвовать в графе связности.</p>
</div>
</div></template>


