<template><div><h1 id="папки-и-теги" tabindex="-1"><a class="header-anchor" href="#папки-и-теги"><span>Папки и теги</span></a></h1>
<p>Папки и тэги - предназначены для организации хранения диаграмм бизнес-процессов и их структурирования по общему признаку.
Таким признаком может быть принадлежность к направлению деятельности, продукту, функции, подразделению компании, владельцу процесса и т.п.
Что является таким признаком Вы определяете сами, исходя из своих целей.
Папки и тэги помогают группировать связанные диаграммы процессов под &quot;общим флагом&quot;. Это облегчает их поиск, управление ими.
И особенно полезно при работе с большим количеством схем и сложной связанностью между ними.</p>
<div class="hint-container warning">
<p class="hint-container-title">Примечание</p>
<p>Папки  - это часть платной подписки TEAM или Enterprise. Без подписки их использование невозможно.</p>
</div>
<h2 id="создание-новои-папки-тэга" tabindex="-1"><a class="header-anchor" href="#создание-новои-папки-тэга"><span>Создание новой папки, тэга</span></a></h2>
<p>Создать новую папку, тэг можно при сохранении диаграммы <RouteLink to="/features/1_bpmn-editor.html#%D0%BC%D0%B5%D0%BD%D1%8E-%D1%81%D0%BE%D1%85%D1%80%D0%B0%D0%BD%D0%B5%D0%BD%D0%B8%D1%8F">меню сохранения диаграммы</RouteLink> или в меню управления папками</p>
<p><img src="@source/features/create-folder-tag-1.png" alt="image"></p>
<h2 id="управление-папками" tabindex="-1"><a class="header-anchor" href="#управление-папками"><span>Управление папками</span></a></h2>
<p>В меню управление папками доступны действия:</p>
<ol>
<li>с папками:
- создавать новые и вложенные в них;
- удалить, переименовать;
- переместить на самый верхний уровень;
- поделиться содержимым;</li>
<li>с диаграммами:
- создать новую или загрузив её из файла *.bpmn (xml)
- удалить;
- переместить в другую папку;
- сделать диаграмму невидимой для команды;
- вызвать меню управления диаграммой и из него дублировать, поделиться или просмотреть версии диаграммы.</li>
</ol>
<p><img src="@source/features/folders-menu.png" alt="image"></p>
<h2 id="использование-тэгов" tabindex="-1"><a class="header-anchor" href="#использование-тэгов"><span>Использование тэгов</span></a></h2>
<p>Тэги позволяют быстро отфильтровать, найти диаграммы, которым присвоен этот тэг.</p>
<p><img src="@source/features/using-tags.png" alt="image"></p>
<p>Одной диаграмме можно присваивать несколько тэгов.
Это позволяет гибко структурировать информацию - одна диаграмма может относиться сразу к нескольким группам, каждая из которых задана своим тэгом</p>
<p><img src="@source/features/multiple-tags.png" alt="image"></p>
</div></template>


