<template><div><h1 id="комментарии" tabindex="-1"><a class="header-anchor" href="#комментарии"><span>Комментарии</span></a></h1>
<p>Комментарии - это отличный способ для экономии вашего времени и обсуждения процессов, как в рабочем режиме, так и в режиме согласования. Время экономится за счет того, что не нужно собирать бесконечные встречи, люди делятся своим мнением асинхронно, по возможности.</p>
<h2 id="как-оставлять-комментарии" tabindex="-1"><a class="header-anchor" href="#как-оставлять-комментарии"><span>Как оставлять комментарий</span></a></h2>
<p>Оставлять комментарии можно как ко всей диаграмме, так и к ее элементам.</p>
<p>1 вариант - использовать <RouteLink to="/features/1_bpmn-editor.html#%D0%BF%D1%80%D0%B0%D0%B2%D0%BE%D0%B5-%D0%BC%D0%B5%D0%BD%D1%8E">правое меню</RouteLink>. Так оставится комментарий ко всей диаграмме:</p>
<p><img src="@source/features/comments-3.png" alt="image"></p>
<p>2 вариант - использовать контекстное меню:</p>
<p><img src="@source/features/comments-2.png" alt="image"></p>
<h2 id="как-посмотреть-комментарии" tabindex="-1"><a class="header-anchor" href="#как-посмотреть-комментарии"><span>Как посмотреть комментарий</span></a></h2>
<p>По-умолчанию комментарии выключены и никак не отображаются на схеме. Вы можете включить их с помощью <RouteLink to="/features/1_bpmn-editor.html#%D0%BC%D0%B5%D0%BD%D1%8E-%D0%BE%D0%B2%D0%B5%D1%80%D0%BB%D0%B5%D0%B5%D0%B2">оверлея</RouteLink>.</p>
<p><img src="@source/features/comments-1.png" alt="image"></p>
<p>Еще вариант - нажать на символ в контекстом меню:<br>
<img src="@source/features/comments-2.png" alt="image"></p>
<p>Третий вариант (покажет все комментарии) - использовать <RouteLink to="/features/1_bpmn-editor.html#%D0%BF%D1%80%D0%B0%D0%B2%D0%BE%D0%B5-%D0%BC%D0%B5%D0%BD%D1%8E">правое меню</RouteLink>:</p>
<p><img src="@source/features/comments-3.png" alt="image"></p>
<h2 id="важность-и-другие-кнопки" tabindex="-1"><a class="header-anchor" href="#важность-и-другие-кнопки"><span>Важность и другие кнопки</span></a></h2>
<p>Карточка комментария имеет полезные функции:<br>
<img src="@source/features/comments-4.png" alt="image"></p>
<ol>
<li>Покажет элемент, в которому оставлен комментарий, на диаграмме.</li>
<li>Пометит комментарий как &quot;выполненный&quot;, он будет занимать меньше места.</li>
<li>Позволяет ответить на комментарий.</li>
<li>Позволяет удалить комментарий.</li>
<li>Позволяет пометить комментарий как &quot;важный&quot;, он ярче отображается в списке и попадает в меню <RouteLink to="/features/1_bpmn-editor.html#%D0%BF%D1%80%D0%BE%D1%81%D0%BC%D0%BE%D1%82%D1%80-%D1%81%D0%BE%D0%B3%D0%BB%D0%B0%D1%81%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B8">согласований</RouteLink>.
<img src="@source/features/comments-5.png" alt="image"></li>
</ol>
<h2 id="нотификации-по-почте-и-упоминания" tabindex="-1"><a class="header-anchor" href="#нотификации-по-почте-и-упоминания"><span>Нотификации по почте и упоминания</span></a></h2>
<p>По-умолчанию нотификацию по почте получает автор диаграммы. Если комментарий является ответом на другой, то автор родительского комментария тоже получит уведомление.</p>
<p>Если вы хотите, чтобы комментарий получит кто-то из членов вашей команды или тех, кто работает над диаграммой, то используйте символ @:</p>
<p><img src="@source/features/comments-6.png" alt="image"></p>
<h2 id="комментарии-при-согласовании" tabindex="-1"><a class="header-anchor" href="#комментарии-при-согласовании"><span>Комментарии при согласовании</span></a></h2>
<p>При согласовании овелей комментариев включается автоматически и в панеле согласований появляется аналог комментарий из правого меню:</p>
<p><img src="@source/features/comments-7.png" alt="image"></p>
<p>Если согласующему требуется оставить комментарий к элементу, у которого еще не было комментариев, то пока едиственный вариант - нажать на элемент правой кнопкой мышки и перейти во вкладку:</p>
<p><img src="@source/features/comments-8.png" alt="image"></p>
</div></template>


