<template><div><h1 id="тех-поддержка-и-администрирование" tabindex="-1"><a class="header-anchor" href="#тех-поддержка-и-администрирование"><span>Тех.поддержка и администрирование</span></a></h1>
<p>В данном разделе описаны варианты поддержки пользователей облачной версии и Enterprise-версии.</p>
<p>Для пользователей Enterprise-версии описаны традиционные задачи технического администрирования системы.</p>
<h2 id="каналы-поддержки" tabindex="-1"><a class="header-anchor" href="#каналы-поддержки"><span>Каналы поддержки</span></a></h2>
<p>Мы предоставляем 4 канала поддержки:</p>
<ul>
<li>Чат в приложении (кружочек в правой нижней части). Работает только в облачной версии.</li>
<li>Почта <strong>help@stormbpmn.com</strong></li>
<li>Портал <a href="https://stormbpmn.portal.happydesk.ru/login" target="_blank" rel="noopener noreferrer">техподдержки<ExternalLinkIcon/></a>. Способ для просмотра ваших заявок и статусов. На портале отдельная регистрация от облачной версии.</li>
<li><a href="https://t.me/stormbpmn_bot" target="_blank" rel="noopener noreferrer">@Stormbpmn_bot<ExternalLinkIcon/></a> - бот в телеграмм</li>
</ul>
<h2 id="информация-для-устранения-неисправности" tabindex="-1"><a class="header-anchor" href="#информация-для-устранения-неисправности"><span>Информация для устранения неисправности</span></a></h2>
<p>Для быстрого устранения неисправности приложите в свою заявку:</p>
<ul>
<li>Версию браузера <em>(если дело касается пользовательской ошибки)</em></li>
<li>Версию образа контейнера</li>
<li><a href="https://yandex.cloud/ru/docs/support/create-har" target="_blank" rel="noopener noreferrer">HAR-архив<ExternalLinkIcon/></a>, записанный в момент неисправности <em>(если дело касается пользовательской ошибки)</em></li>
<li>Актуальный лог контейнера</li>
<li>Описание сценария воспроизведения ошибки</li>
<li>Электронную почту пользователя <em>(если дело касается пользовательской ошибки)</em></li>
<li>Ссылку на диаграмму <em>(если дело касается конкретной диаграммы)</em></li>
</ul>
<h2 id="sla" tabindex="-1"><a class="header-anchor" href="#sla"><span>SLA</span></a></h2>
<table>
<thead>
<tr>
<th>#</th>
<th>Название</th>
<th>Team</th>
<th>Enterprise</th>
</tr>
</thead>
<tbody>
<tr>
<td>1</td>
<td>Время реагирования</td>
<td>5 рабочих дней</td>
<td>16 часов</td>
</tr>
<tr>
<td>2</td>
<td>Время устранения критической неисправности</td>
<td>30 рабочих дней</td>
<td>15 рабочих дней</td>
</tr>
</tbody>
</table>
<ul>
<li><strong>Рабочее время</strong>: с 11:00 до 20:00 по МСК (GMT+3), выходные и будни по ТК РФ.</li>
<li><strong>Критическая неисправность</strong>: невозможность применять инструмент для 100% пользователей.</li>
</ul>
<p>Для прочих типов неисправностей SLA для устранения не предоставляется.</p>
<div class="hint-container info">
<p class="hint-container-title">Инфо</p>
<p>Это SLA по-умолчанию, входящий в базовую поставку лицензий.</p>
<p>Для команд &gt;50 пользователей (облако) или Enterprise он может быть пересмотрен в рамках отдельного соглашения.</p>
</div>
</div></template>


